{"chunks_id": "chunk_0", "text": "INTRODUCTION OF SCHOOLS 1. SCHOOL OF AVIATION MANAGEMENT: The objective of this school is to develop competent leaders and managers. School of Aviation Management not only provides training and development initiatives pertaining to Aviation Management activities but at the same time manages the trainings of corporate and support functions of the Regulatory and Service provider functions of civil aviation. This includes common and specialty-wise management development programs at junior"}
{"chunks_id": "chunk_1", "text": "civil aviation. This includes common and specialty-wise management development programs at junior management, middle management and senior as well as top management levels, promotion-related courses, soft skills programs, trainings for corporate functions of Human Resource, Administration, Finance / Accounts, Safety, Security, Quality & Environmental Management, trainings for support functions such as Information Technology, Logistics, Legal Services, medical services, etc. 2. SCHOOL OF AIR"}
{"chunks_id": "chunk_2", "text": "such as Information Technology, Logistics, Legal Services, medical services, etc. 2. SCHOOL OF AIR NAVIGATION SERVICES The objective of the school is to impart comprehensive and high-quality training through classroom lectures, simulation exercises, and performance evaluations to individuals aspiring to join careers in Air Traffic Control, Communication Operations & CNS (Communication, Navigation & Surveillance) Engineering. The aim of School is to produce skilled, competent, and responsible"}
{"chunks_id": "chunk_3", "text": "& Surveillance) Engineering. The aim of School is to produce skilled, competent, and responsible Aviation professionals in the above fields who will play a vital role in ensuring the safety, order, and efficiency of the aviation system. 3. SCHOOL OF AIRPORT SERVICES The objective of the school is to impart comprehensive and high-quality training through classroom lectures, exercises, hands-on experiences and performance evaluations to individuals aspiring to join careers in Airport Services"}
{"chunks_id": "chunk_4", "text": "experiences and performance evaluations to individuals aspiring to join careers in Airport Services (Rescue & Fire Fighting Services, Terminal Facilities, Facilitation, Airside, Aerodrome Operations, Hospitality, Vigilance/Security), Cargo, Engineering Services (Civil, Electrical & Mechanical engineering) and Commercial & Estate. The aim of School is to produce skilled, competent, and responsible Aviation professionals in the above fields who will play a vital role in ensuring the safety,"}
{"chunks_id": "chunk_5", "text": "Aviation professionals in the above fields who will play a vital role in ensuring the safety, order, and efficiency of the aviation system. 4. SCHOOL OF REGULATORY SERVICES / FUNCTIONS The objective of this school is the capacity building of trainees in improving their professional competencies with respect to all functions of Regulatory and oversight functions. This school also provides trainings on ICAO Standards and Recommended Practices (SARPs), National / Operating Regulations, Air"}
{"chunks_id": "chunk_6", "text": "on ICAO Standards and Recommended Practices (SARPs), National / Operating Regulations, Air Transport and Economic Regulations (Economic oversight) functions. The School of Regulatory Services / Functions is a recently opened school, which would serve for the training needs of all the Regulatory and oversight functions but at the same time other functions may also obtain full benefits from this school. 5. ICAO TRAINAIR PLUS PROGRAMME CATI also has the full membership status of the ICAO TRAINIR"}
{"chunks_id": "chunk_7", "text": "5. ICAO TRAINAIR PLUS PROGRAMME CATI also has the full membership status of the ICAO TRAINIR PLUS PROGRAMME. All the TRAINAIR PLUS related courses are managed independently and such training programs are conducted in the relevant school in accordance with the title of the course. While undertaking any responsibility with respect to the TRAINAIRPLUS activity, the Course Development and its conduct is managed in accordance with the ICAO TRAINAIR PLUS requirements. INTRODUCTION OF SCHOOLS"}
{"chunks_id": "chunk_8", "text": "conduct is managed in accordance with the ICAO TRAINAIR PLUS requirements. INTRODUCTION OF SCHOOLS ENGINEERING SERVICES – ELECTRO-MECHANICAL (E/M): The Electro-Mechanical section at CATI plays a pivotal role in managing and maintaining the complex systems that involve electrical & mechanical facilities, equipment and systems along with their construction aspect. This section plays critical role in maintaining the infrastructure and technical systems essential for the smooth functioning and"}
{"chunks_id": "chunk_9", "text": "in maintaining the infrastructure and technical systems essential for the smooth functioning and safety of Schools, Sections and Residential Areas within CATI. FINANCE: The finance section handles all functions related to institutes’ financial well-being. Generally, a finance team is responsible for a variety of tasks, including accounting, budgeting, record keeping, administrative/ financial work and cash flow. HUMAN RESOURCE (HR): Human resource (HR) section handles all aspects related to"}
{"chunks_id": "chunk_10", "text": "work and cash flow. HUMAN RESOURCE (HR): Human resource (HR) section handles all aspects related to employees of CATI as well as all outsourced manpower contracts and services. HR also plays a vital role in supporting of CATI vision & mission. INFORMATION TECHNOLOGY (IT): The Information Technology (IT) section plays a crucial role across all schools and sections at CATI. Its responsibilities are diverse and impact nearly every aspect of modern businesses. Infrastructure Management, User, and"}
{"chunks_id": "chunk_11", "text": "diverse and impact nearly every aspect of modern businesses. Infrastructure Management, User, and Software Support are some of the key services at CATI. HOSTEL / MESS: The prime responsibilities of Hostel/ Mess section are to provide clean, peaceful, comfortable stay, and balanced and hygienic food to the trainees during their stay in CATI. MEDICAL CENTER: Medical Center offers 24/7 healthcare services to CAA employees, their families, and a large number of trainees at CATI. It provides"}
{"chunks_id": "chunk_12", "text": "services to CAA employees, their families, and a large number of trainees at CATI. It provides emergency treatment, temporary accommodation, indoor admission services, beds, a mini operation theatre and other essential amenities that are necessary for any medical facility with doctors and paramedical staff available round the clock; it ensures that healthcare needs are met promptly. ELECTRONICS SECTION: Operating within the domain of Operations and Installation, Electronics team involves a"}
{"chunks_id": "chunk_13", "text": "SECTION: Operating within the domain of Operations and Installation, Electronics team involves a diverse array of responsibilities essential for the smooth functioning of various electronic systems within an organization. Electronics professionals are tasked with a multifaceted role encompassing the oversight and maintenance of critical electronic infrastructures. SQMS: The primary role of this section is to verify by monitoring activities in the field of training, that the standards required"}
{"chunks_id": "chunk_14", "text": "section is to verify by monitoring activities in the field of training, that the standards required by the Regulatory (PCAA) and any additional requirements as established by CATI are being carried out properly under the supervision of Director CATI. All the internal audits of SQMS and external audits by the certification body are coordinated by this section. ENGINEERING SERVICES – CIVIL: CAMP COMMANDANT SPORTS EVENT MANAGEMENT RESEARCH & DEVELOPMENT SCHOOL OF ANS (ATSEP Block) CATI Contents"}
{"chunks_id": "chunk_15", "text": "COMMANDANT SPORTS EVENT MANAGEMENT RESEARCH & DEVELOPMENT SCHOOL OF ANS (ATSEP Block) CATI Contents School Brief Introduction: ........................................................................................................ 3 1. AUTOMATIC FIRE DETECTION SYSTEM (AFDS) EQUIPMENTMAINTENANCE(STP) COURSE ................................................................... 4 2. EXTENDED RANGE EVHF SYSTEM .......................................................................... 5 3. NON"}
{"chunks_id": "chunk_16", "text": "EVHF SYSTEM .......................................................................... 5 3. NON DIRECTIONAL BEACON (NDB) MAINTENANCE COURSE ......................... 6 4. Digital Voice Logging System (ASC Marathon) Operation and Maintenance Course .... 7 5. Networking Fundamentals Course (For Officers) ............................................................ 8 6. INDRA PRIMARY SURVEILANCE RADAR OPERATION & MAINTENANCE COURSE"}
{"chunks_id": "chunk_17", "text": "8 6. INDRA PRIMARY SURVEILANCE RADAR OPERATION & MAINTENANCE COURSE ................................................................................................................................ 10 7. INDRA MONO PULSE SECONDARY SURVEILLANCERADAR (MSSR) OPERATION & MAINTENANCE COURSE ...................................................................... 11 8. ELDIS MONO PULSE SECONDARY SURVEILLANCE RADAR OPERATION & MAINTENANCE COURSE"}
{"chunks_id": "chunk_18", "text": "11 8. ELDIS MONO PULSE SECONDARY SURVEILLANCE RADAR OPERATION & MAINTENANCE COURSE .................................................................................................. 12 9. Selex-Leonardo DVOR 1150A and DME 1119A Operation & Maintenance Course ... 13 10. Selex- Leonardo Instrument Landing System (ILS) Operation & Maintenance Course ..................................................................................................................................... 13 11. Basic"}
{"chunks_id": "chunk_19", "text": "13 11. Basic ATSEP Refresher Course (For Officers) ........................................................... 14 12. Automatic Dependent Surveillance Broadcast (ADS-B) Course for Officers ............ 15 13. Air Traffic Management System Operation and Maintenance Course(For Officers) . 16 14. Networking Fundamentals (For Staff) ........................................................................ 17 15. PCAA INFORMATION SYSTEMS COURSE (FOR OFFICERS) .......................... 18 16. PCAA"}
{"chunks_id": "chunk_20", "text": "17 15. PCAA INFORMATION SYSTEMS COURSE (FOR OFFICERS) .......................... 18 16. PCAA INFORMATION SYSTEMS COURSE (FOR STAFF) ................................. 19 17. Basic ATSEP Course (For CNS Technicians/Staff) ................................................... 20 18. ATSEP (General Electronics Systems) Course for CNS Technicians/Staff ............... 21 19. Surface Movement Radar (SMR) &Multi-Lateration (MLAT) Systems Operation & Maintenance Course"}
{"chunks_id": "chunk_21", "text": "21 19. Surface Movement Radar (SMR) &Multi-Lateration (MLAT) Systems Operation & Maintenance Course ............................................................................................................... 23 20. ATSEP (NAV-AIDS) TECHNICIAN COURSE........................................................ 24 21. ATSEP (DATA PROCESSING & NETWORKS) TECHNICIAN COURSE ........... 25 22. ATSEP (Radar) Technician Course ............................................................................"}
{"chunks_id": "chunk_22", "text": "Technician Course ............................................................................ 26 23. ATSEP (Radio Communication) Technician Course .................................................. 27 24. BASICATSEPENGINEERSCOURSE (UNDER REVISION) .................................. 28 School Brief Introduction: Welcome to the School of ANS (ATSEP Block), an integral part of the prestigious Air Navigation Services (ANS) School, specialized in comprehensive CNS (Communication, Navigation, and"}
{"chunks_id": "chunk_23", "text": "Navigation Services (ANS) School, specialized in comprehensive CNS (Communication, Navigation, and Surveillance) system trainings. Our courses cater to all levels, from fundamental to advanced, ensuring the proficiency of Air Traffic Safety Electronic Personnel (ATSEP) in practical and theoretical aspects. Committed to exceeding aviation industry standards, our training programs empower CNS Engineering professionals to operate and maintain equipment in accordance with ICAO and Pakistan CAA"}
{"chunks_id": "chunk_24", "text": "professionals to operate and maintain equipment in accordance with ICAO and Pakistan CAA regulations. Our innovative approach involves a blend of classroom sessions, hands-on workshops, and computer-aided learning in modern facilities. Moreover, field visits provide practical insights, enriching the learning process. Join us on a transformative journey toward excellence in Air Traffic Safety Electronics training, where we not only meet but surpass aviation industry standards. At the ATSEP"}
{"chunks_id": "chunk_25", "text": "Electronics training, where we not only meet but surpass aviation industry standards. At the ATSEP Block, we prepare our trainees for a future where they can confidently navigate the complexities of the aviation landscape with unparalleled proficiencies and skills. 1. AUTOMATIC FIRE DETECTION SYSTEM (AFDS)EQUIPMENTMAINTENANCE(STP)COURSE OBJECTIVE Aftersuccessfulcompletion,ofcoursethetrainees willbeableto: • Performdailychecks/maintenance. • Performmonthlychecks/maintenance. •"}
{"chunks_id": "chunk_26", "text": "willbeableto: • Performdailychecks/maintenance. • Performmonthlychecks/maintenance. • Performhalfyearlychecks/maintenance • Performyearlychecks/maintenance. • RepairAFDSEquipment. SCOPE This course is specially designed to improve the techniques for operation of Automatic FireDetection System for the personnel working in CNS system. After completion of this course thetraineewillbeabletooperateandmaintainAFDStechnically asgivenbymanufacturer’soperatingmanual. NOOFPARTICIPANTS(MIN-MAX):04-06"}
{"chunks_id": "chunk_27", "text": "asgivenbymanufacturer’soperatingmanual. NOOFPARTICIPANTS(MIN-MAX):04-06 ELIGIBILITY • Electronic Engineering personnel /staff successfully"}
{"chunks_id": "chunk_28", "text": "completed Basic ATSEPTechniciansCourseor anequivalentcourse • HavinggoodcommandofEnglishlanguage,both writtenandspoken. DURATION 02WEEKS Modules • IntroductiontoFireHazard • AutomaticFireDetectionSystem • FireSensors • OutputDevices/Indicators • StandardOperatingProcedureofAFDS • HoneywellZx5eAddressableFireSystem • HoneywellEN542-8ZoneConventional FireSystem 2. EXTENDED RANGE EVHF SYSTEM 1. Course Title VHF EXTENDED RANGE SYSTEM 2. Scope: This course is for CNS Engineering Staff and other"}
{"chunks_id": "chunk_29", "text": "Course Title VHF EXTENDED RANGE SYSTEM 2. Scope: This course is for CNS Engineering Staff and other technical personnel who are to carry out operations and maintenance of Extended Range VHF System at the Area Control Center and other locations. 3. Objectives The participants will be provided with adequate knowledge on the EVHF System and various devices, techniques and technology used in EVHF System besides practical training of operations and maintenance of the EVHF System. After successful"}
{"chunks_id": "chunk_30", "text": "besides practical training of operations and maintenance of the EVHF System. After successful completion of course the trainees will be able to: • explain the purpose and functions of EVHF System. • explain EVHF Radio equipment. • explainequipment configuration, antenna system, AC/DC Power system; • explain operation/utilization of Test equipment. • Identify common/operational problems in EVHF System and take necessary remedial actions, accordingly. 4. Duration 01 Week 5. Entry Qualification"}
{"chunks_id": "chunk_31", "text": "System and take necessary remedial actions, accordingly. 4. Duration 01 Week 5. Entry Qualification Electronics engineering personnel/staff successfully completed ‘ARM course” or an equivalent course. • Having good command of English language, both written and spoken. 6. Number of Participants Minimum : 06 Maximum : 10 7. Subjects / Modules / Events Ref. Modules / Subjects / Events M-00 M-01 M-02 M-03 M-04 Course Introduction. Review of Radio Communication & Airspace of Pakistan Extended Range"}
{"chunks_id": "chunk_32", "text": "M-03 M-04 Course Introduction. Review of Radio Communication & Airspace of Pakistan Extended Range VHF Communication System Detail of Equipment installed in Extended Range VHF Communication System. Practical Session of EVHF Communication System at RCAG station Hyderabad 3. NON DIRECTIONAL BEACON (NDB) MAINTENANCE COURSE 1. Course Title NON DIRECTIONAL BEACON (NDB) MAINTENANCE COURSE 2. Scope: This course is for CNS Staff and Personnel of other Organizations (e.g. PN, PAF etc) who are to carry"}
{"chunks_id": "chunk_33", "text": "course is for CNS Staff and Personnel of other Organizations (e.g. PN, PAF etc) who are to carry out operations and maintenance of NDB Equipment at the Airport and other Locations. 3. Objectives The participants will be provided with adequate knowledge on NDB Facility, circuit analysis techniques, and technology used in NDB Equipment besides practical training of operations and maintenance of the NDB Equipment Make Nautel, Model ND-500-02. After successful completion of course the trainees will"}
{"chunks_id": "chunk_34", "text": "NDB Equipment Make Nautel, Model ND-500-02. After successful completion of course the trainees will be able to: • Comprehend the purpose and working principles of NDB Equipment. • Comprehend equipment configuration, antenna system & monitoring. • Perform and evaluate the health checks of equipment by observing the various indications on the equipment. • Perform monitoring and record various parameters of the equipment. • Perform diagnostics for any abnormality. (Fwd/ Ref Powers, Power Supply"}
{"chunks_id": "chunk_35", "text": "of the equipment. • Perform diagnostics for any abnormality. (Fwd/ Ref Powers, Power Supply input/output limits, ) • Perform fault isolation if any. • Perform replacement of faulty modules if available. • Perform Quarterly schedule/ preventive maintenance in accordance with schedule issued by HQCAA and be able to reflect in IOU report of the following day. • Perform calibration of parameters in coordination with HQCAA & EED 4. Duration 02 Weeks 5. Entry Qualification CNS/ Electronics"}
{"chunks_id": "chunk_36", "text": "in coordination with HQCAA & EED 4. Duration 02 Weeks 5. Entry Qualification CNS/ Electronics Engineering personnel/staff successfully completed ‘Basic ATSEP Technician course” or an equivalent course. Good command of solid state & digital electronics with minimum two years field/practical experience. Having good command of English language, both written and spoken. 6. Number of Participants Minimum : 06 Maximum : 10 7. Subjects / Modules / Events Ref. Modules / Subjects / Events M-00"}
{"chunks_id": "chunk_37", "text": "Minimum : 06 Maximum : 10 7. Subjects / Modules / Events Ref. Modules / Subjects / Events M-00 Introduction & Orientation. M-01 Principles of NDB operations. M-02 NDB Equipment. M-03 NDB operating procedures. M-04 Preventive maintenance procedure. 4. Digital Voice Logging System (ASC Marathon) Operation and Maintenance Course 1. Course Title DIGITAL VOICE LOGGING SYSTEM (ASC MARATHON) OPERATION AND MAINTEINANCE COURSE. 2. Scope: This course is for Electronics Engineering personnel and other"}
{"chunks_id": "chunk_38", "text": "AND MAINTEINANCE COURSE. 2. Scope: This course is for Electronics Engineering personnel and other technical personnel who are to carry out operations and maintenance of Digital Voice Logging System (DVLS) ASC Marathon. 3. Objectives The participants will be provided with adequate knowledge about basic Voice logging techniques, besides practical training of operations and maintenance of the ASC Marathon Digital Voice Logging System. After successful completion of course the trainees will be able"}
{"chunks_id": "chunk_39", "text": "Digital Voice Logging System. After successful completion of course the trainees will be able to: ▪ Terminate the analog lines to the recorder through TIFF. ▪ Turn on and login to the system. ▪ Shutdown the recorder as per the procedure. ▪ Understand and interpret channel’s states on the portal and trace the fault, if any, in event log. ▪ Download log files to dispatch further to EED or OEM. ▪ Search a specific recording, transfer it to a CCB and archive the CCB on portable medium ▪ Create,"}
{"chunks_id": "chunk_40", "text": "Search a specific recording, transfer it to a CCB and archive the CCB on portable medium ▪ Create, append and manipulate CCB. ▪ Monitor the channels for ongoing (live) recording of calls. ▪ Make basic configurations in ADM, i.e. o User creation o Rights assignments o Job configuration o Channel configuration o TAM configuration ▪ Troubleshoot ASC Marathon DVLS recorder in case of malfunction. 4. Duration 02 Week 5. Entry Qualification Electronic Engineering personnel successfully completed"}
{"chunks_id": "chunk_41", "text": "4. Duration 02 Week 5. Entry Qualification Electronic Engineering personnel successfully completed Basic course or an equivalent course and have good knowledge of computers Having good command of English language, both written and spoken. 6. Number of Participants Minimum : 06 Maximum : 10 7. Subjects / Modules / Events Ref. Modules / Subjects / Events M-00 Course Introduction and Orientation M-01 Introduction to Computer and DVLS Operation M-02 ASC Marathon Communication Recorder quick"}
{"chunks_id": "chunk_42", "text": "M-01 Introduction to Computer and DVLS Operation M-02 ASC Marathon Communication Recorder quick installation/ User guide M-03 ASC Marathon Communication RecorderInstallation and Setup in different airports/Hardware in general of system. Plus power play (user guide) M-04 ASC Marathon Communication Recorder Data Manager configuration(ADM) M-05 ASC Marathon Communication Recorder quick service guide/ Maintenance and Troubleshooting 5. Networking Fundamentals Course (For Officers) 1. Course Title"}
{"chunks_id": "chunk_43", "text": "Maintenance and Troubleshooting 5. Networking Fundamentals Course (For Officers) 1. Course Title Networking Fundamentals Course 2. Scope: This course is for CNS Engineering personnel and other Sections i.e. IT etc who are to carry out operations and maintenance of Network Infrastructure and Database Administration of the Systems installed at the airport terminal buildings and other locations. 3. Objectives After Successful completion of the course, officer will be able to: • Design and"}
{"chunks_id": "chunk_44", "text": "3. Objectives After Successful completion of the course, officer will be able to: • Design and Configure a Basic Network • Understand any Technical Reference or Documentation on Networking Standards and Devices • Configure Network Parameters of any OS based Host. • Basic Configuration of any Switching/Routing Device • Troubleshooting of Common Network Faults and Failures. • Understand the basics of Network and Cyber Security • Understand Database Management System and Structured Query"}
{"chunks_id": "chunk_45", "text": "basics of Network and Cyber Security • Understand Database Management System and Structured Query Language’s Commands and Syntax. • 4. Duration 02 Weeks 5. Entry Qualification Must have completed Basic ATSEP course / ATSEP Technician Course or equivalent or have a Basic Understanding of Computer Systems and IT infrastructure. 6.Numbers of participants Minimum =06 Maximum = 12 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 M-00 Introduction & Orientation, Ethics,"}
{"chunks_id": "chunk_46", "text": "DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 M-00 Introduction & Orientation, Ethics, Discipline & Workplace safety Measures. Module 1 M-01 Introduction to Computer Networking (A Practical Approach) Module 2 M-02 How Data Moves Through a Network Module 3 M-03 Practical Approach Towards IP, Subletting, VLANs and ACLs Module 4 M-04 Common Network Protocols Module 5 M-05 Network Troubleshooting Techniques Module 6 M-06 WAN Technologies Module 7 M-07 Defining Network and Cyber Security Module 8"}
{"chunks_id": "chunk_47", "text": "Module 6 M-06 WAN Technologies Module 7 M-07 Defining Network and Cyber Security Module 8 M-08 Introduction to Database Management System (DBMS) Module 9 M-09 Structured Query Language (SQL) 6. INDRA PRIMARY SURVEILANCE RADAR OPERATION & MAINTENANCE COURSE 1. Course Title INDRA PRIMARY SURVEILANCE RADAR OPERATION & MAINTENANCE COURSE 2. Scope: This course is for Electronics Engineering/CNS officerwho are to carry out operation and maintenance of Indra PSR at the Airports. 3. Objectives After"}
{"chunks_id": "chunk_48", "text": "are to carry out operation and maintenance of Indra PSR at the Airports. 3. Objectives After successful completion of this course , CNS officer will be able to operate, maintain and perform fault finding of INDRA PSR System in accordance with the guide lines given in Indra PSR User manualDoc.No: 0066500000031MA00Edit./Rev.: C/0 provided by M/s Indra 4. Duration 04 Weeks 5. Entry Qualification Must have completed Airport Electronics Engineer course / Basic ATSEP course for Engineers and having"}
{"chunks_id": "chunk_49", "text": "have completed Airport Electronics Engineer course / Basic ATSEP course for Engineers and having good knowledge of computer networking /Local Area Network 6.Numbers of participants Maximum =08 Minimum =06 7.Subjects/modules/Events Ref Module/subject/Events M-00 Introduction & Orientation M-01 Basic overview , Antenna and Pedestal Group (APG) M-02 Dual Rotary Control Group (DRCG/PTCP/Junction Box) M-03 Microwave Group (MWG) and Compressor Dehydrator M-04 Transmitter Group (TXG) M-05 Generator,"}
{"chunks_id": "chunk_50", "text": "M-03 Microwave Group (MWG) and Compressor Dehydrator M-04 Transmitter Group (TXG) M-05 Generator, Receiver and Processor Group (GRPG) M-06 LAN Network M-07 Control and Monitoring System (CMS) M-08 PPI Radar Data Display M-09 Radar Data Visualization Tool (RDV) M-10 Radar Data combiner M-11 Practical Exercise for PSR 7. INDRA MONO PULSE SECONDARY SURVEILLANCERADAR (MSSR) OPERATION &MAINTENANCE COURSE 1. Course Title INDRA Mono pulse Secondary Surveillance Radar Operation & Maintenance Course 2."}
{"chunks_id": "chunk_51", "text": "1. Course Title INDRA Mono pulse Secondary Surveillance Radar Operation & Maintenance Course 2. Scope: This course is for Electronics Engineering officer and other technical personnel who are to carry out operation and maintenance of INDRA SSR at the airport and other locations. 3. Objectives Acquisition of the necessary knowledge and skills for Supervision, Control and Maintenance of MSSR-S system for M/s INDRA 4. Duration 04 Weeks 5. Entry Qualification 1. Must have completed Airport"}
{"chunks_id": "chunk_52", "text": "system for M/s INDRA 4. Duration 04 Weeks 5. Entry Qualification 1. Must have completed Airport Electronics Engineer course / Basic ATSEP course for Engineers and having good knowledge of computer networking /Local Area Network OR 2. A technical officer of Executive group, having maintenance Experience of at least 3 years on CNS systems and having good knowledge of computer networking/Local Area Network(LAN) 6.Numbers of participants Maximum =10Minimum =08 7.Subject/modules/Events Ref"}
{"chunks_id": "chunk_53", "text": "Area Network(LAN) 6.Numbers of participants Maximum =10Minimum =08 7.Subject/modules/Events Ref Module/subject/Events M-00 Introduction & Orientation M-01 Secondary Surveillance Radar System Basic M-02 Antenna M-03 MSSR-S Interrogator M-04 Visual Radar 3000 Graphic Subsystem (VR3000) M-05 LAN Network M-06 Control & Monitoring systems M-07 Far Field Monitor TXP-1000BC M-08 Practical Exercise for INDRA MSSR 8. ELDIS MONOPULSE SECONDARY SURVEILLANCE RADAR OPERATION & MAINTENANCE COURSE 1. Course"}
{"chunks_id": "chunk_54", "text": "INDRA MSSR 8. ELDIS MONOPULSE SECONDARY SURVEILLANCE RADAR OPERATION & MAINTENANCE COURSE 1. Course Title Eldis Mono pulse Secondary Surveillance Radar Operation & Maintenance Course 2. Scope: This course is for Electronics Engineering officer and other technical personnel who are to carry out operations and maintenance of SSR at the airport and other locations. 3. Objectives Acquisition of the necessary knowledge and skills for SUPERVISION, CONTROL and MAINTENANCE for Eldis MSSR-1 4. Duration"}
{"chunks_id": "chunk_55", "text": "knowledge and skills for SUPERVISION, CONTROL and MAINTENANCE for Eldis MSSR-1 4. Duration 04 Weeks 5. Entry Qualification Basic ATSEP Engineer course or equal. OR A technical officer of Executive group, having maintenance Experience of at least 3 years on CNS system 6.Numbers of participants Maximum =10 Minimum =08 7.Subject/modules/Events Ref Module/subject/Events M-00 INTRODUCTION & ORIENTATION M-01 BASIC CONCEPTS ON MSSR MODE-S SYSTEMS M-02 INTRODUCTION M-03 ABBREVIATIONS AND TERM"}
{"chunks_id": "chunk_56", "text": "M-01 BASIC CONCEPTS ON MSSR MODE-S SYSTEMS M-02 INTRODUCTION M-03 ABBREVIATIONS AND TERM DEFINITIONS M-04 MSSR-1 SYSTEM OVERVIEW M-05 SYSTEM OF ELECTRICAL PARTS ADDRESSING, SYSTEM OF CABLES LABELING. M-06 ANTENNA SYSTEM (ANTENNA LVA ASSR-35, PEDESTAL) M-07 RADAR SITE M-08 DESCRIPTION OF FUNCTIONAL BLOCKS M-09 MSSR-1 RADAR ENGINEER’S CHECK CONSOLE M-10 DESCRIPTION OF LAN AND DATA TRANSMISSION BETWEEN RADAR AND TECHNICAL ROOM M-11 SUB SYSTEMS DESCRIPTION M-12 Practical Exercise for MSSR 9."}
{"chunks_id": "chunk_57", "text": "BETWEEN RADAR AND TECHNICAL ROOM M-11 SUB SYSTEMS DESCRIPTION M-12 Practical Exercise for MSSR 9. Selex-Leonardo DVOR 1150A and DME 1119A Operation & Maintenance Course 1. Course Title Selex-Leonardo DVOR & DME Operation & Maintenance Course 2. Scope: This Course is designed for CNS Officers to carry-out operation & maintenance of Selex-Leonardo DVOR/ DME at Airports of Pakistan. 3. Objectives After Successful completion of the course, officer will be able to carry out Operation and Maintenance"}
{"chunks_id": "chunk_58", "text": "Successful completion of the course, officer will be able to carry out Operation and Maintenance of Selex-Leonardo DVOR and DME. And also fault identification, detection and rectification of DVOR and DME. 4. Duration 04 Weeks 5. Entry Qualification Must have completed Airport Electronics Engineer course / Basic ATSEP course for Officers or equivalent and having good knowledge Local Area Network 6.Numbers of participants Minimum = 06 Maximum = 08 7.Subjects/modules/Events DISTRIBUTIONS REF"}
{"chunks_id": "chunk_59", "text": "6.Numbers of participants Minimum = 06 Maximum = 08 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation, Ethics, Discipline & Workplace safety Measures. Module 1 Selex-Leonardo DVOR (1150A) Operations & Maintenance Module 2 Selex-Leonardo DME (1119A) Operations & Maintenance Module 3 RCSU/ RSU Operations & Maintenance 10. Selex-LeonardoInstrument Landing System (ILS) Operation & Maintenance Course 1. Course Title Selex- LeonardoInstrument"}
{"chunks_id": "chunk_60", "text": "Landing System (ILS) Operation & Maintenance Course 1. Course Title Selex- LeonardoInstrument Landing System (ILS) Operation &Maintenance Course 2. Scope: This course is for Electronics Engineering officer and other technical personnel who are to carry out operation and maintenance of Selex ILS at the airports and other locations. 3. Objectives Acquisition of the necessary knowledge and skills for Supervision, Control and Maintenance for Selex- Leonardo ILS 4. Duration 04 Weeks 5. Entry"}
{"chunks_id": "chunk_61", "text": "for Supervision, Control and Maintenance for Selex- Leonardo ILS 4. Duration 04 Weeks 5. Entry Qualification Must have completed Airport Electronics Engineer course / Basic ATSEP course for Engineers and having good knowledge of computer networking /Local Area Network 6.Numbers of participants Maximum =08 Minimum = 06 7.Subjects/modules/Events DISTRIBUTIONS MODULE/SUBJECT/EVENTS M-00 Introduction & Orientation M-01 Principle of ILS M-02 Selex-Leonardo capture effect Glide slope and localizer"}
{"chunks_id": "chunk_62", "text": "& Orientation M-01 Principle of ILS M-02 Selex-Leonardo capture effect Glide slope and localizer M-03 Operations, maintenance & performance checks of Glide slope and Localizer M-04 Terminal Distance Measuring Equipment(TDME) 11. Basic ATSEP Refresher Course (For Officers) 1. Course Title ATSEP Refresher Course 2. Scope: This course is designed to update and refresh the knowledge and skills of CNS professionals. The course covers topics such as communication, navigation, & surveillance systems,"}
{"chunks_id": "chunk_63", "text": "professionals. The course covers topics such as communication, navigation, & surveillance systems, safety management systems, regulations & procedures, and emerging technologies in the aviation industry. 3. Objectives The objective of this course is to enable trainees to • Maintain their competence and professionalism as ATSEP professionals. • Understand and apply the latest technologies, regulations, & procedures in the aviation industry, • Enhance the safety and efficiency of air traffic"}
{"chunks_id": "chunk_64", "text": "& procedures in the aviation industry, • Enhance the safety and efficiency of air traffic management operations. • Provide better guidance and supervisionin the installation, operation, and maintenance of aeronautical electronics equipment, in accordance with the ATSEP training manual. 4. Duration 01 Week 5. Entry Qualification An Electronics personnel having successfully completed Ab-initio / Basic Training or having experience of more than 05 years in CNS service. 6.Numbers of participants"}
{"chunks_id": "chunk_65", "text": "Basic Training or having experience of more than 05 years in CNS service. 6.Numbers of participants Minimum =06 Maximum = 16 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation, Ethics, Discipline & Workplace safety Measures. Module 1 Introduction to Civil Aviation and its Standards Module 2 Air Traffic Familiarization Module 3 Essentials of ATSEP 12. Automatic Dependent Surveillance Broadcast (ADS-B) Course for Officers 1. Course Title"}
{"chunks_id": "chunk_66", "text": "of ATSEP 12. Automatic Dependent Surveillance Broadcast (ADS-B) Course for Officers 1. Course Title Automatic Dependent Surveillance Broadcast (ADS-B) Course 2. Scope: This course is for CNS Officers who are to carry out operation of ADS-B Systems installed at different locations. 3. Objectives Acquisition of the necessary knowledge and understanding of concepts regarding ADS-B Systems and their use for surveillance purposes. 4. Duration 01 Week 5. Entry Qualification Must have completed"}
{"chunks_id": "chunk_67", "text": "their use for surveillance purposes. 4. Duration 01 Week 5. Entry Qualification Must have completed Airport Electronics Engineer course / Basic ATSEP OR Equivalent having good knowledge of computer hardware and software. 6.Numbers of participants Minimum = 06 Maximum = 12 7.Subjects/modules/Events DISTRIBUTIONS Module 0 Module 1 ADS-B Theory, Principles and related Concepts Module 2 ADS-B Setup and Configuration in Pakistan Module 3 Becker Aero Working Positions and Configuration Tools 13. Air"}
{"chunks_id": "chunk_68", "text": "Configuration in Pakistan Module 3 Becker Aero Working Positions and Configuration Tools 13. Air Traffic Management System Operation and Maintenance Course(For Officers) 1. Course Title Air Traffic Management System Course 2. Scope: This course is initial level training for CNS Officers who will carry out Operations and Maintenance duties on Air Traffic Management System in future, after attending Equipment Specific Training / OJT. 3. Objectives After completion of this course the trainee will"}
{"chunks_id": "chunk_69", "text": "Equipment Specific Training / OJT. 3. Objectives After completion of this course the trainee will be able to understand and describe: • What is the purpose of ATM System and functionalities offered by the ATM system? • Impact of ATM System on Air Traffic Services? • System Design and Architecture of ATM System? • Network Architecture of different ATM Systems installed in Pakistan • How to operate Operating System of ATM System 4. Duration 02 Weeks 5. Entry Qualification Must have completed"}
{"chunks_id": "chunk_70", "text": "Operating System of ATM System 4. Duration 02 Weeks 5. Entry Qualification Must have completed Airport Electronics Engineer course / Basic ATSEP Officers course 6.Numbers of participants Minimum = 06 Maximum = 12 7.Subjects/Modules/Events Ref. MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation Module 1 Air Traffic Management Familiarization Module 2 Air Traffic Management System Fundamentals Module 3 ATM System Servers Principles Module 4 ATM System Work Positions Principles Module 5"}
{"chunks_id": "chunk_71", "text": "Module 3 ATM System Servers Principles Module 4 ATM System Work Positions Principles Module 5 Network Architecture of ATM System Module 6 Introduction to ATM System Operating System 14. Networking Fundamentals (For Staff) 1. Course Title Networking Fundamentals Course 2. Scope: This course is for CNS staff personnel and other Sections i.e. IT etc who are to carry out operations and maintenance of Network Infrastructure and Database Administration of the Systems installed at the airport terminal"}
{"chunks_id": "chunk_72", "text": "Network Infrastructure and Database Administration of the Systems installed at the airport terminal buildings and other locations. 3. Objectives After Successful completion of the course, staff will be able to: • Design and Configure a Basic Network • Understand any Technical Reference or Documentation on Networking Standards and Devices • Configure Network Parameters of any OS based Host. • Basic Configuration of any Switching/Routing Device • Troubleshooting of Common Network Faults and"}
{"chunks_id": "chunk_73", "text": "Basic Configuration of any Switching/Routing Device • Troubleshooting of Common Network Faults and Failures. • Understand the basics of Network • Understand Database Management System and Structured Query Language’s Commands and Syntax. 4. Duration 02 Weeks 5. Entry Qualification Must have completed Basic ATSEP Technician Course or equivalent or have a Basic Understanding of Computer Systems and IT infrastructure. 6.Numbers of participants Minimum =06 Maximum = 12 7.Subjects/modules/Events"}
{"chunks_id": "chunk_74", "text": "and IT infrastructure. 6.Numbers of participants Minimum =06 Maximum = 12 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 M-00 Introduction & Orientation, Ethics, Discipline & Workplace safety Measures. Module 1 M-01 Introduction to Computer Networking (A Practical Approach) Module 2 M-02 How Data Moves Through a Network Module 3 M-03 Practical Approach Towards IP, Subletting&VLANs Module 4 M-04 Common Network Protocols Module 5 M-05 Network Troubleshooting Techniques"}
{"chunks_id": "chunk_75", "text": "Module 4 M-04 Common Network Protocols Module 5 M-05 Network Troubleshooting Techniques Module 6 M-06 WAN Technologies Module 7 M-07 Defining Networks Module 8 M-08 Introduction to Database Management System (DBMS) Module 9 M-09 Structured Query Language (SQL) 15. PCAA INFORMATION SYSTEMS COURSE (FOR OFFICERS) 1. Course Title PCAA information Systems Course (Officers) 2. Scope: This Course is designed for all officers of CAA using IT services or any IT equipment for day-to-day office work. 3."}
{"chunks_id": "chunk_76", "text": "for all officers of CAA using IT services or any IT equipment for day-to-day office work. 3. Objectives To provide understanding of Aviation IT Systems and enhance awareness of aviation cyber security in accordance with IT Standards, Policies and procedures, given that training material is sufficiently available to all the participants. 4. Duration 01 Week 5. Entry Qualification Must be an employee (Officer) of CAA using IT services or equipment. 6.Numbers of participants Minimum =06 Maximum ="}
{"chunks_id": "chunk_77", "text": "(Officer) of CAA using IT services or equipment. 6.Numbers of participants Minimum =06 Maximum = 12 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation Module 1 Information Systems at Airport Module 2 IT Equipment Handling & Requisition Module 3 Access to PCAA Information Systems Module 4 IT Helpdesk Support & services Module 5 IT Governance and Overview of Information Security Standards Module 6 Information System Security Awareness Module 7"}
{"chunks_id": "chunk_78", "text": "Overview of Information Security Standards Module 6 Information System Security Awareness Module 7 CAA Business Application 16. PCAA INFORMATION SYSTEMS COURSE (FOR STAFF) 1. Course Title PCAA information Systems Course (Staff) 2. Scope: This Course is designed for staff of CAA using IT services or any IT equipment for day-to-day office work. 3. Objectives To enhance IT Skills and computer literacy of CAA Staff and to provide awareness and understanding of Aviation IT Systems in accordance with"}
{"chunks_id": "chunk_79", "text": "of CAA Staff and to provide awareness and understanding of Aviation IT Systems in accordance with IT Standards, Policies and procedures, given that training material is sufficiently available to all the participants. 4. Duration 01 Week 5. Entry Qualification Must be a computer literate employee (Staff) of CAA using IT services or equipment. 6.Numbers of participants Minimum =06 Maximum = 12 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation"}
{"chunks_id": "chunk_80", "text": "DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation Module 1 Information Systems at Airport Module 2 IT Equipment Handling & Requisition Module 3 Access to PCAA Information Systems Module 4 IT Helpdesk Support & services Module 5 Basic IT Troubleshooting& Office Automation Module 6 Information System Security Awareness Module 7 CAA Business Application 17. Basic ATSEP Course (For CNS Technicians/Staff) 1. Course Title Basic ATSEP Course For CNS Technicians/Staff 2."}
{"chunks_id": "chunk_81", "text": "Course (For CNS Technicians/Staff) 1. Course Title Basic ATSEP Course For CNS Technicians/Staff 2. Scope: This course is designed as an ab-initio training for CNS Technicians/ Staff. This course will cover the basic electronics concepts which are essentially required for skillful CNS Technicians/Staff. This course is designed for fresh inductees as well as existing CNS staff. 3. Objectives After successful completion of this course the trainees will: - Be able to understand: • Common Aviation •"}
{"chunks_id": "chunk_82", "text": "completion of this course the trainees will: - Be able to understand: • Common Aviation • Basic Electrical concepts • Fundaments of Electronics • Digital Electronics • Principles of Radio Communication • Soldering and De Soldering • Test Equipment Selection and Application - Qualify for various ATSEP (Trade Specific) courses for CNS Technicians/ Staff. 4. Duration 09 Weeks 5. Entry Qualification Newly Inducted CNS Technicians/Staff - Existing CNS Technicians/Staff who have not received Basic"}
{"chunks_id": "chunk_83", "text": "Newly Inducted CNS Technicians/Staff - Existing CNS Technicians/Staff who have not received Basic Training on ATSEP - 6.Numbers of participants Minimum = 08 Maximum = 16 - 7.Subjects/Modules/Events DISTRIBUTIONS - REF MODULE/SUBJECT/EVENTS Module 0 M-00 Introduction & Orientation Module 1 M-01 Common Aviation Training Module 2 M-02 Basic Electrical Concepts Module 3 M-03 Fundamental of Electronics Module 4 M-04 Digital Electronics Module 5 M-05 Principles of Radio Communication Module 6 M-06"}
{"chunks_id": "chunk_84", "text": "Module 4 M-04 Digital Electronics Module 5 M-05 Principles of Radio Communication Module 6 M-06 Soldering And De Soldering Module 7 M-07 Test Equipment Selection & Application 18. ATSEP (General Electronics Systems) Course for CNS Technicians/Staff 1. Course Title ATSEP (General Electronics Systems) Course for CNS Technicians/Staff 2. Scope: This course is designed for CNS Maintenance Technicians/Staff who will be deployed for operation & maintenance duties of General Electronics Systems at"}
{"chunks_id": "chunk_85", "text": "who will be deployed for operation & maintenance duties of General Electronics Systems at locations. 3. Objectives After completion of this course, the trainees will develop the: a) Understanding of significance, scope and application of AFDS, CCTV, PAS and MCS in Civil Aviation. b) Skills to apply the basic concepts, fundamentals, underlying theory and working principle of AFDS, CCTV, PAS and MCS in their field. c) Understandings of various types of systems, technologies, their comparisons,"}
{"chunks_id": "chunk_86", "text": "MCS in their field. c) Understandings of various types of systems, technologies, their comparisons, design standards, system limitations and scenario-based solutions. d) Understandings of the purpose, working, specifications, capacity and limitations of system components, units, modules, devices etc. e) Necessary skillset to execute small-scale installation, maintenance and feasibility study independently in General Electronics Systems. Ability to perform preventive maintenance and first-level"}
{"chunks_id": "chunk_87", "text": "in General Electronics Systems. Ability to perform preventive maintenance and first-level troubleshooting and take remedial actions for common faults in General Electronics Systems. 4. Duration 12 Weeks 5. Entry Qualification Must have completed Basic ATSEP Course for CNS Technicians/Staff or equivalent such as: Basic ARM Course 6. Numbers of participants Minimum = 08 Maximum = 16 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation, Ethics,"}
{"chunks_id": "chunk_88", "text": "DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation, Ethics, Discipline & Workplace safety Measures. Module 1 General Electronics Overview Module 2 CCTV System Module 3 Public Address System Module 4 Master Clock System Module 5 Practical Works / Equipment Orientation for CCTV System, Public Address System and Master Clock System Module 6 Automatic Fire Detection System Module 7 Practical Works / Equipment Orientation for Automatic Fire Detection System. 19. Surface"}
{"chunks_id": "chunk_89", "text": "Module 7 Practical Works / Equipment Orientation for Automatic Fire Detection System. 19. Surface Movement Radar (SMR) &Multi-Lateration (MLAT) Systems Operation & Maintenance Course 1. Course Title Surface Movement Radar(SMR)& Multi- Lateration (MLAT) Systems Operation & Maintenance Course 2. Scope: The course is for CNS officers who willcarry outOperation and Maintenance duties onTerma SMR & ERA MLAT Systems. 3. Objectives After completion of this course the trainee will be able to: a)"}
{"chunks_id": "chunk_90", "text": "& ERA MLAT Systems. 3. Objectives After completion of this course the trainee will be able to: a) Understand & describe Radar Basics & different types of Radar system being used in PCAA b) understand and describe Working Principles of SMR & MLAT c) understand and describe SMR & MLAT System components &functional Block Diagram d) To Operate SMR & MLAT System e) To perform preventive/ corrective maintenance of SMR & MLAT system as per OEM Maintenance & TechnicalManuals f) Application &"}
{"chunks_id": "chunk_91", "text": "maintenance of SMR & MLAT system as per OEM Maintenance & TechnicalManuals f) Application & utilization of SMR & MLAT systems for ATS on ASMGCS. 4. Duration 02 Week (The course is designed to be conducted at Equipment Site i.e. AIIAP, Lahore) 5. Entry Qualification CNS officers (EG-01 and above) must have completed Airport Electronics Engineer course / Basic ATSEP course for CNS Officers. 6.Numbers of participants Minimum = 04 Maximum = 12 7.Subjects/Modules/Events DISTRIBUTIONS Ref."}
{"chunks_id": "chunk_92", "text": "6.Numbers of participants Minimum = 04 Maximum = 12 7.Subjects/Modules/Events DISTRIBUTIONS Ref. MODULE/SUBJECT/EVENTS Module 0 Module1 Radar Basics & Types of Radar Systems in PCAA Module 2 TERMA SMR Scanter-5502 Operation& Maintenance Module 3 ERA MLAT NEO-A LHE Operation & Maintenance 20. ATSEP (NAV-AIDS) TECHNICIAN COURSE 1. Scope This course is designed for CNS Maintenance Technicians/Staff who will be deployed for operation & maintenance duties of Navigational Aids Equipment at locations."}
{"chunks_id": "chunk_93", "text": "will be deployed for operation & maintenance duties of Navigational Aids Equipment at locations. 2. Objective After successful completion of this course, the trainees will develop the: ⮚ Understanding of significance, scope and application of Navigational Aids utilized in Civil Aviation. ⮚ Understanding of various types of Navigational Aids systems. ⮚ Skills to operate and maintain Radio Nav-Aids. ⮚ Ability to assist in Flight calibration of Radio Navigations systems. ⮚ Skills to assist in"}
{"chunks_id": "chunk_94", "text": "⮚ Ability to assist in Flight calibration of Radio Navigations systems. ⮚ Skills to assist in execution of installation of Radio Navigation systems. ⮚ 3. Entry Qualification : Must have completed Basic ATSEP Course for CNS Technician/Staff or equivalent such as: Basic ARM Course 4. No. of Participants : Minimum - 06 Maximum - 16 5. Duration :06 Weeks 6. Subjects / Modules / Events Module 0 Introduction & Orientation Module 1 Radio Navigation Systems and Types Module 2 Selex Leonardo Capture"}
{"chunks_id": "chunk_95", "text": "& Orientation Module 1 Radio Navigation Systems and Types Module 2 Selex Leonardo Capture Effect Localizer 2100 Module 3 Selex Leonardo Capture Effect Glide Slope 2110 Module 4 Selex Leonardo DVOR 1150A Module 5 Selex Leonardo DME/TDME 1119A/1118A Module 6 Nautel ND-500 Non-Directional Beacon (NDB) 21. ATSEP (DATA PROCESSING & NETWORKS) TECHNICIAN COURSE 1. Scope This course is designed for CNS Maintenance Technicians/Staff who will be deployed for operation & maintenance duties on CNS Systems"}
{"chunks_id": "chunk_96", "text": "Technicians/Staff who will be deployed for operation & maintenance duties on CNS Systems related to Data Processing and Networks. 2. Objective After successful completion of this course, the trainees will : ⮚ Acquire necessary skills and knowledge including Networking, Linux OS and Databases required to operate any Data Processing System. ⮚ Understand the purpose, working, specifications, capacity and limitations of system components, units, modules, device etc. of CNS Data Processing systems"}
{"chunks_id": "chunk_97", "text": "and limitations of system components, units, modules, device etc. of CNS Data Processing systems including ATM, VCCS, DVLS, DVR, AMHS, AIMS, D-ATIS and FIDS systems. ⮚ Operate and maintain CNS Data Processing Systems. ⮚ Perform first-level troubleshooting and take remedial actions for common faults on CNS Data Processing Systems. 3. Entry Qualification : Must have completed Basic ATSEP Course for CNS Technician/Staff or equivalent such as: Basic ARM Course 4. No. of Participants : Minimum - 06"}
{"chunks_id": "chunk_98", "text": "CNS Technician/Staff or equivalent such as: Basic ARM Course 4. No. of Participants : Minimum - 06 Maximum - 16 5. Duration :08 Weeks 6. Subjects / Modules / Events MODULE No Module Name MODULE – 1 Telecommunication Network Infrastructure MODULE – 2 Fundamentals of Linux Operating System MODULE – 3 Introduction to Databases MODULE – 4 Aeronautical Message Handling System & AIMS System MODULE – 5 D-ATIS and Flight Information Display System MODULE – 6 Telephony, VCCS, DVR and DVLS Systems MODULE"}
{"chunks_id": "chunk_99", "text": "and Flight Information Display System MODULE – 6 Telephony, VCCS, DVR and DVLS Systems MODULE – 7 Air Traffic Management System MODULE - 8 Practical Works / Equipment Orientation 22. ATSEP (Radar) Technician Course 1. Course Title ATSEP (Radar) Technician Course 2. Scope: This course is designed for CNS Maintenance Technicians/Staff who will be deployed for operation & maintenance duties of Radar Surveillance Systems at locations. 3. Objectives After successful completion of this course the"}
{"chunks_id": "chunk_100", "text": "Surveillance Systems at locations. 3. Objectives After successful completion of this course the trainees will develop: b) Understanding of basic concepts, fundamentals, underlying theory and working principle of Radar Systems. c) Understanding of various types of Surveillance technologies, their comparison, system limitations and solutions. d) Comprehensive knowledge of different aspects of Primary Radar, Secondary Radar, ADS-B, SMR and MLAT systems. e) Skills to perform preventive maintenance,"}
{"chunks_id": "chunk_101", "text": "Radar, Secondary Radar, ADS-B, SMR and MLAT systems. e) Skills to perform preventive maintenance, first-level troubleshooting and take remedial actions for common faults in systems. 4. Duration 07 Weeks 5. Entry Qualification Must have completed Basic ATSEP Course for CNS Technicians/Staff or equivalent such asBasic ARM Course 6.Numbers of participants Minimum = 06 Maximum = 16 7.Subjects/Modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 M-00 Introduction & Orientation Module 1"}
{"chunks_id": "chunk_102", "text": "DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 M-00 Introduction & Orientation Module 1 M-01 RADAR Theory Module 2 M-02 ELDIS PSR Module 3 M-03 ELDIS MSSR Module 4 M-04 INDRA PSR Module 5 M-05 INDRA MSSR Module 6 M-06 INDRA PSR / MSSR Study Tour JIAP Karachi Module 7 M-07 ADS-B, SMR and MLAT 23. ATSEP (Radio Communication) TechnicianCourse 1. Course Title ATSEP (Radio Communication) Technician Course 2. Scope: This course is designed for CNS Maintenance Technicians/Staff who will be deployed"}
{"chunks_id": "chunk_103", "text": "Course 2. Scope: This course is designed for CNS Maintenance Technicians/Staff who will be deployed for operation & maintenance duties of Radio Communication Systems and its allied facilities at locations. 3. Objectives After successful completion of this course, the trainees will develop the: a) Understanding of basic concepts, fundamentals, underlying theory and working principle of radio communication in HF, VHF and EVHF domain. b) Understanding of various types of radio systems,"}
{"chunks_id": "chunk_104", "text": "radio communication in HF, VHF and EVHF domain. b) Understanding of various types of radio systems, technologies, their comparison, system limitations and solutions c) Comprehensive knowledge of different aspects of radio frequency communication systems, ATIS and recorders. d) Skills to perform preventive maintenance, first-level troubleshooting and take remedial actions for common faults in systems. 4. Duration 06 Weeks 5. Entry Qualification Must have completed Basic ATSEP Course for CNS"}
{"chunks_id": "chunk_105", "text": "systems. 4. Duration 06 Weeks 5. Entry Qualification Must have completed Basic ATSEP Course for CNS Technicians/Staff or equivalent such as: Basic ARM Course 6 Numbers of participants Minimum = 06 Maximum = 16 7.Subjects/modules/Events DISTRIBUTIONS REF MODULE/SUBJECT/EVENTS Module 0 Introduction & Orientation, Ethics, Discipline & Workplace safety Measures. Module 1 Basic Concepts Module 2 HF/VHF/UHF Radio Communication System Module 3 EVHF, Recording Equipment and ATIS Module 4 Practical /"}
{"chunks_id": "chunk_106", "text": "Radio Communication System Module 3 EVHF, Recording Equipment and ATIS Module 4 Practical / Equipment Orientation / Familiarization Visit 24. BASICATSEPENGINEERSCOURSE (UNDER REVISION/DEVELOPMENT) OBJECTIVE The provide the CNS Engineers with sufficient knowledge and skills to guide and supervisequalifiedTechniciansininstallation,operationandmaintenanceo"}
{"chunks_id": "chunk_107", "text": "faeronauticalelectronicsequipmentinaccordancewithATSEPtrainingma"}
{"chunks_id": "chunk_108", "text": "nual. SCOPE This course is designed as ab-initio course for ATSEP Engineers who will be deployed as CNSMaintenance Engineer. NOOFPARTICIPANTS(MIN-MAX):08-16 ELIGIBILITY Asper PCAACNSEngineeringInduction/promotionpolicy COURSEDURATION08WEEKS MODULES • IntroductionandOrientation • CivilAviation&itsStandards(International(ICAO) &National) • AirTrafficSystem • CNS/ATM • OfficeOrganization&Management • CNS/ATMModuleContainsRadioNavigationalAid ATS COURSES 1. Course Title BASIC ATC COURSE (ICAO - 052"}
{"chunks_id": "chunk_109", "text": "CNS/ATMModuleContainsRadioNavigationalAid ATS COURSES 1. Course Title BASIC ATC COURSE (ICAO - 052 / 053 / 055) 2. Scope This is a consolidated course that covers the scope of Basic ATC training. Basic ATC Course is comprised of Aerodrome Control Training (052), Approach Control (Procedural) training (053) and Area Control (Procedural) Training (055) in one course. The course contents include both theory and simulator based practical in such a way that the objectives of the course are achieved."}
{"chunks_id": "chunk_110", "text": "theory and simulator based practical in such a way that the objectives of the course are achieved. 3. Objectives This course provides knowledge, skills and techniques required to equip the Air Traffic Controllers in accordance with ICAO standards and recommended practices and to prepare them to provide following services after successful completion of format OJT.  Aerodrome Control Service  Area Control Service (Procedural)  Approach Control Service (Procedural)  Flight Information Service"}
{"chunks_id": "chunk_111", "text": "Control Service (Procedural)  Approach Control Service (Procedural)  Flight Information Service  Alerting Service 4. Duration 40 Weeks 5. Entry Qualification (For PCAA Inductees)  B.S. in (Physics/ Mathematics/ Computer Science/ Aviation Management) from HEC Recognized University with at least 2nd Division or equivalent CGPA (Minimum 16 years of Education is Mandatory) Or  Bachelors in Engineering from HEC recognized University with at least 2nd Division or equivalent CGPA (For Others) "}
{"chunks_id": "chunk_112", "text": "from HEC recognized University with at least 2nd Division or equivalent CGPA (For Others)  Bachelor’s Degree with F.Sc. or A-Levels (Physics and Mathematics as major Subjects) or  Commercial Pilot License or Flight Operations Officer License holder with F.Sc. or A-Levels (Physics and Mathematics as major Subjects)  Good reading, writing, listening and speaking skills in English Language 6. Number of participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref U1.M-0 U1.M-1"}
{"chunks_id": "chunk_113", "text": "Number of participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref U1.M-0 U1.M-1 U1.M-2 U2.M-1 U2.M-2 U2.M-3 U2.M-4 U2.M-5 U2.M-6 U2.M-7 U2.M-8 U2.M-9 U2.M-10 U2.M-11 U2.M-12 U2.M-13 U2.M-14 U2.M-15 U3M-1 U3M-2 U4.M-1 U4.M-2 U4.M-3 U5.M-1 U5.M-2 U5.M-3 U5.M-4 U6.M-1 U6.M-2 U6.M-3 U6.M-4 Modules / Subjects / Events UNIT-01 INTRODUCTION - Joining Formalities / Registration TMMS - Welcome Address by Chief of School - Introduction of Instructors and Participants - Course"}
{"chunks_id": "chunk_114", "text": "TMMS - Welcome Address by Chief of School - Introduction of Instructors and Participants - Course Introduction - Scope and Objectives - Main Subjects / Modules and training activities - Time distribution / Course Duration - Test and Examination (Methods/Techniques/Model Test Paper - Training Rules (Attendance, Leave, Conduct, etc) - General briefing on discipline and behaviour, handling of equipment and - tools, etc - Individual trainees course report - Visit of CATI Campus and Hyderabad"}
{"chunks_id": "chunk_115", "text": "equipment and - tools, etc - Individual trainees course report - Visit of CATI Campus and Hyderabad Airport History of Aviation / ICAO Introduction of Pakistan Civil Aviation Authority UNIT-02 GENERAL Air Law Communication Procedures Air Traffic Services Aerodromes Radio Telephony Navigation Aids / Air Traffic Control equipment Theory of Flight / General Aircraft Knowledge Flight Navigation Aviation Meteorology and Altimetry Search and Rescue Global Reporting Format (GRF) Aeronautical"}
{"chunks_id": "chunk_116", "text": "Aviation Meteorology and Altimetry Search and Rescue Global Reporting Format (GRF) Aeronautical Information Management / Aeronautical Charts Emergency Procedure / Safety Practices associated with flight Human Factor & Threat and Error Management Performance Based Navigation (PBN) UNIT-03 AERODROME CONTROL Aerodrome Control Service Aerodrome Control Simulator Training UNIT-4 AREA CONTROL Area Control Service ATS Geography Area Control Simulator Training UNIT-05 APPROACH CONTROL Approach Control"}
{"chunks_id": "chunk_117", "text": "Service ATS Geography Area Control Simulator Training UNIT-05 APPROACH CONTROL Approach Control Service Holding and Approach to Land Procedures RNP Approaches Approach Control Simulator Training UNIT-06 EXTRA CURRICULUM ACTIVITIES Ethics in ATC Personality Grooming / Presentation Guest Speakers Additional Subject - CNS/ATM (Radar & ADS-B) - TCAS - SMS 04-01-2024 1. Course Title"}
{"chunks_id": "chunk_118", "text": "AERODROME / AREA CONTROL (PROCEDURAL) COURSE (ICAO – 052, 055)"}
{"chunks_id": "chunk_119", "text": "2. Scope: This course consists of two courses in the field of Air Traffic Control namely; ATC Licensing and Aerodrome Control Training (052), Area Control (Procedural) Training (055). It is designed to provide training for both new recruits and unqualified ATC personnel to licensing standard and to provide the trainee with a foundation in both theory and simulator training in Aerodrome and Area Control (Procedural). 3. Objectives This course provides knowledge, skills and techniques required to"}
{"chunks_id": "chunk_120", "text": "(Procedural). 3. Objectives This course provides knowledge, skills and techniques required to equip the air traffic controllers in accordance with ICAO standards and recommended practices and to prepare them to take up duties in various air traffic services units after successful completion of formal on the job training (OJT). 4. Duration 28 Weeks 5. Entry Qualification  (For PCAA Inductees) B.S. in (Physics / Mathematics / Computer Science / Aviation Management)"}
{"chunks_id": "chunk_121", "text": "from HEC Recognized University with at least 2nd Division Or equivalent CGPA (Minimum 16 years of Education is Mandatory) Or Bachelors in Engineering from HEC Recognized University with at least 2nd Division or equivalent CGPA  (For Others) Bachelor’s Degree with F.Sc. Or A-Levels (Physics and Mathematics as major subjects) Or Commercial Pilot License (CPL) Or Flight Operations Officer (FOO) License holder with F.Sc. Or A-Levels (Physics and Mathematics as major subjects) Excellent reading,"}
{"chunks_id": "chunk_122", "text": "holder with F.Sc. Or A-Levels (Physics and Mathematics as major subjects) Excellent reading, writing, listening and speaking skills In English language. 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref M-01 M-02 M-03 M-04 M-05 M-06 M-07 M-08 M-09 M-10 M-11 M-12 M-13 M-14 M-15 - M-16 M-17 M-18 M-19 - - Modules / Subjects / Events Civil Aviation History & ICAO Air Law and Flight plan Air Traffic Services Communication Procedures Flight Navigation Aviation Met"}
{"chunks_id": "chunk_123", "text": "Law and Flight plan Air Traffic Services Communication Procedures Flight Navigation Aviation Met & Altimetry Aerodromes Aerodrome Control Service RT Phraseology / English Language Proficiency Search and Rescue Theory of Flight Aeronautical Information Management Global Reporting Format Human Factor in ATC & Threat and Error management Aerodrome Control Simulator Training Emergency Procedure ATS Geography Radio Navigation Aids Area Control Service Area Control Simulator Training Emergency"}
{"chunks_id": "chunk_124", "text": "ATS Geography Radio Navigation Aids Area Control Service Area Control Simulator Training Emergency Procedure Additional Topics  Ethics in ATC  Stress Management  TCAS  PBN  SQMS 1. Course Title AERODROME CONTROL COURSE (ICAO – 052)"}
{"chunks_id": "chunk_125", "text": "2. Scope: This Course is the First of Five Specialized Courses in the field of Air Traffic Control. It is design to provide training for both new recruits and unqualified ATC Personnel to Licensing Standards and Aerodrome Control. 3. Objectives This Course provides knowledge, skills and techniques required to equip the Air Traffic Controllers in accordance with ICAO Standards and Recommended Practices and to prepare them to take up duties at Aerodrome Control Tower after successful completion"}
{"chunks_id": "chunk_126", "text": "and to prepare them to take up duties at Aerodrome Control Tower after successful completion of formal On The Job Training (OJT). 4. Duration 14 Weeks 5. Entry Qualification  (For PCAA Inductees) B.S. in (Physics / Mathematics / Computer Science / Aviation Management) from HEC Recognized University with at least 2nd Division or equivalent CGPA (Minimum 16 years of Education is Mandatory) Or Bachelors in Engineering from HEC Recognized University with at least 2nd Division or equivalent CGP Or"}
{"chunks_id": "chunk_127", "text": "in Engineering from HEC Recognized University with at least 2nd Division or equivalent CGP Or Promoted ATC Staff with minimum of FSc qualification  (For Others) Bachelor’s Degree with FSc. or A-Levels (Physics and Mathematics as major subjects) Or Commercial Pilot License (CPL) Or Flight Operations Officer (FOO) License holder with FSc. or A-Levels (Physics and Mathematics as major Subjects) Excellent reading, writing, listening and speaking skills in English language 6. Number of Participants"}
{"chunks_id": "chunk_128", "text": "reading, writing, listening and speaking skills in English language 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref M-01 M-02 M-03 M-04 M-05 M-06 M-07 M-08 M-09 M-10 M-11 M-12 M-13 M-14 M-15 - - - - - - - Modules / Subjects / Events CA History & ICAO Air Law & Flight Plan Air Traffic Services (ATS) Communication Procedures Flight Navigation Meteorology Aerodromes Aerodrome Control Service RT Phraseology / ELP Search and Rescue Theory of Flight Aeronautical"}
{"chunks_id": "chunk_129", "text": "Aerodrome Control Service RT Phraseology / ELP Search and Rescue Theory of Flight Aeronautical Information Management (AIM) Global Reporting Format (GRF) Human Factor in ATC & Threat and Error Management (TEM) Practical (Aerodrome Control Simulator training) Emergency Procedure Additional Topics Ethics in ATC Stress Management, TCAS PBN SQMS 1. Course Title"}
{"chunks_id": "chunk_130", "text": "APPROACH CONTROL (PROCEDURAL) COURSE (ICAO - 053) 2. Scope: This course will enable Air Traffic Controllers to handle Air Traffic in Approach Control (Procedural) environment after a formal on the job (OJT) training. 3. Objectives To provide Air Traffic Controllers with adequate knowledge and skills required to handle Air Traffic in Approach Control (Procedural) environment in an International Standard. 4. Duration 08 Weeks 5. Entry Qualification Qualified air Traffic Controllers who have"}
{"chunks_id": "chunk_131", "text": "Standard. 4. Duration 08 Weeks 5. Entry Qualification Qualified air Traffic Controllers who have successfully completed the Course of Aerodrome / Area Control (Procedural). Proficiency in written and spoken English Level - IV 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref Modules / Subjects / Events M-00 Registration / Introduction M-01 Approach (Procedural) Control M-02 Holding and Approach to Land Procedures M-03 Approach (Procedural) Control"}
{"chunks_id": "chunk_132", "text": "Control M-02 Holding and Approach to Land Procedures M-03 Approach (Procedural) Control Practical’s - Emergency Procedures M-04 Human Factors & Threat and Error Management M-05 Performance Based Navigation (PBN) RNP Approaches - Additional Subjects 1. Course Title AREA CONTROL (PROCEDURAL) COURSE (ICAO - 055) 2. Scope: It is designed to provide training for both new recruits and unqualified ATC personnel with a good grounding in both theory and Simulator Training in Area Control Procedural. 3."}
{"chunks_id": "chunk_133", "text": "with a good grounding in both theory and Simulator Training in Area Control Procedural. 3. Objectives This course provides knowledge, skills and techniques required to equip the air traffic controllers in accordance with ICAO standards and recommended practices and to prepare them to take up duties in various air traffic services units after successful completion of formal on the job training (OJT). 4. Duration 08 Weeks 5. Entry Qualification  B.S. in (Physics / Mathematics / Computer Science"}
{"chunks_id": "chunk_134", "text": "4. Duration 08 Weeks 5. Entry Qualification  B.S. in (Physics / Mathematics / Computer Science / Aviation Management) from HEC recognized university with at least 2nd Division/equivalent CGPA or  Bachelors in Engineering from HEC recognized university with at least 2nd Division / equivalent CGPA or  Promoted ATC Staff with minimum of F.Sc. qualification or  14 years of education for IJP Officers or  Any qualification approved by HQCAA 6. Number of Participants Minimum : 06 Maximum : 16 7."}
{"chunks_id": "chunk_135", "text": "or  Any qualification approved by HQCAA 6. Number of Participants Minimum : 06 Maximum : 16 7. Subject /Modules/ Events Ref Modules / Subjects / Events M-00 Introduction and Orientation M-01 CA History / ICAO M-02 Air Law M-03 Air Traffic Services M-04 Communication Procedures M-05 Flight Navigation M-06 Aviation Met & Altimetry M-07 RT / ELP M-08 Area Control Service M-09 ATS Geography M-10 Human Factors in ATC & Threat and Error Management (TEM) M-11 Area Control Procedurals (Simulation"}
{"chunks_id": "chunk_136", "text": "Human Factors in ATC & Threat and Error Management (TEM) M-11 Area Control Procedurals (Simulation Training) M-12 Emergency Procedure - Additional Subjects 1. Course Title"}
{"chunks_id": "chunk_137", "text": "APPROACH CONTROL SURVEILLANCE COURSE (ICAO - 054) 2. Scope: The course consists of formal class work sessions augmented by practice on a Surveillance/Radar Simulator. This course builds on the skills obtained in a course such as Basic ATC Course by providing the trainee with theory and simulator training in Surveillance Approach Operation. 3. Objectives This course provides knowledge, skills and techniques required to equip the Air Traffic Control Officers in accordance with ICAO standards and"}
{"chunks_id": "chunk_138", "text": "techniques required to equip the Air Traffic Control Officers in accordance with ICAO standards and recommended practice and to prepare them to take-up duties in Surveillance Approach Control. 4. Duration 05 Weeks 5. Entry Qualification  Basic ATC Course or Aerodrome & Area Control (Procedural) Course  Approach Control (Procedural) Course  Area Control Surveillance Course  Fluent in oral and written English (ICAO English Language Proficiency (ELP) Level-"}
{"chunks_id": "chunk_139", "text": "4) 6. Number of Participants Minimum: 06 Maximum: 12 7. Subjects / Modules / Events Ref Modules / Subjects / Events M-00 Introduction and Orientation M-01 Surveillance Operation M-02 Surveillance Technical M-03 Practical’s Simulation Exercise (General / Approach Control Surveillance) Emergency Procedures M-04 Human Performance & Principles Threat and Error Management - Additional Subjects  Stress Management  ATC Ethics  TCAS  PBN  SQMS / SMS 1. Course Title"}
{"chunks_id": "chunk_140", "text": "AREA CONTROL SURVEILLANCE COURSE (ICAO - 054)"}
{"chunks_id": "chunk_141", "text": "2. Scope: This course builds on the skills obtained in a course such as Basic ATC Course or Aerodrome / Area Control (Procedural) by providing the student with theory and simulator training in Surveillance. 3. Objectives This course provides knowledge, skills and techniques required to equip the air traffic control officers in accordance with ICAO standards and recommended practice and to prepare them to take-up duties in surveillance controlled environment of air traffic services, after OJT."}
{"chunks_id": "chunk_142", "text": "them to take-up duties in surveillance controlled environment of air traffic services, after OJT. 4. Duration 08 Weeks 5. Entry Qualification Basic ATC Course qualified, Aerodrome or Area Control (Procedural) rated. ICAO English Language Proficiency (ELP) Level – IV 6. Number of Participants Minimum : 06 Maximum : 12 5. Subjects / Modules / Events Ref Modules / Subjects / Events M-00 Introduction and Orientation M-01 Surveillance Operation M-02 Surveillance Technical M-03 Practical’s Simulation"}
{"chunks_id": "chunk_143", "text": "and Orientation M-01 Surveillance Operation M-02 Surveillance Technical M-03 Practical’s Simulation Exercise (General / Area Control Surveillance) - Emergency Procedures M-04 Human Performance & Principles Threat and Error Management - Additional Subjects  Stress Management  ATC Ethics  TCAS  PBN  SQMS / SMS 1. Course Title ATC ASSISTANT COURSE 2. Scope: This course consists formal classroom sessions augmented by practical encompassing field of Air Traffic Services and prepares the Flight"}
{"chunks_id": "chunk_144", "text": "sessions augmented by practical encompassing field of Air Traffic Services and prepares the Flight Data Assistant to take over the role and responsibilities to Assist Air Traffic Controllers at major and feeder service Airport. 3. Objectives This course will provides the student will essential elementary knowledge, standardized skills and techniques required for performance in relevant field of Air Traffic Service 4. Duration 12 Weeks 5. Entry Qualification  Intermediate or as specified by"}
{"chunks_id": "chunk_145", "text": "Air Traffic Service 4. Duration 12 Weeks 5. Entry Qualification  Intermediate or as specified by HQCAA 6. Number of Participants Minimum : 12 Maximum : 24 7. Subjects / Modules / Events M-01&02 M-03 M-04 M-05 M-06 M-07 M-08 M-09 M-13 M-14 M-15 M-16 M-17 M-18 -- ICAO & Air Law Air Traffic Service Communication Procedures Flight Navigation Aviation Met & Altimetry Aerodromes Aerodrome Control Service Radio Telephony / ELP ATS Geography Aeronautical Information Service Theory of Flight Search &"}
{"chunks_id": "chunk_146", "text": "Radio Telephony / ELP ATS Geography Aeronautical Information Service Theory of Flight Search & Rescue Radio Aids to Navigation Practical’s (Aerodrome Control Simulator Training) Closing Ceremony 1. Course Title"}
{"chunks_id": "chunk_147", "text": "ATC ASSISTANT (REFRESHER) COURSE"}
{"chunks_id": "chunk_148", "text": "2. Scope: This course will review, reinforce, refresh and enhance the existing knowledge and skills of ATC Assistants to provide a safe, orderly and expeditious flow of air traffic. 3. Objectives This course is designed to ensure that already competent Air Traffic Controller’s Assistant not only maintain their competence, but also enhance their performance in a wide variety of situations. Furthermore, as the ATM world enters an era of rapidly changing technology, procedures, New ATM Systems and"}
{"chunks_id": "chunk_149", "text": "as the ATM world enters an era of rapidly changing technology, procedures, New ATM Systems and new Aircraft with new functionalities, refresher training can be one of the important ways in which Air traffic controller’s are given the opportunity to review their performance in light of such changes. 4. Duration"}
{"chunks_id": "chunk_150", "text": "02 Weeks 5. Entry Qualification\nAs specified by HQCAA. 6. Number of Participants\n Minimum : 12 \nMaximum : 16 7. Subjects / Modules / Events Modules / Subjects / Events  Introduction  Aerodromes  Aerodrome Control Service  Aeronautical Information Service  ATS Geography  Air Law  Meteorology  ATS Messages & Flight Plan  Radio Aids to Navigation 1. Course Title"}
{"chunks_id": "chunk_151", "text": "BASIC SEARCH & RESCUE COURSE 2. Scope: Search & Rescue Course is aimed for the stakeholders of SAR who have the responsibility to plan and prepare for Search & Rescue Operation in the Aviation environment. The course includes over view of national SAR system, the role of the SAR Manager, SAR resources, developing a SAR plan, planning data / searching data, planning, investigation, interviewing, search urgency, search probabilities, search area, search theory and many others. 3. Objectives"}
{"chunks_id": "chunk_152", "text": "search urgency, search probabilities, search area, search theory and many others. 3. Objectives Provide a Regional mechanism for coordinating SAR services to meet National and Regional needs and International commitments. 4. Duration 01 Week (06 Days) 5. Entry Qualification Official with relevant experience 6. Number of Participants Minimum -10 Maximum -30 7. Subjects / Modules / Events Ref Modules / Subjects / Events M-1 Definition M-2 Organization M-3 Cooperation M-4 Preparatory Measures M-5"}
{"chunks_id": "chunk_153", "text": "/ Subjects / Events M-1 Definition M-2 Organization M-3 Cooperation M-4 Preparatory Measures M-5 Operating Procedures M-6 Alerting Services M-7 Role Of Major Stakeholders And SAR In Global Perspective 1. Course Title"}
{"chunks_id": "chunk_154", "text": "English Language Proficiency – ELP (Advanced Level) for ATCOs Course\n2. Scope: This Course has been designed to enhance the English Language Proficiency of participants in line with guidelines provided by ICAO and industry best practices. The Course is primarily aimed at aviation professionals e.g. ATCOs, Pilots etc. and will comprise of interactive exercises / activities based on aviation relevant content targeting the THREE key areas of LISTENING, SPEAKING and WRITING. 3. Objectives"}
{"chunks_id": "chunk_155", "text": "Upon completion of the course, the participants will be able to improve their aural English skill for a more effective communication. 4. Duration"}
{"chunks_id": "chunk_156", "text": "02 Weeks 5. Entry Qualification  ATCOs and Pilots (Commercial & General Aviation) with at least ELP Level-5.  Military Aviators and Controllers aspiring to improve English proficiency  Flying School students Note: It is expected that participants possess prior knowledge of Radio Telephony procedures and the Aviation Alphabets / Numbers. 6. Number of Participants Minimum : 08 Maximum : 16 Note: Even number of participants are preferable to facilitate group activities; however, odd number of"}
{"chunks_id": "chunk_157", "text": "Even number of participants are preferable to facilitate group activities; however, odd number of participants may also be accepted. 6. Subjects / Modules / Events Ref. Modules / Subjects / Events M-0 Registration & Introduction M-1 Aviation Communication M-2 Refreshing R/T Phraseology & Speech Techniques M-3 Grammar& Vocabulary M-4 Pronunciation M-5 Speaking M-6 Listening M-7 Writing 1. Course Title"}
{"chunks_id": "chunk_158", "text": "FLIGHT PROCEDURE DESIGN (CONVENTIONAL) COURSE\n2. Scope\nFlight Procedure Design(conventional) course is crafted to enable participants understand basics of procedure design as well as to meet requirement for advance Flight Procedure Design (PBN) course. 3. Objectives\nTo provide knowledge and develop skills for designing conventional Instrument Flight Procedures utilizing PANS-OPS criterion, after OJT under supervision of a qualified designer. 4. Duration\n04 Weeks 5. Entry Qualification"}
{"chunks_id": "chunk_159", "text": "04 Weeks 5. Entry Qualification\nATCL / CPL / FOO License holder with 3 years post license experience. 6. Number of Participants"}
{"chunks_id": "chunk_160", "text": "Minimum : 06 Maximum : 08 7. Subjects / Modules / Events Modules / Subjects / Events Module – 1 General IFP Overview & Concepts Module - 2 Non-Precision Approaches Module -3 Holding Procedure Module -4 Precision Approaches Module -5 Departure Criteria Module - 6 Quality Assurance Ref. Doc 8168 PANS OPS Doc 8168 PANS OPS Doc 8168 PANS OPS Doc 8168 PANS OPS Doc 8168 PANS OPS Doc 9906 QA Manual for FPD 1. Course Title\nFLIGHT PROCEDURE DESIGN (PBN) COURSE\n2. Scope:"}
{"chunks_id": "chunk_161", "text": "FLIGHT PROCEDURE DESIGN (PBN) COURSE\n2. Scope:\nFlight Procedure Design (PBN) course is crafted to enable participants to understand & Design PBN based Flight Procedures. 3. Objectives\nAt the end of course, the trainee should be able to design PBN instrument flight procedures by applying the PANS-OPS criteria, after OJT under supervision of a qualified designer. 4. Duration\n03 Weeks 5. Entry Qualification"}
{"chunks_id": "chunk_162", "text": "03 Weeks 5. Entry Qualification\nQualified Flight Procedure Design ( conventional ) course 6. Number of Participants Minimum : 06 Maximum : 08 7. Subjects / Modules / Events"}
{"chunks_id": "chunk_163", "text": "Modules / Subjects / Events Module-1 PBN Concepts & Underlying principles Module -2 Arrival and Approach including holding Module -3 APV Baro-VNAV Module -4 Departure Criteria Module -5 Database Coding / publication Module -6 Quality assurance Ref. Doc. 9613 AN/937 Performance – based Navigation (PBN) Manual Doc 8168 PANS-OPS Volume –II Construction of Visual and Instrument Flight Procedures Doc 9906 Volume 1 QA Manual for Flight Procedure Design 1. Course Title ATC REFRESHER (ABRIDGED) FOR"}
{"chunks_id": "chunk_164", "text": "9906 Volume 1 QA Manual for Flight Procedure Design 1. Course Title ATC REFRESHER (ABRIDGED) FOR OFFICER COURSE"}
{"chunks_id": "chunk_165", "text": "2. Scope: This course is designed to enhance and reinforce the already acquired knowledge of Air traffic controller during their basic level courses and actual job knowledge and skills obtained. It focuses the training on the competencies needed to perform their duties safely and efficiently. It is designed to meet regulatory requirements specified in Para D9.1.1 of ANO-014-LCXX-3.0 3. Objectives Main objective of the course is to reinforce, enhance and prevent the erosion of the controller’s"}
{"chunks_id": "chunk_166", "text": "Main objective of the course is to reinforce, enhance and prevent the erosion of the controller’s knowledge, skills and to ensure continuous competence of Air traffic controller. The objective of the course is not only to focus areas of routine Air traffic control job but also to cover those areas which are not commonly in use and most of the time remain dormant. Accordingly following areas are covered in this course: 1. Standard Practices and Procedures not only cover the routine Standards and"}
{"chunks_id": "chunk_167", "text": "in this course: 1. Standard Practices and Procedures not only cover the routine Standards and Practices but also focus on the standards and practices that are rarely used e.g. seasonal procedure. 2. Abnormal and Emergency situations (ABES) is designed to explore Air traffic controllers with circumstances and situations which they do not face in routine operation or do not commonly experience. 3. Human Factor in the provision of Air Traffic Services covers the management of stress, boredom,"}
{"chunks_id": "chunk_168", "text": "3. Human Factor in the provision of Air Traffic Services covers the management of stress, boredom, fatigue, confidence, complacency and other relevant topics. 4. Threat and Error Management covers counter measures and management of undesired state i-e any operational condition where an unintended and traffic situation results in a reduction in margins of safety. After completing this course trainee will be equipped with polished knowledge / skill of standard and practices in ATC as well as have"}
{"chunks_id": "chunk_169", "text": "will be equipped with polished knowledge / skill of standard and practices in ATC as well as have refreshed the knowledge of ABES while managing Threat and Error Management in the job. 4. Duration 1 Week (5 Days) 5. Entry Qualification Air Traffic Controller 6. Number of Participants  Minimum : 06  Maximum : 16 7. Subjects / Modules / Events Ref: Modules / Subjects / Events M-00 Joining Formalities M-01 Air Law M-02 Air Traffic Services M-03 Flight Navigation M-04 Theory of Flight M-05"}
{"chunks_id": "chunk_170", "text": "M-01 Air Law M-02 Air Traffic Services M-03 Flight Navigation M-04 Theory of Flight M-05 Meteorology M-06 Abnormal & Emergency Situation 1. Course Title GLOBAL REPORTING FORMAT (GRF) COURSE 2. Scope:"}
{"chunks_id": "chunk_171", "text": "Conventional short duration Job Center Training (JCT) Course on ICAO New Global Reporting Format for Runway Surface Condition Assessment and reporting. 3. Objective\nTrainee on completion of course will demonstrate knowledge and skills on procedures, methods and techniques used to assess and report Runway surface conditions in compliance to the ICAO Global Reporting Format applicable as of 4th November, 2021. 4. Duration\n05 Days"}
{"chunks_id": "chunk_172", "text": "05 Days\n5. Entry Qualification  Fair understanding of ATC Phraseology and fluent in English. 6. Number of Participants"}
{"chunks_id": "chunk_173", "text": " Maximum : 16  Minimum : 06 7. Subjects/ Modules /Events Modules / Subjects  M-00 Joining Formalities / Registration etc.  M-01 Definition, Introduction & background / ICAO History  M-02 New Reporting Format Runway Condition Code (RWYCC) & Runway Condition Assessment Matrix (RCAM)  M-03 Runway Condition Report (RCR)  Aeroplane Performance Calculation Section  Situation Awareness Section  M-04 Pilot Report & Dissemination of Information 1. Course Title AIRCRAFT OPERATION AT UNCONTROLLED"}
{"chunks_id": "chunk_174", "text": "M-04 Pilot Report & Dissemination of Information 1. Course Title AIRCRAFT OPERATION AT UNCONTROLLED AERODROME"}
{"chunks_id": "chunk_175", "text": "2. Scope: Aircraft Operation at uncontrolled Aerodrome Course is designed for those Private Organizations maintaining the Aerodromes with very limited Aircraft Operation. To provide awareness and information useful for the safe conduct of Flight. The participants would be able to learn basics of safety and precautionary measures related to Aircraft Operation. 3. Objectives Provide information for the safe conduct of Aircraft Operation at the uncontrolled Aerodrome. 4. Duration 01 Week (05 Days)"}
{"chunks_id": "chunk_176", "text": "the safe conduct of Aircraft Operation at the uncontrolled Aerodrome. 4. Duration 01 Week (05 Days) 5. Entry Qualification Intermediate or as specified by HQCAA 6. Number of Participants Minimum - 06 Maximum - 16 7. Subjects / Modules / Events M-1 Types of Operation & General Rules of the Air M-2 Types of Aircraft M-3 Aerodromes M-4 Communication Procedure & RT Phraseology M-5 Safety of Operation 1. Course Title GLOBAL REPORTING FORMAT (GRF) STAFF COURSE"}
{"chunks_id": "chunk_177", "text": "2. Scope: Conventional short duration Job Center Training (JCT) Course on ICAO New Global Reporting Format for Runway Surface Condition Assessment and reporting. 3. Objective Trainee on completion of course will demonstrate knowledge and skills on procedures, methods and techniques used to assess and report runway surface conditions in compliance to the ICAO Global Reporting Format applicable as of 4th November, 2021. 4. Duration 02 Days 5. Entry Qualification  Fluent in English. 6. Number of"}
{"chunks_id": "chunk_178", "text": "of 4th November, 2021. 4. Duration 02 Days 5. Entry Qualification  Fluent in English. 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects/ Modules /Events Ref. Modules / Subjects / Events M-00 Joining Formalities / TMMS Registration etc. M-01 Definition, Introduction, Runway Surface Conditions Methodology M-02 Downgrade upgrade Criterion;  Runway Condition Report (RCR),  Aeroplane Performance Calculation M-03 Dissemination of Information;  SNOWTAM Format  Method of Filling"}
{"chunks_id": "chunk_179", "text": "Performance Calculation M-03 Dissemination of Information;  SNOWTAM Format  Method of Filling SNOWTAM M-04 Exercise (Simulation) 1. Course Title"}
{"chunks_id": "chunk_180", "text": "NEW GLOBAL REPORTING FORMAT FOR OFFICERS COURSE"}
{"chunks_id": "chunk_181", "text": "2. Scope: Conventional short Course on ICAO New Global Reporting Format for Runway Surface Condition Assessment and Reporting 3. Objective The participants will demonstrate knowledge and skills on procedures, methods and techniques used to assess and report Runway Surface Conditions in compliance to the ICAO Global Reporting Format (GRF) 4. Duration 03 Days 5. Entry Qualification Fluent in English 6. Number of Participants Minimum : 06 Maximum : 24 7. Subjects / Modules / Events Ref. Modules /"}
{"chunks_id": "chunk_182", "text": "6. Number of Participants Minimum : 06 Maximum : 24 7. Subjects / Modules / Events Ref. Modules / Subjects / Events M-00 Joining Formalities / Registration (TMMS) M-01 Definition, Introduction, Runway Surface Conditions M-02 Runway Condition Code, Downgrade & Upgrade Criterion M-03 Aeroplane Performance Calculation, Situational Awareness M-04 Method of Filling Runway Condition Report (RCR) M-05 Method of Filling SNOWTAM M-06 Activity (Practical and RCR Filling 1. Course Title ENGLISH LANGUAGE"}
{"chunks_id": "chunk_183", "text": "Method of Filling SNOWTAM M-06 Activity (Practical and RCR Filling 1. Course Title ENGLISH LANGUAGE PROFICIENCY (EXTENDED LEVEL) COURSE"}
{"chunks_id": "chunk_184", "text": "2. Scope: This Course has been designed to enhance the English Language Proficiency (ELP) of participants in line with guidelines provided by ICAO and industry best practices. The Course is primarily aimed at aviation professionals e.g. ATCOs, Pilots etc. and will comprise of interactive exercises / activities based on aviation relevant content targeting the FOUR key areas of LISTENING, SPEAKING, WRITING and READING. 3. Objectives Upon completion of the course, the participants will be able to"}
{"chunks_id": "chunk_185", "text": "WRITING and READING. 3. Objectives Upon completion of the course, the participants will be able to improve their English skills for effective communication. 4. Duration 04 Weeks 5. Entry Qualification  ATCOs and Pilots (Commercial & General Aviation) with ELP Level-4 or below  Military Aviators and Controllers aspiring to improve English Proficiency  Flying School Students Note: It is expected that participants possess prior knowledge of Radio Telephony procedures and the Aviation Alphabets"}
{"chunks_id": "chunk_186", "text": "that participants possess prior knowledge of Radio Telephony procedures and the Aviation Alphabets / Numbers. 6. Number of Participants Minimum : 08 Maximum : 16 Note: Even number of participants are preferable to facilitate group activities; however, odd number of participants may also be accepted. 7. Subjects / Modules / Events Ref. Modules / Subjects / Events Unit-1 / M-1 Registration & Introduction Unit-1 / M-2 Aviation Communication Unit-2 / M-1 Refreshing R/T Phraseology & Speech"}
{"chunks_id": "chunk_187", "text": "& Introduction Unit-1 / M-2 Aviation Communication Unit-2 / M-1 Refreshing R/T Phraseology & Speech Techniques Unit-3 / M-1 Grammar & Vocabulary Unit-3 / M-2 Pronunciation Unit-4 / M-1 Speaking Unit-4 / M-2 Listening Unit-4 / M-3 Writing Unit-5 / M-1 Reading 1. Course Title AERODROME SAFEGUARDING & OBSTACLE LIMITATION SURFACES (OLS) COURSE 2. Scope: This course is designed for capacity building of the participants from Pakistan Civil Aviation Authority (PCAA) and different organizations like"}
{"chunks_id": "chunk_188", "text": "of the participants from Pakistan Civil Aviation Authority (PCAA) and different organizations like Building Control Authorities (BCA) Frequency Allocation Board (FAB) Pakistan Telecommunication Authority (PTA) Pakistan Air Force (PAF) and other relevant Departments. 3. Objective Upon completion of course participants will be able to:  Understand and identify Obstacle Limitation Surfaces for an Aerodrome  Protect the Aerodrome surroundings.  Regulate local zoning laws and ordinances"}
{"chunks_id": "chunk_189", "text": "for an Aerodrome  Protect the Aerodrome surroundings.  Regulate local zoning laws and ordinances effectively to ensure safety to the Aircraft Operation, its occupants and property. 4. Duration 1 Week (5 days) 5. Entry Qualification  Participant should be officer of grade 17 and above or equivalent grade from Public and Private Sector Organizations  Officer nominated by (PAF) Air Headquarter  Official with relevant experience nominated by (PCAA) Headquarter 6. Number of Participants Minimum"}
{"chunks_id": "chunk_190", "text": "Official with relevant experience nominated by (PCAA) Headquarter 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref. Modules / Subjects / Events M-00 Joining Formalities / Registration (TMMS) M-01 Definitions and Aerodrome Reference Code M-02 Obstacle Limitation Surfaces M-03 Obstacle Limitation Requirements, Obstacle Lighting and Markings M-04 SRO-11 (Zoning), Safeguarding Assessment (Case Study) -"}
{"chunks_id": "chunk_191", "text": "Guest Speaker from AAR HQCAA and PAF 1. Course Title SAR COORDINATOR COURSE 2. Scope: This course focuses to train individuals for the fulfillment of obligation accepted by the state being a signatory of the convention on International Civil Aviation (ICAO). The course limits to the organization and management of the National and Regional Aeronautical SAR system / Framework. 3. Objective The course is designed to train SAR personnel for the provision of SAR services in Pakistan including the"}
{"chunks_id": "chunk_192", "text": "is designed to train SAR personnel for the provision of SAR services in Pakistan including the establishment/administration of RCCs, RSCs within Search and Rescue Regions (SRRs). 4. Duration 02 Weeks 5. Entry Qualification  Basic ATC  Area / Aerodrome Course  Graduation with aviation / navigation back ground 6. Number of Participants Minimum : 08 Maximum : 24 7. Subjects / Modules / Events Ref Modules / Subjects / Events/ICAO DOC IAMSAR Manual Vol-I M-00 Definitions M-01 Concept of SAR"}
{"chunks_id": "chunk_193", "text": "Ref Modules / Subjects / Events/ICAO DOC IAMSAR Manual Vol-I M-00 Definitions M-01 Concept of SAR system M-02 SAR Components M-03 SAR Training & Development M-04 SAR Communication M-05 SAR System Management M-06 Improvement in SAR Services 1. Course Title MANAGING AERONAUTICAL INFORMATION COURSE 2. Scope: The course is developed to impart the knowledge and let the trainees (from various aviation concerned fields/trades) understand the importance of standardized quality assured aeronautical data"}
{"chunks_id": "chunk_194", "text": "fields/trades) understand the importance of standardized quality assured aeronautical data and information in latest and upcoming avionics and aviation. 3. Objective a. To understand different type of Aeronautical Information, their scope and usage; b. To choose appropriate products for dissemination of Quality assured Aeronautical Information; and c. To understand the importance Aeronautical Data Quality requirements. d. To understand role of data originators in dissemination of quality"}
{"chunks_id": "chunk_195", "text": "Data Quality requirements. d. To understand role of data originators in dissemination of quality assured Aeronautical Information for safe and efficient aircraft operation. e. To understand importance of AIRAC system adherence for promulgation of Aeronautical Information 4. Duration 01 Week 5. Entry Qualification  Basic ATC  Area / Aerodrome control Course  Graduation with aviation back ground 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref"}
{"chunks_id": "chunk_196", "text": "back ground 6. Number of Participants Minimum : 06 Maximum : 16 7. Subjects / Modules / Events Ref Modules/Subjects/Events/ICAO Annex- 4,15, DOC- 8126, DOC- 10066 M-01 Definitions M-02 AIS Introduction M-03 Aeronautical Information in a Standardized Manner M-04 Aeronautical Information Updates M-05 Scope of Aeronautical Data & Aeronautical Information M-06 Aeronautical Information Management M-07 Role of Aeronautical Data & Information Originators COM. OPS COURSES ( REVISED S&CFROM2022-2024)"}
{"chunks_id": "chunk_197", "text": "Role of Aeronautical Data & Information Originators COM. OPS COURSES ( REVISED S&CFROM2022-2024) Sr."}
{"chunks_id": "chunk_198", "text": "No. Course Title Duration Syllabus & Curriculum (S&C) Date of revision of (S & C) 1. Communication Operation Officer (COO) Course 14 weeks S&C-001-COM-4.0 30-01-2023 2. Aeronautical Fixed Service Operator (AFSO) Course 10 weeks S&C-002-COM-4.0 - do - 3. Aeronautical Communication Service Supervisor Course 06 weeks S&C-003-COM-3.0 - do - 4. COO (Refresher) Course 02 weeks S&C-004-COM-3.0 - do - 5. ACSS (Refresher) Course 01 week S&C-005-COM-3.0 - do - 6. IDS UBIMEX AMHS (Officer) Course 02 weeks"}
{"chunks_id": "chunk_199", "text": "ACSS (Refresher) Course 01 week S&C-005-COM-3.0 - do - 6. IDS UBIMEX AMHS (Officer) Course 02 weeks S&C-006-COM-3.0 - do - 7. IDS UBIMEX AMHS (Staff) Course 01 week S&C-007-COM-3.0 - do - 8. IDS AirNav AMHS (CRONOS) Database (Officer) Course 03 weeks S&C-008-COM-3.0 - do - 9. IDS AirNav AMHS (CRONOS) Database (Staff) Course 02 weeks S&C-009-COM-3.0 - do - 10. Aeronautical Mobile Service Course (under dev.process) 03 weeks S&C-010-COM-3.0 15-02-2024 11. IDS AMHS Advance Officer Course 02 weeks"}
{"chunks_id": "chunk_200", "text": "dev.process) 03 weeks S&C-010-COM-3.0 15-02-2024 11. IDS AMHS Advance Officer Course 02 weeks S&C-011-COM-3.0 30-01-2023 12. IDS AMHS Orientation Course 01 week S&C-012-COM-3.0 30-01-2023 13. Telephone Operation & Courtesy Course 02 weeks S&C-013-COM-2.0 30-05-2022 14. AFSO Elementary Course 04 weeks S&C-014-COM-3.0 30-01-2023 15. SDCPS Software (IOU) Course 01 Week S&C-015-COM-1.0 25-10-2022 16. ARFSM (for Officer) Course 01 Week S&C-016-COM-1.0 15-08-2023 17. Common Aeronautical Virtual"}
{"chunks_id": "chunk_201", "text": "16. ARFSM (for Officer) Course 01 Week S&C-016-COM-1.0 15-08-2023 17. Common Aeronautical Virtual Private Network (CRV) Officer Course 01 Week S&C-017-COM-1.0 15-01-2024 1. Course Title COMMUNICATION OPERATION OFFICER (COO) COURSE 2. Scope: This course is a specialized course designed to provide training for newly inducted officers employees. Course is designed to provide participants with the theoretical and practical application of International Aeronautical Telecommunication Service (IATS)"}
{"chunks_id": "chunk_202", "text": "and practical application of International Aeronautical Telecommunication Service (IATS) procedures in accordance with ICAO standards and recommended practices and to prepare them to supervise & handle the operations of both data & voice communications. 3. Objective After completion of the course the participants will be able to: • Supervise the smooth functioning of communication operations. • Implement the procedures pertaining to Aeronautical Fixed Service, Aeronautical Mobile Service and"}
{"chunks_id": "chunk_203", "text": "Implement the procedures pertaining to Aeronautical Fixed Service, Aeronautical Mobile Service and Aeronautical Broadcasting Service. • Properly monitor administration ofAMHS terminals. • Monitor exchange of FPL, OPMET and NOTAM messages and handling of ATN messages. • Efficiently manage MET / NOTAM / FPL Data Bases (DB). • Map AFTN and AMHS addressing. • Monitor circuit status information through maintenance shelf. • Generate report like statistical reports and Diagnostic reports. • Use of"}
{"chunks_id": "chunk_204", "text": "maintenance shelf. • Generate report like statistical reports and Diagnostic reports. • Use of Directory server for refreshing, adding, updating and deleting of entries. • Operate high frequency radio telephony (HF/RT) channel for voice and data communication. 4. Duration 14 Weeks 5. Entry Qualification B.Sc. / BS (Physics, Maths, Computer Science, Aviation management) B.E (Telecom/ Electronics/ Computer / Communication) with 2nd Division 6. Number of Participants 06-08 7. Subjects / Modules /"}
{"chunks_id": "chunk_205", "text": "Computer / Communication) with 2nd Division 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION PROCEDURES-I M-02 COMMUNICATION PROCEDURES-II M-03 AIR LAW M-04 AIR TRAFFIC SERVICE M-05 AERONAUTICAL INFORMATION SERVICE / AIM M-06 RADIO AIDS TO NAVIGATION M-07 METEOROLOGY M-08 INTRODUCTION TO DATA NETWORKING M-09 ATS GEOGRAPHY M-10 FLIGHT NAVIGATION M-11RADIO TELEPHONY (VOICE COMMUNICATION) M-12 AFTN / AMHS (THEORY) M-13 AMHS (PRACTICALS /"}
{"chunks_id": "chunk_206", "text": "M-11RADIO TELEPHONY (VOICE COMMUNICATION) M-12 AFTN / AMHS (THEORY) M-13 AMHS (PRACTICALS / EXERCISES) 1. Course Title AERONAUTICAL FIXED SERVICE OPERATOR (AFSO) COURSE 2. Scope: This course is a specialized course for new inductees. Course provide participants with the theory and practical training of aeronautical fixed service ground to ground message handling procedures in accordance with ICAO standards and recommended practices and to prepare them to work on AFTN/AMHS environment and enable"}
{"chunks_id": "chunk_207", "text": "standards and recommended practices and to prepare them to work on AFTN/AMHS environment and enable to send, receive and retrieve aeronautical message handling efficiently and to provide satisfactory services to handle the operations of both data & voice communications. 3. Objective After completion of the course the participants will be able to: • Send, receive and retrieve aeronautical messages efficiently. • Learn Operational use of Aeronautical Fixed Service, Aeronautical Mobile Service and"}
{"chunks_id": "chunk_208", "text": "efficiently. • Learn Operational use of Aeronautical Fixed Service, Aeronautical Mobile Service and Aeronautical Broadcasting Service. • Provide satisfactory services to handle the operations of both data & voice communications. • Handle ground to ground messaging procedures in accordance with ICAO standards and recommended practices 4. Duration 10 Weeks 5. Entry Qualification F.Sc. (Pre-Engineering)/ D.A.E / F.A 6. Number of Participants 06-08 7. Subjects / Modules / Events 1. Progress Tests"}
{"chunks_id": "chunk_209", "text": "D.A.E / F.A 6. Number of Participants 06-08 7. Subjects / Modules / Events 1. Progress Tests will be conducted at the end of module or after covering a portion of the course/subject. Weightage of all progress tests will be 25% of total score of each subject/module. Final Examination / Assessment for theory and practical will be conducted at the end of each module, which will have 75% weightage of the total score of each subject / module. 2. The Examination / Assessment will be based on"}
{"chunks_id": "chunk_210", "text": "of the total score of each subject / module. 2. The Examination / Assessment will be based on definitions, multiple choice questions, fill in the blanks, symbols, drawing & diagrams, exercises and other appropriate methods of assessment to measure performance of a trainee. 3. Distribution of Marks & Passing Marks: Name of Module Maximum Marks Passing Marks Course Introduction --- --- Communication Procedures-I 100 70% Communication Procedures-Ii 50 70% Air Law 50 70% Air Traffic Service 50 70%"}
{"chunks_id": "chunk_211", "text": "Procedures-I 100 70% Communication Procedures-Ii 50 70% Air Law 50 70% Air Traffic Service 50 70% AIS / AIM 50 70% Radio Aids to Navigation 100 70% Meteorology 100 70% Introduction To Data Networking 50 70% Radio Telephony (Voice Comm.) 50 70% AFTN / AMHS (Theory) 100 70% AMHS (Practicals / Exercises) 100 70% Total Marks 800 560 Aggregate 1. Course Title AERONAUTICAL COMMUNICATION SERVICE SUPERVISOR COURSE 2. Scope: This course consists of class room sessions, practical session, exercises in"}
{"chunks_id": "chunk_212", "text": "COURSE 2. Scope: This course consists of class room sessions, practical session, exercises in field of Communication Operations on International Aeronautical Telecommunication Service (IATS). 3. Objective After successful completion of this course, the trainees will be able to: • Supervise Communication Operations smoothly and efficiently. • Effectively Utilize Software and Hardware Components and System Interface. • Understand System Interface with Navigational Panel, Workspace Panel and"}
{"chunks_id": "chunk_213", "text": "and System Interface. • Understand System Interface with Navigational Panel, Workspace Panel and System Event Banner. • Add, update and delete Users and Groups through Administrative Features. • Map AFTN to AMHS Address using Directory Server. • Update, Delete, Clear and upload an AMC user address / CAAS table. • View, Add, Update and Delete Distribution List. • Transfer of traffic to alternate route of unserviceable circuit by MTA configuration. • Monitor circuit status information. •"}
{"chunks_id": "chunk_214", "text": "route of unserviceable circuit by MTA configuration. • Monitor circuit status information. • Understand Routing Directories, Transit time criteria and generation of statistical reports. • Utilize Practical knowledge of various aspects of Aeronautical Mobile Service. • Have advance knowledge of various AFTN/AMHS procedures & applications. 4. Duration 06 Weeks 5. Entry Qualification Basic AFSO Qualified communication personnel having experience of 03 years in the field of communication operations"}
{"chunks_id": "chunk_215", "text": "communication personnel having experience of 03 years in the field of communication operations and capable to supervise and handle day to day operational matters. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION PROCEDURES M-02 ATS GEOGRAPHY M-03 RADIO TELEPHONY (VOICE COMMUNICATION) M-04 AFTN/AMHS THEORY M-05 AMHS (PRACTICALS/EXERCISES) 1. Course Title COMMUNICATION OPERATION OFFICER REFRESHER COURSE 2. Scope: This course consists of"}
{"chunks_id": "chunk_216", "text": "1. Course Title COMMUNICATION OPERATION OFFICER REFRESHER COURSE 2. Scope: This course consists of class room sessions, practical session, exercises in field of Communication Operations 3. Objective After completion of this course, the trainees will be able to: • Acquaint with advancement in the field of communication operations. • Comprehend latest developments/changes taking place in procedures required to be implemented by ICAO. • Interact withevolving operational methodologies and its"}
{"chunks_id": "chunk_217", "text": "required to be implemented by ICAO. • Interact withevolving operational methodologies and its applicationwith timeline by ICAO. • Inculcate the practical understanding of digital NOTAM, AIXM, IWXXM, FIXM and use of XML/GML. 4. Duration 02 Weeks 5. Entry Qualification Basic COO Qualified communication personnel having experience of 03 years in the field of communication operations on AMHS. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION"}
{"chunks_id": "chunk_218", "text": "of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION PROCEDURES/Mobile Service M-02 AFTN / AMHS (THEORY) M-03 AMHS (PRACTICALS / EXERCISES) 1. Course Title AERONAUTICAL COMMUNICATION SERVICE SUPERVISOR REFRESHER COURSE 2. Scope: This course consists of class room sessions, practical session, exercises in field of Communication Operations. 3. Objective At the completion of this course, the participants will be able to: • Supervise Communication"}
{"chunks_id": "chunk_219", "text": "At the completion of this course, the participants will be able to: • Supervise Communication Operations smoothly and efficiently using latest available software tools. • Effectively utilize software and hardware components and system interface of AMHS IDS UBIMEX and AMHS IDS CRONOS • To implement procedures / amendments to the relevant ICAO Annexes/Documents. • Interact with evolving operational methodologies and its application with timeline by ICAO. • Inculcate the practical understanding of"}
{"chunks_id": "chunk_220", "text": "methodologies and its application with timeline by ICAO. • Inculcate the practical understanding of digital NOTAM, AIXM, IWXXM, FIXM and use of XML/GML. 4. Duration 01 Week 5. Entry Qualification Basic AFSO Qualified communication personnel having experience of 03 years in the field of communication operations. 6. Number of Participants 06-08 7 Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION PROCEDURES/Mobile Service M-02 AFTN / AMHS (THEORY) M-03 AMHS (PRACTICALS /"}
{"chunks_id": "chunk_221", "text": "M-01 COMMUNICATION PROCEDURES/Mobile Service M-02 AFTN / AMHS (THEORY) M-03 AMHS (PRACTICALS / EXERCISES) 1. Course Title IDS AirNav UBIMEX AMHS (Officer) Course 2. Scope: This course consists of class room sessions, practical session, exercises in field of Communication Operations by using AMHS Simulator Lab. 3. Objective At the end of this course, the participants will be able to: • Use Administrative command (Create Groups and Users) as per requirement. • Execute system setup options, print"}
{"chunks_id": "chunk_222", "text": "command (Create Groups and Users) as per requirement. • Execute system setup options, print rules and system events. • Add, update and delete the Static data. • Compose Flight Plan, Met, NOTAM and Free Form messages. • Handle message folders (Inbox, Outbox and supervisory folders). • Generate statistical reports of each user / manager. • Manage static and dynamic data. • View, add, update and delete Distribution List (DL). • Monitor AMHS circuits through Maintenance shelf. • View drain-in,"}
{"chunks_id": "chunk_223", "text": "delete Distribution List (DL). • Monitor AMHS circuits through Maintenance shelf. • View drain-in, drain-out Queue and generate drain report. • Shift the un-serviceable circuits on alternative circuits. • Use the mapping of AMHS to E-mail. 4. Duration 02 Weeks 5. Entry Qualification COO Course Qualified Communication Operations Officers. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 AMHSUBIMEX (THEORY) M-02 AMHS UBIMEX (PRACTICAL) 1. Course Title"}
{"chunks_id": "chunk_224", "text": "M-00 COURSE INTRODUCTION M-01 AMHSUBIMEX (THEORY) M-02 AMHS UBIMEX (PRACTICAL) 1. Course Title IDS AirNav AMHS UBIMEX (Staff) COURSE 2. Scope: This course consists of class room sessions, practical session, exercises in field of Communication Operations by using AMHS Simulator Lab. 3. Objective At the end of this course, the participants will be able to: • Add, update and delete the Static data. • Compose Flight Plan, Met, NOTAM and Free Form messages. • Handle message folders (Inbox, Outbox"}
{"chunks_id": "chunk_225", "text": "• Compose Flight Plan, Met, NOTAM and Free Form messages. • Handle message folders (Inbox, Outbox and supervisory folders). • Search / trace messages through query option. • Generate statistical reports of each user / manager. • View, add, update and delete Distribution List (DL). • Monitor AMHS circuits through Maintenance shelf. • View drain-in, drain-out Queue and generate drain report. • Shift the un-serviceable circuits on alternative circuits. 4. Duration 01 Week 5. Entry Qualification"}
{"chunks_id": "chunk_226", "text": "the un-serviceable circuits on alternative circuits. 4. Duration 01 Week 5. Entry Qualification Basic AFSO / AFSO Elementary course Qualified communication personnel having experience of 03 years in the field of communication operations and worked on AMHS. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 AMHS UBIMEX (THEORY) M-02 AMHS UBIMEX (PRACTICAL) 1. Course Title IDS AIR NAV AMHS (CRONOS) DATABASE (OFFICER) COURSE 2. Scope: This course consists"}
{"chunks_id": "chunk_227", "text": "1. Course Title IDS AIR NAV AMHS (CRONOS) DATABASE (OFFICER) COURSE 2. Scope: This course consists of class room sessions, practical sessions, exercises in field of Communication Operations by using AMHS Simulator Lab for CRONOS application. 3. Objective After completion of the course, the participants will be able to: • Supervise / operate AMHS CRONOS applications effectively. • Have explicit understanding of SDO features, Briefing office, NOTAM office, FPL office. • Create proposals, drafts"}
{"chunks_id": "chunk_228", "text": "of SDO features, Briefing office, NOTAM office, FPL office. • Create proposals, drafts and final submission of NOTAM and Flight plan. • Prepare SNOWTAM in accordance with operational usage of AMHS IDS CRONOS on prescribed format. • Prepare and submit Met reports and generation of ROBEX and TAF Bulletin. • Supervise / monitor AMHSIDS CRONOS functions. • Effect Parameter settings and Configuration of AMHS CRONOS. 4. Duration 03 Weeks 5. Entry Qualification COO Course / COO (Abridged) Course for"}
{"chunks_id": "chunk_229", "text": "of AMHS CRONOS. 4. Duration 03 Weeks 5. Entry Qualification COO Course / COO (Abridged) Course for officers having 03 years experience in the field of communication operations. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 ROBEX HANDBOOK M-02ANNEX-15 AIS M-03 DOC. 8126 / Doc-10066 / Doc-8400 M-04IDS CRONOS Aeronautical Dynamic Data Management. M-05AMHS CRONOS (Practical Exercises) 1. Course Title IDS AIRNAV AMHS (CRONOS) DATABASE (STAFF) COURSE 2."}
{"chunks_id": "chunk_230", "text": "CRONOS (Practical Exercises) 1. Course Title IDS AIRNAV AMHS (CRONOS) DATABASE (STAFF) COURSE 2. Scope: This course consists of class room sessions, practical session, exercises in field of Communication Operations by using AMHS Simulator Lab for CRONOS application. 3. Objective After completion of the course, the participants will be able to: • Operate AMHS CRONOS applications efficiently. • Prepare proposals, drafts and final submission of NOTAM and Flight plan. • Prepare & submit SNOWTAM •"}
{"chunks_id": "chunk_231", "text": "proposals, drafts and final submission of NOTAM and Flight plan. • Prepare & submit SNOWTAM • Prepare and submit Met reports and generation of ROBEX and TAF Bulletin. • Prepare and submit ATN messages. • Manage static data. • Generate of statistical reports. • Generate PIB (Pre-flight Information Bulletins). 4. Duration 02 Weeks 5. Entry Qualification AFSO / AFSO Elementary Course for staff having 03 years experience in the field of communication operations. 6. Number of Participants 06-08 7."}
{"chunks_id": "chunk_232", "text": "03 years experience in the field of communication operations. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 ROBEX HANDBOOK M-02 ANNEX-15 AIS M-03 DOC. 8126/ DOC10066 / Doc8400 M-04IDS AMHS CRONOS Aeronautical Dynamic Data Management M-05AMHS CRONOS (Practical) 1. Course Title AERONAUTICAL MOBILE SERVICE (AMS) COURSE 2. Scope: This course has been developed to present a comprehensive collection of information pertaining to “Aeronautical Mobile"}
{"chunks_id": "chunk_233", "text": "developed to present a comprehensive collection of information pertaining to “Aeronautical Mobile Service” air-ground and ground – ground communication procedures in accordance with ICAO standards and recommended practices. It is intended that the document will evolve into a course containing guidance material on operations of both data & voice communications. To meet the current and future needs of the Air Navigation Services, PCAA is at advanced stage of procurement of state of the art HF RT"}
{"chunks_id": "chunk_234", "text": "of the Air Navigation Services, PCAA is at advanced stage of procurement of state of the art HF RT system with new features of HFDL and SELCAL-32. Therefore new topics related to HFDL (High Frequency Data Link) has been included. Furthermore introduction of Amendment 91 to ICAO Annex 10 Vol-III related to expansion of pool for SELCAL also necessitated inclusion of related course material 3. Objective After completion of the course the participants will be able to: • gain theoretical and"}
{"chunks_id": "chunk_235", "text": "Objective After completion of the course the participants will be able to: • gain theoretical and practical knowledge of Aeronautical Mobile Service. • acquired knowledge and skills to a standard from which they can proceed onto field working at Aeronautical Stations after obtaining On Job Training (OJT) in local procedures. • work on HF R/T channel for voice communication as well as data communication through practical activities/exercises. • gain knowledge of HFDL being a component of ATN"}
{"chunks_id": "chunk_236", "text": "through practical activities/exercises. • gain knowledge of HFDL being a component of ATN subsystem emerged as a replacement of High Frequency Radio Telephony (HFRT) voice communication. 4. Duration 03 Weeks 5. Entry Qualification BSc. with 2nd Division for Officers &F.Sc for senior staff (SG-09, SG-10 & SG-11). 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION PROCEDURES-I M-02 RULES OF THE AIR M-03 AIR TRAFFIC SERVICE M-04 METEOROLOGY"}
{"chunks_id": "chunk_237", "text": "M-01 COMMUNICATION PROCEDURES-I M-02 RULES OF THE AIR M-03 AIR TRAFFIC SERVICE M-04 METEOROLOGY M-05 ATS GEOGRAPHY M-06 FLIGHT NAVIGATION M-07 HF DATA LINK (HFDL) M- 08 PRACTICAL(HF R/T Exercises in Language Lab ) 1. Course Title IDS AIRNAV AMHS ADVANCE (OFFICERS) COURSE 2. Scope: This course consists of class room sessions, practical session, exercises of advance options by using AMHS Simulator Lab including UBIMEX AMHS and CRONOS AMHS applications. 3. Objective The main objective of this"}
{"chunks_id": "chunk_238", "text": "Lab including UBIMEX AMHS and CRONOS AMHS applications. 3. Objective The main objective of this course is to prepare Com Ops officers for AMHS system administration. At the end of this course, the participants will be able to use the following commands related to parameterization, configuration and security settings: • Static data management • Creation of groups and users in both CRONOS and UBIMEX AMHS. • MTA and AU configuration. • Channel monitoring and supervision. • Directory Server (DS)"}
{"chunks_id": "chunk_239", "text": "AMHS. • MTA and AU configuration. • Channel monitoring and supervision. • Directory Server (DS) configuration and uploading procedures of AMC table, CAAS table and User lookup table. • Distribution list creation. • Channel testing and shifting of operation on alternative circuits. • Servers’ cleanup operation. • Security settings in CRONOS 4. Duration 02 Weeks 5. Entry Qualification Basic COO / COO Abridged course Qualified communication personnel having experience of 03 years in the field of"}
{"chunks_id": "chunk_240", "text": "COO Abridged course Qualified communication personnel having experience of 03 years in the field of communication operations. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 IDS AMHS UBIMEX and CRONOS (THEORY) M-02 IDS AMHS UBIMEX and CRONOS(PRACTICAL) 1. Course Title IDS AMHS ORIENTATION COURSE 2. Scope: This course consists of class room sessions, practical session, exercises on AMHS by using AMHS Simulator Lab. 3. Objective At the end of this"}
{"chunks_id": "chunk_241", "text": "practical session, exercises on AMHS by using AMHS Simulator Lab. 3. Objective At the end of this course, the participants will be able to: • Create ATS, Met, Admin messages as per format • Transmit, receive, store, and retrieve all types of messages. 4. Duration 01 Week 5. Entry Qualification Basic AFSO / AFSO Elementary qualified communication personnel. 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 AMHS (THEORY) M-02 AMHS SIMULATOR (PRACTICAL)"}
{"chunks_id": "chunk_242", "text": "/ Modules / Events M-00 COURSE INTRODUCTION M-01 AMHS (THEORY) M-02 AMHS SIMULATOR (PRACTICAL) 1. Course Title TELEPHONE OPERATION & COURTESY COURSE 2. Scope: This course consists of class room sessions and practical activities in Language Lab regarding telephone conversation. 3. Objective This course has been designed for the Telephone Operators, Personal Assistants, Stenographers, Secretaries and Clerical Staff and anyone who deals with customers regularly on telephones to familiarize them"}
{"chunks_id": "chunk_243", "text": "and Clerical Staff and anyone who deals with customers regularly on telephones to familiarize them with: • Importance of telephone etiquette in their job. • Enhanced confidence in dealing with different call scenario • Projection of positive and professional image of organization on telephone. • Enhanced telephone handling skills. • Terms used in telephone. 4. Duration 02 Weeks 5. Entry Qualification Matriculate / Intermediate 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00"}
{"chunks_id": "chunk_244", "text": "Matriculate / Intermediate 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01TELEPHONE OPS AND IMPORTANT INFORMATION M-02 TELEPHONE PHRASEOLOGY & COURTESY M-03 INTRODUCTION TO TELECOM PROVIDERS M-04 PRACTICAL ACTIVITY 1. Course Title AERONAUTICAL FIXED SERVICE OPERATOR ELEMANTARY COURSE 2. Scope: The course is designed for the staff working in communication operation trade without having formal training in Communication Operations. This course consists"}
{"chunks_id": "chunk_245", "text": "operation trade without having formal training in Communication Operations. This course consists of class room sessions, practical sessions, exercises. 3. Objective After successful completion of this course, the trainees will be able to: • Understand the main characteristics and basic functions of AMHS. • Work on AMHS efficiently and effectively. • Compose FPL, NOTAM, SNOWTAM, OPMET and free text messages. • Handle the message folders, alarms and supervisory inbox/outbox. • Generate"}
{"chunks_id": "chunk_246", "text": "free text messages. • Handle the message folders, alarms and supervisory inbox/outbox. • Generate statistics. • Generate reports. • View, add, delete and update distributions lists. . 4. Duration 04 Weeks 5. Entry Qualification Matric / Intermediate / DAE 6. Number of Participants 06-08 7. Subjects / Modules / Events M-00 COURSE INTRODUCTION M-01 COMMUNICATION PROCEDURES-I M-02 COMMUNICATION PROCEDURES-II M-03 ATS GEOGRAPHY M-04 ATS M-05 METEOROLOGY M-06 AIS M-07 AMHS (THEORY) M-08 AMHS"}
{"chunks_id": "chunk_247", "text": "PROCEDURES-II M-03 ATS GEOGRAPHY M-04 ATS M-05 METEOROLOGY M-06 AIS M-07 AMHS (THEORY) M-08 AMHS (PRACTICALS / EXERCISES) 1. Course Title SAFETY DATA COLLECTION & PROCESSING SYSTEM (SDCPS) SOFTWARE (IOU) COURSE 2. Scope: This course consists of class room sessions and practical activities in Simulator Lab regarding data feeding in the SDCPS (Safety Data Collection and Processing System) which also replaces the legacy IOU (Incidents Occurrence and Un-serviceability) report. 3. Objective This"}
{"chunks_id": "chunk_248", "text": "also replaces the legacy IOU (Incidents Occurrence and Un-serviceability) report. 3. Objective This course has been designed for the Communication Operation Personnel. After completion of this course the trainees will be able to feed correct data which enable them to use all fields and tabs of the SDCPS software. 4. Duration 01 Week 5. Entry Qualification COO / AFSO / AFSO Elementary Course Qualified 6. Number of Participants Minimum :06 Maximum :08 7. Subjects / Modules / Events Ref Modules /"}
{"chunks_id": "chunk_249", "text": "6. Number of Participants Minimum :06 Maximum :08 7. Subjects / Modules / Events Ref Modules / Subjects / Events M-00 COURSE INTRODUCTION M-01SDCPS SOFTWARE (Part-I) M-02 SDCPS SOFTWARE (Part-II) 1. Course Title AERONAUTICAL RADIO FREQUENCY SPECTRUM MANAGEMENT (ARFSM) FOR OFFICER COURSE 2. Scope: This course consists of class room sessions. It will provide guidance to the Com. Ops Officers regarding the concepts of frequency spectrum used for aviation purpose. The basic goal of spectrum"}
{"chunks_id": "chunk_250", "text": "regarding the concepts of frequency spectrum used for aviation purpose. The basic goal of spectrum management is to minimize interference and maximize spectrum efficiency. 3. Objective This course has been designed for the Communication Operation Officers. After completion of this course the trainees will be able to better understand the: • Concepts of frequency spectrum • Role of PTA/FAB in frequency allocation and licensing • Better coordination with PTA/FAB in process of licensing of"}
{"chunks_id": "chunk_251", "text": "in frequency allocation and licensing • Better coordination with PTA/FAB in process of licensing of aviation frequencies • Better management of aviation related frequencies to avoid interference for the safety of aircrafts, which will be helpful in running smooth operation as well as for the betterment of the organization. 4. Duration 01 Week 5. Entry Qualification COO Course Qualified 6. Number of Participants Minimum :06 Maximum :08 7. Subjects / Modules / Events Ref Modules / Subjects /"}
{"chunks_id": "chunk_252", "text": "of Participants Minimum :06 Maximum :08 7. Subjects / Modules / Events Ref Modules / Subjects / Events M-00 Course Introduction M-01Aeronautical Radio Frequency Spectrum Management (ARFSM) 1. Course Title COMMON AERONAUTICAL VIRTUAL PRIVATE NETWORK (CRV) (FOR OFFICER) COURSE 2. Scope: This course consists of class room sessions. Communication Operation Branch is responsible for the operation of Aeronautical Fixed Services. PCAA has planned to migrate ATS Message Handling System (AMHS) and ATS"}
{"chunks_id": "chunk_253", "text": "Aeronautical Fixed Services. PCAA has planned to migrate ATS Message Handling System (AMHS) and ATS Direct Speech Circuits to CRV as per timeline i.e. 31st December, 2023 by ICAO APAC office. PCAA planned to join CRV before the timeline. Therefore, a comprehensive training is required for the Communication Operations personnel for the CRV concepts. 3. Objective This course has been designed for the Communication Operation Officers. After completion of this course the trainees will be able to"}
{"chunks_id": "chunk_254", "text": "the Communication Operation Officers. After completion of this course the trainees will be able to better understand the: • The concepts of basic network topologies. • Virtual Private Networks architecture used in CRV. • The concepts SWIM (System Wide Information Management) operation over CRV. • Practical knowledge of the operations of CRV. 4. Duration 01 Week 5. Entry Qualification COO Course Qualified 6. Number of Participants Minimum :06 Maximum :08 7. Subjects / Modules / Events Ref"}
{"chunks_id": "chunk_255", "text": "Qualified 6. Number of Participants Minimum :06 Maximum :08 7. Subjects / Modules / Events Ref Modules / Subjects / Events M-00 Course Introduction M-01Common Aeronautical Virtual Private Network (CRV) AIM & OBJECTIVE OF AIR NAVIGATION SERVICES & COM.OPS SCHOOL THE OBJECTIVE OF THE SCHOOL IS TO IMPART TRAINING IN THE DISCIPLINES OF AIR TRAFFIC SERVICES INCLUDING RADAR AND COMMUNICATION OPERATIONS OUR AIM IS TO MEET THE TRAINING NEEDS OF FUTURE AIR NAVIGATION IN THE FIELD OF AIR TRAFFIC SERVICES"}
{"chunks_id": "chunk_256", "text": "OUR AIM IS TO MEET THE TRAINING NEEDS OF FUTURE AIR NAVIGATION IN THE FIELD OF AIR TRAFFIC SERVICES & COMMUNICATION OPERATION AIR TRAFFIC SERVICES COURSES Sr. No. DOCUMENT / RECORD TITLE DURATION NO. OF TRAINEES 1 Aerodrome/Area Control (Procedural) Course 28 Weeks 06-16 2 Basic ATC Course 40 Weeks 06-16 3 Aerodrome Control Course 14 Weeks 06-16 4 Approach Control (Procedural) Course 08 Weeks 06-10 5 Area Control (Procedural) Course 08 Weeks 06-10 6 Area / Approach Control Surveillance Course"}
{"chunks_id": "chunk_257", "text": "5 Area Control (Procedural) Course 08 Weeks 06-10 6 Area / Approach Control Surveillance Course 12 Weeks 06-12 7 Approach Control Surveillance Course 05 Weeks 06-12 8 Area Control Surveillance Course 08 Weeks 06-12 9 ATC Assistant Course 08 Weeks 08-18 10 ATC Assistant (Refresher) Course 02 Weeks 12-16 11 Basic Search & Rescue Course 02 Weeks 10-30 12 English Language Proficiency (ELP) for ATCO's Course 02 Weeks 08-16 13 Flight Procedure Design (Conventional) Course 02 Weeks 06-08 14 Flight"}
{"chunks_id": "chunk_258", "text": "Course 02 Weeks 08-16 13 Flight Procedure Design (Conventional) Course 02 Weeks 06-08 14 Flight Procedure Design (PBN) Course 03 Weeks 06-08 15 ATC Refresher (Abridged) for Officer Course 01 Week 06-16 16 Global Reporting Format (GRF) Course 01 Week 06-16 17 Aircraft Operation at Un-control Aerodrome Course 01 Week 06-16 18 Global Reporting Format (GRF) for Staff Course 02 Days 06-16 19 New GRF for Officers Course 03 Days 06-24 20 ATC Assistant Refresher (Abridged) Course 01 Week 06-12 21 ELP"}
{"chunks_id": "chunk_259", "text": "for Officers Course 03 Days 06-24 20 ATC Assistant Refresher (Abridged) Course 01 Week 06-12 21 ELP Course (Extended Level) for ATCOs 04 Weeks 08-16 22 Aerodrome Safeguarding & OLS Course 01 Week 06-16 23 Search And Rescue Coordinator Course 02 weeks 10-30 24 Managing Aeronautical Information Course 01 Week 10-30 COMMUNICATION OPERATIONS COURSES SR. NO. DOCUMENT / RECORD TITLE DURATION NO. OF TRAINEE 1. Communication Operation Officer (COO) Course 14 weeks 06-08 2. Aeronautical Fixed Service"}
{"chunks_id": "chunk_260", "text": "1. Communication Operation Officer (COO) Course 14 weeks 06-08 2. Aeronautical Fixed Service Operator (AFSO) Course 10 weeks 06-08 3. Aeronautical Communication Service Supervisor (ACSS) Course 06 weeks 06-08 4. COO (Refresher) Course 02 weeks 06-08 5. ACSS (Refresher) Course 01 week 06-08 6. IDS UBIMEX AMHS (Officer) Course 02 weeks 06-08 7. IDS UBIMEX AMHS (Staff) Course 01 week 06-08 8. IDS Air Nav AMHS (CRONOS) Database (Officer) Course 03 weeks 06-08 9. IDS Air Nav AMHS (CRONOS) Database"}
{"chunks_id": "chunk_261", "text": "Nav AMHS (CRONOS) Database (Officer) Course 03 weeks 06-08 9. IDS Air Nav AMHS (CRONOS) Database (Staff) Course 02 weeks 06-08 10. Aeronautical Mobile Service Operators Course 06 weeks 06-08 11. IDS AMHS Advance Officer Course 02 weeks 06-08 12. IDS AMHS Orientation Course 01 week 06-08 13. Telephone Operation & Courtesy Course 02 weeks 06-08 14. AFSO Elementary Course 04 weeks 06-08 15. SDCPS Software (IOU) Course 01 Week 06-08 16. ARFSM (for Officer) Course 01 Week 06-08 17. Common"}
{"chunks_id": "chunk_262", "text": "SDCPS Software (IOU) Course 01 Week 06-08 16. ARFSM (for Officer) Course 01 Week 06-08 17. Common Aeronautical Virtual Private Network (CRV) Officers Course 01 Week 06-08 HR, Fac & Support Staff LAB Asst. Elects/ NAV Aids/Comm/Surveil LAB Supdt. Elects/ NAV Aids/Comm/Surveil OI/C RADAR Simulator Instructors Electronics/NAV Aids/Comm/Surveillance Sr. Instructors Electronics/NAV Aids/Comm/Surveillance Dy. Chief CNS Engineering Block HR Facilitation & Support Staff Pseudo Pilot Demonstrator ATS"}
{"chunks_id": "chunk_263", "text": "Dy. Chief CNS Engineering Block HR Facilitation & Support Staff Pseudo Pilot Demonstrator ATS Language Instructor Instructor ATS Dy. Chief ATS & Com. Ops Block Sr. Instructor ATS OI/C Com. Ops Sr. Instructor Com. Centre & EPABX Instructor Com. Ops. Demonstrator Com. Ops. Supervisor Com. Ops. Chief of ANS School / Chief Instructor Chief School of APS"}
{"chunks_id": "chunk_264", "text": "Deputy Chief / Sr. Instructor\nSr. Instructor / Instructor E&M\nSupdt. E&M\nSuprv / Lab Asst. E&M\nSr. Instructor / Instructor Civil\nSupdt. Civil\nSuprv / Lab Asst. Civil\nSr. Instructor / Instructor Fire Fighting\nSupdt. Fire Fighting\nSuprv / Lab Asst. Fire Fighting\nSr. Instructor / Instructor Commercial & Estate\nSupdt. Commercial & Estate\nSr. Instructor / Instructor APS / Vigilance\nSupdt. APS / Vigilance\nHR Support Staff"}
{"chunks_id": "chunk_265", "text": "SCHOOL OF AIRPORT SERVICES INTRODUCTION / OVERVIEW: School of Airport Services imparts trainings in the areas of Electrical, Mechanical, Civil, Rescue & Fire Fighting Service, Facilitation and Hospitality Management, Cargo Operations, Aerodrome Operations, Commercial and Estates Operations, Fire Fighting Vehicles Operations & Maintenance and Airport Security. ROLES & FUNCTIONS: 1. Course Development: • Identification of new courses as per OPI requrements / needs • Development of new courses in"}
{"chunks_id": "chunk_266", "text": "• Identification of new courses as per OPI requrements / needs • Development of new courses in coordination with Training Branch and Subject Matter Experts (SMEs) from OPI Directorates / Industry 2. Course Revision: • Revision of courses as per schedules prescribed in the Training Procedures Manual • Revision of exisiting courses in consultation with Subject Matter Experts (SMEs) from OPI Directorates / Industry 3. Training Planning: • Devise annual training plan of approved courses as per"}
{"chunks_id": "chunk_267", "text": "/ Industry 3. Training Planning: • Devise annual training plan of approved courses as per requirements of OPI directorates in coordination with Training Branch 4. ConductTrainings: • Conduct scheduled trainings as per annual training plan and unscheduled courses as per OPI Directorate / External Customer requirements ORGANOGRAM KEY CONTACT: Designation: Chief APS School / AdlDS E&M Contact: 022-9260310 Ext: 310 Email: CEMS@caapakistan.com.pk AVIATION MANAGEMENT SCHOOL Introduction Training and"}
{"chunks_id": "chunk_268", "text": "Ext: 310 Email: CEMS@caapakistan.com.pk AVIATION MANAGEMENT SCHOOL Introduction Training and development initiatives are educational activities within an organization that are designed to improve the job performance of an individual or group. These programs typically involve advancing a worker's knowledge and skill sets and instilling greater motivation to enhance job performance. Aviation Management school CATI is tasked to impart the training in following fields: • Management Course: designed"}
{"chunks_id": "chunk_269", "text": "school CATI is tasked to impart the training in following fields: • Management Course: designed to help officers to develop the skills and knowledge necessary to be effective leaders. Course cover all aspects of airport management including leadership • Soft Skills Courses: enable employees to “think outside the box” both creatively and critically. Using these skills, employees will be able to weigh up their options, make informed decisions, making them more likely to achieve the desired"}
{"chunks_id": "chunk_270", "text": "to weigh up their options, make informed decisions, making them more likely to achieve the desired results. • Promotion Courses: an employee feels motivated and determined to reach at a higher position. The purpose of this training is to make an employee well equipped with the essential skills required to perform the high-level job. • Job related courses for support functions: give employees not only a better understanding of their responsibilities, the knowledge and skills they need to do that"}
{"chunks_id": "chunk_271", "text": "a better understanding of their responsibilities, the knowledge and skills they need to do that job but also keep them up-to-date in their field. Existing Courses: 1. AVIATION MANAGEMENT COURSE Scope: This course is designed for the officers of Pakistan CAA who are to be deployed as the managers of Airports. The course covers the basic key features of manpower, and resources management. This course also briefs terminal management as well as airside management and all other aerodrome operational"}
{"chunks_id": "chunk_272", "text": "also briefs terminal management as well as airside management and all other aerodrome operational related matters. Objectives: • Run/ monitor smooth operation at airport • Manage discipline generally, in accordance with ICAO standards • Maintain the organizational and administrative aspects • Deal with all the internal/ external agencies/ stake holders of aviation operation. • Achieve an understanding of the historical development of the civil aviation industry, including key milestones. •"}
{"chunks_id": "chunk_273", "text": "of the historical development of the civil aviation industry, including key milestones. • Establish and identify the key characteristics of the aviation industry. • Identify the internal & external components in aviation, including the global, regional regulatory framework. • Explain the functions of airports and Air Traffic Services. • Describe the accepted fundamental introductory aviation human factors and aviation safety concepts and illustrate their importance in the aviation environment."}
{"chunks_id": "chunk_274", "text": "factors and aviation safety concepts and illustrate their importance in the aviation environment. • Identify and explain the need for, fundamental structure, relationships and tasks involved in airline operations control. Duration: 05 Weeks Eligibility Criteria: • Graduate or equivalent, officers must have at least three years working experience in EG-01 and above • Must be fluent in English • Preferably who are to be assigned task as Airport / Terminal Managers 2. SUPERINTENDENT DEVELOPMENT"}
{"chunks_id": "chunk_275", "text": "Preferably who are to be assigned task as Airport / Terminal Managers 2. SUPERINTENDENT DEVELOPMENT COURSE Scope: This course is aimed to assist staff in developing skills, knowledge, attributes and procedures they must acquire to perform the designated job of superintendent in the most effective and efficient manner. Objectives: • After completion of this course participants will be able to, identify the basic role of superintendent, gain communication skills with others, enhance SKAs with"}
{"chunks_id": "chunk_276", "text": "identify the basic role of superintendent, gain communication skills with others, enhance SKAs with regard to motivation, honesty & Integrity. The participants will also be able to implement code of conduct & personal as well as professional ethics. Duration: 01 Week Eligibility Criteria: • SG-09 to SG-11 officials of all trades • At-least having intermediate qualification • Must be proficient in English 3. BASIC OFFICE ORGANIZATION COURSE FOR ASSTT/ SUPVR Scope: This course will equip the"}
{"chunks_id": "chunk_277", "text": "in English 3. BASIC OFFICE ORGANIZATION COURSE FOR ASSTT/ SUPVR Scope: This course will equip the officials with SKAs that will enable them to professionally deal with the day to day matters of office desk work (secretarial duties)/ understanding proper document/ record keeping/ controlling and bring forward the file/ mail timely. Objectives: • to understand structure of organization • to handle Diary dispatch properly • to maintain filing (Opening, closing, proper page marking & Cross"}
{"chunks_id": "chunk_278", "text": "handle Diary dispatch properly • to maintain filing (Opening, closing, proper page marking & Cross reference) • to know types of official documents & record and their status • to do proper recording keeping (maintaining DRML & DDL) • to learn basic functions of MS Word/ Power Point • to know physically all process of Airport specially of Admin/ HR related trade • to maintain service book • to prepare pension case • to learn format/ pattern of official correspondence • to implement and maintain"}
{"chunks_id": "chunk_279", "text": "pension case • to learn format/ pattern of official correspondence • to implement and maintain code of conduct, ethics • to learn grounds for initiating proceedings and penalties Duration: 02 Weeks Eligibility Criteria: • Officials of SG-05 to SG-08 of all trades performing or likely to perform desk work (Secretarial duties), preferably Admin/ HR trade new inductees. • At-least having intermediate qualification OIC ES E&M"}
{"chunks_id": "chunk_280", "text": "Substation & Power House In-charge\nE/M Complain cell Incharge\nE/M Supervisor"}
{"chunks_id": "chunk_281", "text": "ENGINEERING SERVICES ELECTRO-MECHANICAL (E/M)SECTION (CATI) The Electro-mechanical section at CATI plays a pivotal role in managing and maintaining the complex systems that involve electrical,mechanical and construction aspect. This section plays critical role in maintaining the infrastructure and technical systems essential for the smooth functioning and safety of Schools,sections and residential areas within CATI. ROLES & FUNCTIONS: 1. Electrical System: • Oversee the installation and"}
{"chunks_id": "chunk_282", "text": "areas within CATI. ROLES & FUNCTIONS: 1. Electrical System: • Oversee the installation and maintenance of electrical systems . • Conduct regular inspections to identify and address potential electrical issues. • Implement energy-efficient solutions to optimize power usage. 2. Mechanical Systems: • Manage the installation and upkeep of mechanical systems, such as HVAC (heating, ventilation, and air conditioning). • Ensure proper functioning of equipment and machinery. 3. Works and Construction:"}
{"chunks_id": "chunk_283", "text": "conditioning). • Ensure proper functioning of equipment and machinery. 3. Works and Construction: • Oversee construction and renovation projects within the department. • Coordinate with contractors and construction teams to ensure projects are completed on time and within budget. • Conduct regular inspections to maintain the structural integrity of buildings. ORGANOGRAM Contact: Designation: Officer In Charge ES E&M, CATI Hyderabad. Contact: Ext. 240 Email: abdul.shakoor@caapakistan.com.pk Mr."}
{"chunks_id": "chunk_284", "text": "In Charge ES E&M, CATI Hyderabad. Contact: Ext. 240 Email: abdul.shakoor@caapakistan.com.pk Mr. Sumair Saeed Director CATI Let me take this opportunity to welcome all visitors, students, aviation enthusiasts and our fellow colleagues of the Civil aviation community to the Civil Aviation Training Institute (CATI) Hyderabad – Pakistan. CATI started functioning from Hyderabad – Pakistan in 1982 and was later declared by ICAO (International Civil Aviation Organization) as the Regional training"}
{"chunks_id": "chunk_285", "text": "and was later declared by ICAO (International Civil Aviation Organization) as the Regional training institute for the ICAO Asia Pacific Region. In pursuit of ensuring continuous improvements in our training endeavours, we recently developed the CATI Vision 2030 in the year 2022 that is expected to bring about necessary changes needed to provide the institute with the competitive advantage and right kind of focus to provide high quality of trainings primarily in the field of Civil Aviation. With"}
{"chunks_id": "chunk_286", "text": "kind of focus to provide high quality of trainings primarily in the field of Civil Aviation. With the forward-looking CATI Vision 2030, we believe that we would be equipping our trainees with the right kind of skills and knowledge considered necessary in diversified disciplines. As the Director of this prestigious institute, I would like to assure everyone that with this the better version of CATI’s website the visit to the website would be good learning experience for all. We would also"}
{"chunks_id": "chunk_287", "text": "of CATI’s website the visit to the website would be good learning experience for all. We would also welcome all kind of feedback to further improve this website as well as suggestions for improvements in the institute as well. I would like to personally go through the feedback and suggestions and take necessary steps in this regard, wherever possible. We would continue to play our part in improving the Safety, Quality, Security, Environmental and Occupational health standards in the field of"}
{"chunks_id": "chunk_288", "text": "the Safety, Quality, Security, Environmental and Occupational health standards in the field of civil aviation. This institute would continue to improve the quality of trainings with every passing day and would act as a seat of learning in all the core, corporate and support areas whether as a Regulator or a service provider in aviation. We look forward to being a permanent part of your aviation education and learning efforts as well as to participate purposefully in contributing to your"}
{"chunks_id": "chunk_289", "text": "education and learning efforts as well as to participate purposefully in contributing to your success. Regards, Sumair Saeed Director, Civil Aviation Training Institute. About Finance Section Introduction/overview: The finance team supposed to be a department within any organization that handles all functions related to company’s financial well-being. Generally, a finance team is responsible for a variety of tasks, including accounting, budgeting, record keeping, administrative/financial work"}
{"chunks_id": "chunk_290", "text": "a variety of tasks, including accounting, budgeting, record keeping, administrative/financial work and cash flow. Functions/Services: • Prepare financial statements, reports, returns, annual account. • Monitor financial details to ensure that legal / departmental requirements are meet. • Supervise employees who do financial reporting and budgeting. • Review financial reports and seek ways to reduce costs. Organogram: Key Contacts Designation: Officer Incharge Finance CATI Contact : 0229260320"}
{"chunks_id": "chunk_291", "text": "costs. Organogram: Key Contacts Designation: Officer Incharge Finance CATI Contact : 0229260320 Email : oic.fin.cati@caapakistan.pk OIC FINANCE Overall Financial Controll"}
{"chunks_id": "chunk_292", "text": "SUPERINTENDENT PayRoll/Checking all payments/reciepts.\nACCOUNT ASSISTANT Disbursement ,Returns & Allied Work\nACCOUNT ASSISTANT Revenue Matters ,Bank Matters &Allied Work\nACCOUNT ASSISTANT Schedules, Typing Letters ,Summaries etc\nHEAD STAFF Record Keeping,Filing, Traffic Hand etc"}
{"chunks_id": "chunk_293", "text": "HR SECTION CATI Introduction/overview Human resource (HR) handle employees compensation benefits and terminations, HR is the set of people who make up the workforce of an organization, knowledge and skills which the individual command. HR Section plays a crucial and important role and manages officials matters pertain to HR Section. HR also plays a vital role in supporting of CATI vision & mission. The main function of HR are as under:- Functions/Services • To update service books for officers/"}
{"chunks_id": "chunk_294", "text": "The main function of HR are as under:- Functions/Services • To update service books for officers/ staff • To issue office orders/circulars • To appoint outsource employees on Contract as per requirement • To issue Posting/ transfer orders • To allot bachelor/ family accommodation for employees as per policy • To coordinate legal Counsel on matters related to litigation • To reply Govt./ internal audit observation pertains to HR • To issue detailing orders for temporary duty / tour • To process"}
{"chunks_id": "chunk_295", "text": "audit observation pertains to HR • To issue detailing orders for temporary duty / tour • To process leave cases (Ex Pakistan leave/ Earned Leave) • To process pension cases • To coordinate HQCAA as required • To update personnel files of Officers/ Staff • To distribute/ dispatch official Dak. Organogram Key contact. Designation Officer In charge HR CATI Contact No. 0300-3025328 (GHULAM AZAM) Email.jtdshr.cati@caapakistan.com.pk O.I/C HR"}
{"chunks_id": "chunk_296", "text": "SUPVR GRAGE-I\nASSTT. GRADE-I ASSTT. GRADE-II\nJR. STAFF\nDDS (ADMIN)"}
{"chunks_id": "chunk_297", "text": "INFORMATION TECHNOLOGY SECTION (CATI) The Information Technology (IT) section plays a crucial role across all schools and sections at CATI. Its responsibilities are diverse and impact nearly every aspect of modern businesses. Here are some key roles of the IT section: ROLES & FUNCTIONS: 1. Infrastructure Management: • Networks: Managing computer networks to ensure seamless communication and data transfer. • Hardware: Maintaining, and upgrading physical computing equipment such as servers,"}
{"chunks_id": "chunk_298", "text": "data transfer. • Hardware: Maintaining, and upgrading physical computing equipment such as servers, computers, and storage devices. 2. Software Development, Database, and Maintenance: • Applications: Developing, deploying, and maintaining software application TMMS (Training Management and Monitoring System) that cater to the specific needs of the training institute. • Managing databases to store, organize, and retrieve data efficiently. • Ensure other CAA applications (ERP, TMMS, Payroll, etc.)"}
{"chunks_id": "chunk_299", "text": "organize, and retrieve data efficiently. • Ensure other CAA applications (ERP, TMMS, Payroll, etc.) are running. 3. User Support: • Help Desk: Providing technical support to end-users, troubleshooting issues, and offering guidance on the use of technology. • Awareness Sessions: Conduct training/ awareness sessions to ensure that employees are proficient in using IT resources. 4. Strategic Planning: • IT Strategy: Collaborating with other departments to align IT initiatives with overall training"}
{"chunks_id": "chunk_300", "text": "• IT Strategy: Collaborating with other departments to align IT initiatives with overall training institute objectives. • Technology Planning: Identifying and adopting emerging technologies that can enhance institutional efficiency and competitiveness. ORGANOGRAM Contact: Designation: Officer In Charge IT, CATI Hyderabad. Contact: Ext. 326 Email: adeem.khan@caapakistan.com.pk OIC IT"}
{"chunks_id": "chunk_301", "text": "IT Assistant\nIT Assistant\nIT Assistant"}
{"chunks_id": "chunk_302", "text": "Page 1 of 1 INTRODUTION TO THE HOSTEL / MESS OF CIVIL AVIATION TRAINING INSTITUTE Overview • The main objective of Hostel / Mess is to provide clean, peaceful and comfortable stay to the trainees during course. • During the stay, provision of a balance and hygienic food is also the prime responsibility of Mess. .FUNCTION/SERVICES: • Planning to the accommodation of officers / staff upon their arrival for the course as per SOP. • To keep maximum comfort ability of trainees. • To plan the healthy"}
{"chunks_id": "chunk_303", "text": "for the course as per SOP. • To keep maximum comfort ability of trainees. • To plan the healthy food menu according to the strength of trainees / employees posted at CATI. • Check and inspection of Hostel regarding cleaning and routine functions. • Snap check the quality of cooking items / food. • In case of any malfunctioning in necessities / requirement of trainees, keep perusing to the concerned section. ORGANOGRAM: KEY CONTACT: 1) GHULAM MURTAZA SHAIKH Designation: President Hostel / Mess"}
{"chunks_id": "chunk_304", "text": "section. ORGANOGRAM: KEY CONTACT: 1) GHULAM MURTAZA SHAIKH Designation: President Hostel / Mess 2) IMRAN ATHAR Designation: OIC Hostel / Mess Contact No: 0345-2977998 President Hostel / Mess OIC Hostel / Mess Supervisor Hostel / Mess About Logistics Section Introduction/Overview: The Logistics Section at the Civil Aviation Training Institute (CATI) is a pivotal component in maintaining efficient control over available funds and resources for the provisioning, procurement, storage, distribution,"}
{"chunks_id": "chunk_305", "text": "over available funds and resources for the provisioning, procurement, storage, distribution, and utilization of inventory. Recognizing the urgency associated with securing essential supplies from the local market and expediting repairs for operational equipment, Logistics team is committed to ensuring CATI's uninterrupted operations. With a focus on timeliness and precision, the Logistics Section plays a crucial role in supporting CATI's mission to provide top-tier civil aviation training by"}
{"chunks_id": "chunk_306", "text": "plays a crucial role in supporting CATI's mission to provide top-tier civil aviation training by proactively managing the institute's logistical needs and upholding the highest standards of operational excellence. Function/Services: • Demand/Indent Management • Procurement through tendering and local purchase • Receipt/issuance of stores • Inventory management • Disposal of unserviceable/BER stores • Coordination with Log Centre (S) for receipt/despatch of material Organogram: Key Contact"}
{"chunks_id": "chunk_307", "text": "stores • Coordination with Log Centre (S) for receipt/despatch of material Organogram: Key Contact Designation: Officer Incharge Logistics CATI Contact: 022-9260337 Email: moaaz.ahmed@caapakistan.com.pk VIA EMAIL CIVIL AVIATION TRAINING INSTITUTE (CAA MEDICAL CENTRE) Officer Incharge IT CATI, Hyderabad. INFORMATION FOR CATI WEBSITE Reference of a weekly meeting on dated 29th December 2023 on the above caption subject. The information regarding medical center for CATI website is appended below:"}
{"chunks_id": "chunk_308", "text": "above caption subject. The information regarding medical center for CATI website is appended below: \"CATI's Medical Center stands as a pillar of support, offering 24/7 healthcare services to CAA employees, their families, and a large number of trainees. This vital facility provides emergency treatment, temporary accommodation, and indoor admission services, boasting 11 beds, a mini operation theatre and other essential amenities. With doctors and paramedical staff available around the clock, it"}
{"chunks_id": "chunk_309", "text": "and other essential amenities. With doctors and paramedical staff available around the clock, it ensures that healthcare needs are met promptly. Established in 1985, this facility has recently undergone a significant renovation, giving it a fresh and modern look. CATI remains committed to the well-being of its community, and the renovated Medical Center is a testament to this commitment.\" Submitted for your information & further necessary action please. (DR. MUHAMMAD MAROOF KHAN) Sr. Deputy"}
{"chunks_id": "chunk_310", "text": "for your information & further necessary action please. (DR. MUHAMMAD MAROOF KHAN) Sr. Deputy Director Medical (MS) OIC Medical Centre CATI, Hyderabad. Ext: 320 Dated: - 3rd January, 2024 L.M.NO.CATI/1885/001/TIMM Copy to:- OIC HR CATI. Concerned file About O/IC. Electronics Section Introduction/Overview Operating within the domain of Operations and Installation, Electronics team involves a diverse array of responsibilities essential for the smooth functioning of various electronic systems"}
{"chunks_id": "chunk_311", "text": "array of responsibilities essential for the smooth functioning of various electronic systems within an organization. Electronics professionals are tasked with a multifaceted role encompassing the oversight and maintenance of critical electronic infrastructures. Scope of work ranges from managing the Alcatel telephone exchange system to troubleshooting issues concerning fax machines. One core responsibility involves the meticulous care of a CCTV camera system comprising nine cameras, ensuring"}
{"chunks_id": "chunk_312", "text": "involves the meticulous care of a CCTV camera system comprising nine cameras, ensuring robust security measures. Collaborative efforts come into play when maintaining and ensuring the proper functioning of multimedia projectors installed in the CATI environment, emphasizing teamwork and collective responsibility. Additionally, O/IC Electronics team is instrumental in maintaining the audio and video systems in various settings. This includes the upkeep of the auditorium's sound and video"}
{"chunks_id": "chunk_313", "text": "and video systems in various settings. This includes the upkeep of the auditorium's sound and video systems, the audio systems in the CATI Mosque, and the audio-video systems within conference room and CATI Auditorium. Individual accountability becomes prominent in tasks such as the maintenance and upkeep of 13 Uninterruptible Power Supplies (UPSs), guaranteeing backup power availability when needed. Furthermore, they are entrusted with the resolution of any problems that may arise with fax"}
{"chunks_id": "chunk_314", "text": "needed. Furthermore, they are entrusted with the resolution of any problems that may arise with fax machines and are integral in the repair and maintenance of all lab equipment within the Electronics School, fostering an environment conducive to learning and experimentation. OIC Electronics Sr. Asst. Director Electronics Electronics Superintendent Electronics Superintendent Electronics Supervisor Electronics Assistant ATS COURSES 01. BASIC ATC COURSE (ICAO - 052 / 053 / 055) Scope This is a"}
{"chunks_id": "chunk_315", "text": "Electronics Assistant ATS COURSES 01. BASIC ATC COURSE (ICAO - 052 / 053 / 055) Scope This is a consolidated course that covers the scope of Basic ATC training. Basic ATC Course is comprised of Aerodrome Control Training (052), Approach Control (Procedure) training (053) and Area Control (Procedure) Training (055) in one course. The course contents include both theory and simulator based practical in such a way that the objectives of the course are achieved. Objectives This course provides"}
{"chunks_id": "chunk_316", "text": "in such a way that the objectives of the course are achieved. Objectives This course provides knowledge, skills and techniques required to equip the Air Traffic Controllers in accordance with ICAO standards and recommended practices and to prepare them to provide following services after successful completion of format OJT. • Aerodrome Control Service • Area Control Service (Procedural) • Approach Control Service (Procedural) • Flight Information Service • Alerting Service Duration 40 Weeks"}
{"chunks_id": "chunk_317", "text": "Control Service (Procedural) • Flight Information Service • Alerting Service Duration 40 Weeks Entry Qualification (For PCAA Inductees) • B.S. in (Physics/ Mathematics/ Computer Science/ Aviation Management) from HEC Recognized University with at least 2nd Division or equivalent CGPA (Minimum 16 years of Education is Mandatory) Or • Bachelors in Engineering from HEC recognized University with at least 2nd Division or equivalent CGPA (For Others) • Bachelor’s Degree with F.Sc. or A-Levels"}
{"chunks_id": "chunk_318", "text": "at least 2nd Division or equivalent CGPA (For Others) • Bachelor’s Degree with F.Sc. or A-Levels (Physics and Mathematics as major Subjects) or • Commercial Pilot License or Flight Operations Officer License holder with F.Sc. or A-Levels (Physics and Mathematics as major Subjects) • Good reading, writing, listening and speaking skills in English Language Number of participants Minimum : 06 Maximum : 16 02. AREA / APPROACH CONTROL SURVEILLANCE COURSE Scope The course consists of formal class"}
{"chunks_id": "chunk_319", "text": ": 16 02. AREA / APPROACH CONTROL SURVEILLANCE COURSE Scope The course consists of formal class work sessions augmented by practice on surveillance simulator. This course builds on the skills obtained in a course such as Basic ATC Course by providing the student with theory and simulator training in Surveillance at Area Control and Approach Control. Objectives This course provides knowledge, skills and techniques required to equip the air traffic control officers in accordance with ICAO"}
{"chunks_id": "chunk_320", "text": "skills and techniques required to equip the air traffic control officers in accordance with ICAO standards and recommended practice and to prepare them to take-up duties in Area Control and Approach Control Surveillance after successful completion of formal OJT. Duration 12 Weeks Entry Qualification Licensed Basic ATC Course qualified or Aerodrome / Area Control (Non Radar) with Approach (Non-Radar) qualified ATCOs fluent in oral and written English. ICAO English Language Proficiency (ELP)"}
{"chunks_id": "chunk_321", "text": "qualified ATCOs fluent in oral and written English. ICAO English Language Proficiency (ELP) Level-4 Number of Participants Minimum : 06 Maximum : 12 03. AERODROME / AREA CONTROL (PROCEDURE) COURSE (ICAO – 052, 055) Scope: This course covers the training in the field of Air Traffic Control which encompasses ICAO Aerodrome Control Training (052) and Area Control (Non-Radar) Training (055). It is designed to provide training for both new recruits and unqualified ATC personnel to licensing"}
{"chunks_id": "chunk_322", "text": "It is designed to provide training for both new recruits and unqualified ATC personnel to licensing standards. The course contents include both theory and simulator based practicals to achieve the objective of the course. Objectives This course provides knowledge, skills and techniques required to equip the air traffic controllers in accordance with ICAO standards and recommended practices and to prepare them to take up duties in various air traffic services units after successful completion of"}
{"chunks_id": "chunk_323", "text": "prepare them to take up duties in various air traffic services units after successful completion of formal On the Job Training (OJT) • Aerodrome Control Service • Area Control Service (Procedural) • Flight Information Service • Alerting Service Duration 28 Weeks Entry Qualification (For PCAA Inductees) • B.S. in (Physics/ Mathematic / Computer Science / Aviation Management) from HEC Recognized University with at least 2nd Division or equivalent CGPA (Minimum 16 years of Education is Mandatory)"}
{"chunks_id": "chunk_324", "text": "with at least 2nd Division or equivalent CGPA (Minimum 16 years of Education is Mandatory) or • Bachelors in Engineering from HEC Recognized University with at least 2nd Division or equivalent CGPA (For Others) • Bachelor’s Degree with F. Sc. or • A-Levels (Physics and Mathematics as major subjects) or Commercial Pilot License (CPL) or Flight Operations Officer (FOO) License holder with F. Sc. or A-Levels (Physics and Mathematics as major subjects) • Excellent reading, writing, listening and"}
{"chunks_id": "chunk_325", "text": "or A-Levels (Physics and Mathematics as major subjects) • Excellent reading, writing, listening and speaking skills In English Language Number of Participants Minimum : 06 Maximum : 16 04. AERODROME CONTROL COURSE (ICAO – 052) Scope: This Course is the First of Five Specialized Courses in the field of Air Traffic Control. It is design to provide training for both new recruits and unqualified ATC Personnel to Licensing Standards and Aerodrome Control. Objectives This Course provides knowledge,"}
{"chunks_id": "chunk_326", "text": "Personnel to Licensing Standards and Aerodrome Control. Objectives This Course provides knowledge, skills and techniques required to equip the Air Traffic Controllers in accordance with ICAO Standards and Recommended Practices and to prepare them to take up duties at Aerodrome Control Tower after successful completion of formal On The Job Training (OJT). Duration 14 Weeks Entry Qualification • (For PCAA Inductees) B.S. in (Physics / Mathematics / Computer Science / Aviation Management) from HEC"}
{"chunks_id": "chunk_327", "text": "PCAA Inductees) B.S. in (Physics / Mathematics / Computer Science / Aviation Management) from HEC Recognized University with at least 2nd Division or equivalent CGPA (Minimum 16 years of Education is Mandatory) Or Bachelors in Engineering from HEC Recognized University with at least 2nd Division or equivalent CGP Or Promoted ATC Staff with minimum of FSc qualification • (For Others) Bachelor’s Degree with FSc. or A-Levels (Physics and Mathematics as major subjects) Or Commercial Pilot License"}
{"chunks_id": "chunk_328", "text": "with FSc. or A-Levels (Physics and Mathematics as major subjects) Or Commercial Pilot License (CPL) Or Flight Operations Officer (FOO) License holder with FSc. or A-Levels (Physics and Mathematics as major Subjects) Excellent reading, writing, listening and speaking skills in English language Number of Participants Minimum : 06 Maximum : 16 05. APPROACH CONTROL (PROCEDURE) COURSE (ICAO - 053) Scope: This course will enable Air Traffic Controllers to handle Air Traffic in Approach Control"}
{"chunks_id": "chunk_329", "text": "Scope: This course will enable Air Traffic Controllers to handle Air Traffic in Approach Control (Procedure) environment after a formal on the job (OJT) training. Objectives To provide Air Traffic Controllers with adequate knowledge and skills required to handle Air Traffic in Approach Control (Procedure) environment in an International Standard. Duration 08 Weeks Entry Qualification Qualified air Traffic Controllers who have successfully completed the Course of Aerodrome / Area Control"}
{"chunks_id": "chunk_330", "text": "air Traffic Controllers who have successfully completed the Course of Aerodrome / Area Control (Procedure). Proficiency in written and spoken English Level - IV Number of Participants Minimum : 06 Maximum : 16 06. AREA CONTROL (PROCEDURE) COURSE (ICAO - 055) Scope: It is designed to provide training for both new recruits and unqualified ATC personnel with a good grounding in both theory and Simulator Training in Area Control Procedures. Objectives This course provides knowledge, skills and"}
{"chunks_id": "chunk_331", "text": "Training in Area Control Procedures. Objectives This course provides knowledge, skills and techniques required to equip the air traffic controllers in accordance with ICAO standards and recommended practices and to prepare them to take up duties in various air traffic services units after successful completion of formal on the job training (OJT). Duration 08 Weeks Entry Qualification • B.S. in (Physics / Mathematics / Computer Science / Aviation Management) from HEC recognized university with"}
{"chunks_id": "chunk_332", "text": "/ Mathematics / Computer Science / Aviation Management) from HEC recognized university with at least 2nd Division/equivalent CGPA or • Bachelors in Engineering from HEC recognized university with at least 2nd Division / equivalent CGPA or • Promoted ATC Staff with minimum of F.Sc. qualification or • 14 years of education for IJP Officers or • Any qualification approved by HQCAA Number of Participants Minimum : 06 Maximum : 16 07. AREA CONTROL SURVEILLANCE COURSE (ICAO - 054) Scope: This course"}
{"chunks_id": "chunk_333", "text": "Minimum : 06 Maximum : 16 07. AREA CONTROL SURVEILLANCE COURSE (ICAO - 054) Scope: This course builds on the skills obtained in a course such as Basic ATC Course or Aerodrome / Area Control (Procedure) by providing the student with theory and simulator training in Surveillance. Objectives This course provides knowledge, skills and techniques required to equip the air traffic control officers in accordance with ICAO standards and recommended practice and to prepare them to take-up duties in"}
{"chunks_id": "chunk_334", "text": "in accordance with ICAO standards and recommended practice and to prepare them to take-up duties in surveillance controlled environment of air traffic services, after OJT. Duration 08 Weeks Entry Qualification Basic ATC Course qualified, Aerodrome or Area Control (Procedure) rated. ICAO English Language Proficiency (ELP) Level – IV Number of Participants Minimum : 06 Maximum : 12 08. APPROACH CONTROL SURVEILLANCE COURSE (ICAO - 054) Scope: The course consists of formal class work sessions"}
{"chunks_id": "chunk_335", "text": "CONTROL SURVEILLANCE COURSE (ICAO - 054) Scope: The course consists of formal class work sessions augmented by practice on a Surveillance/Radar Simulator. This course builds on the skills obtained in a course such as Basic ATC Course by providing the trainee with theory and simulator training in Surveillance Approach Operation. Objectives This course provides knowledge, skills and techniques required to equip the Air Traffic Control Officers in accordance with ICAO standards and recommended"}
{"chunks_id": "chunk_336", "text": "to equip the Air Traffic Control Officers in accordance with ICAO standards and recommended practice and to prepare them to take-up duties in Surveillance Approach Control. Duration 05 Weeks Entry Qualification • Basic ATC Course or Aerodrome & Area Control (Procedure) Course • Approach Control (Procedure) Course • Area Control Surveillance Course • Fluent in oral and written English (ICAO English Language Proficiency (ELP) Level-4) Number of Participants Minimum: 06 Maximum: 12 09. ATC"}
{"chunks_id": "chunk_337", "text": "English Language Proficiency (ELP) Level-4) Number of Participants Minimum: 06 Maximum: 12 09. ATC REFRESHER (ABRIDGED) FOR OFFICER COURSE Scope: This course is designed to enhance and reinforce the already acquired knowledge of Air traffic controller during their basic level courses and actual job knowledge and skills obtained. It focuses the training on the competencies needed to perform their duties safely and efficiently. It is designed to meet regulatory requirements specified in Para"}
{"chunks_id": "chunk_338", "text": "duties safely and efficiently. It is designed to meet regulatory requirements specified in Para D9.1.1 of ANO-014-LCXX-3.0 Objectives Main objective of the course is to reinforce, enhance and prevent the erosion of the controller’s knowledge, skills and to ensure continuous competence of Air traffic controller. The objective of the course is not only to focus areas of routine Air traffic control job but also to cover those areas which are not commonly in use and most of the time remain dormant."}
{"chunks_id": "chunk_339", "text": "but also to cover those areas which are not commonly in use and most of the time remain dormant. Accordingly following areas are covered in this course: 1. Standard Practices and Procedures not only cover the routine Standards and Practices but also focus on the standards and practices that are rarely used e.g. seasonal procedure. 2. Abnormal and Emergency situations (ABES) is designed to explore Air traffic controllers with circumstances and situations which they do not face in routine"}
{"chunks_id": "chunk_340", "text": "explore Air traffic controllers with circumstances and situations which they do not face in routine operation or do not commonly experience. 3. Human Factor in the provision of Air Traffic Services covers the management of stress, boredom, fatigue, confidence, complacency and other relevant topics. 4. Threat and Error Management covers counter measures and management of undesired state i-e any operational condition where an unintended and traffic situation results in a reduction in margins of"}
{"chunks_id": "chunk_341", "text": "condition where an unintended and traffic situation results in a reduction in margins of safety. After completing this course trainee will be equipped with polished knowledge / skill of standard and practices in ATC as well as have refreshed the knowledge of ABES while managing Threat and Error Management in the job. Duration 01 Week (5 Days) Entry Qualification Air Traffic Controller Number of Participants • Minimum : 06 • Maximum : 16 10. ENGLISH LANGUAGE PROFICIENCY – ELP (ADVANCED LEVEL)"}
{"chunks_id": "chunk_342", "text": "Participants • Minimum : 06 • Maximum : 16 10. ENGLISH LANGUAGE PROFICIENCY – ELP (ADVANCED LEVEL) FOR ATCOS COURSE Scope: This Course has been designed to enhance the English Language Proficiency of participants in line with guidelines provided by ICAO and industry best practices. The Course is primarily aimed at aviation professionals e.g. ATCOs, Pilots etc. and will comprise of interactive exercises / activities based on aviation relevant content targeting the THREE key areas of LISTENING,"}
{"chunks_id": "chunk_343", "text": "/ activities based on aviation relevant content targeting the THREE key areas of LISTENING, SPEAKING and WRITING. Objectives Upon completion of the course, the participants will be able to improve their aural English skill for a more effective communication. Duration 02 Weeks Entry Qualification • ATCOs and Pilots (Commercial & General Aviation) with at least ELP Level-5. • Military Aviators and Controllers aspiring to improve English proficiency • Flying School students Note: It is expected"}
{"chunks_id": "chunk_344", "text": "Controllers aspiring to improve English proficiency • Flying School students Note: It is expected that participants possess prior knowledge of Radio Telephony procedures and the Aviation Alphabets / Numbers. Number of Participants Minimum : 08 Maximum : 16 Note: Even number of participants are preferable to facilitate group activities; however, odd number of participants may also be accepted. 11. ENGLISH LANGUAGE PROFICIENCY (EXTENDED LEVEL) COURSE Scope: This Course has been designed to"}
{"chunks_id": "chunk_345", "text": "11. ENGLISH LANGUAGE PROFICIENCY (EXTENDED LEVEL) COURSE Scope: This Course has been designed to enhance the English Language Proficiency (ELP) of participants in line with guidelines provided by ICAO and industry best practices. The Course is primarily aimed at aviation professionals e.g. ATCOs, Pilots etc. and will comprise of interactive exercises / activities based on aviation relevant content targeting the FOUR key areas of LISTENING, SPEAKING, WRITING and READING. Objectives Upon"}
{"chunks_id": "chunk_346", "text": "content targeting the FOUR key areas of LISTENING, SPEAKING, WRITING and READING. Objectives Upon completion of the course, the participants will be able to improve their English skills for effective communication. Duration 04 Weeks Entry Qualification • ATCOs and Pilots (Commercial & General Aviation) with ELP Level-4 or below • Military Aviators and Controllers aspiring to improve English Proficiency • Flying School Students Note: It is expected that participants possess prior knowledge of"}
{"chunks_id": "chunk_347", "text": "• Flying School Students Note: It is expected that participants possess prior knowledge of Radio Telephony procedures and the Aviation Alphabets / Numbers. Number of Participants Minimum : 08 Maximum : 16 Note: Even number of participants are preferable to facilitate group activities; however, odd number of participants may also be accepted. 12. BASIC SEARCH & RESCUE COURSE Scope: Basic Search and Rescue Course is aimed for the SAR stakeholders who have the responsibility to plan and prepare"}
{"chunks_id": "chunk_348", "text": "and Rescue Course is aimed for the SAR stakeholders who have the responsibility to plan and prepare for Search and Rescue Operation in the Aviation environment. The course includes overview of National SAR system and organization, the role of the SAR Stakeholders and Cooperation, Preparation and conduct of SAR operation, SAR resources and Global SAR perspective. Objectives Provide a Regional mechanism for coordinating Search and Rescue services to meet National and Regional needs and"}
{"chunks_id": "chunk_349", "text": "mechanism for coordinating Search and Rescue services to meet National and Regional needs and International commitments. Duration 02 Week (10 Days) Entry Qualification • Internal ➢ ATC Officers ➢ Other PCAA officers with relevant Job Description • External ➢ Officers with relevant Job Description of SAR Stakeholders ➢ Trainees from other countries with same criteria Number of Participants Minimum -10 Maximum–30 13. SAR COORDINATOR COURSE Scope: This course focuses to train individuals for the"}
{"chunks_id": "chunk_350", "text": "-10 Maximum–30 13. SAR COORDINATOR COURSE Scope: This course focuses to train individuals for the fulfilment of obligation accepted by the state being a signatory of the convention on International Civil Aviation (ICAO). The course limits to the organization and management of the National and Regional Aeronautical SAR system / Framework. Objective The course is designed to train SAR personnel for the provision of SAR services in Pakistan including the establishment/administration of RCCs, RSCs"}
{"chunks_id": "chunk_351", "text": "the provision of SAR services in Pakistan including the establishment/administration of RCCs, RSCs within Search and Rescue Regions (SRRs). Duration 02 Weeks Entry Qualification • Internal o ATC Officers o Other PCAA Officers with Relevant Job Description • External o Officers with Relevant Job Description of SAR Stakeholders Number of Participants • Minimum : 10 • Maximum : 30 14. FLIGHT PROCEDURE DESIGN (CONVENTIONAL) COURSE Scope Flight Procedure Design (conventional) course is crafted to"}
{"chunks_id": "chunk_352", "text": "DESIGN (CONVENTIONAL) COURSE Scope Flight Procedure Design (conventional) course is crafted to enable participants understand basics of procedure design as well as to meet requirement for advance Flight Procedure Design (PBN) course. Objectives To provide knowledge and develop skills for designing conventional Instrument Flight Procedures utilizing PANS-OPS criterion, after OJT under supervision of a qualified designer. Duration 04 Weeks Entry Qualification ATCL / CPL / FOO License holder with"}
{"chunks_id": "chunk_353", "text": "of a qualified designer. Duration 04 Weeks Entry Qualification ATCL / CPL / FOO License holder with 3 years post license experience. Number of Participants Minimum : 06 Maximum : 08 15. FLIGHT PROCEDURE DESIGN (PBN) COURSE Scope: Flight Procedure Design (PBN) course is crafted to enable participants to understand & Design PBN based Flight Procedures. Objectives At the end of course, the trainee should be able to design PBN instrument flight procedures by applying the PANS-OPS criteria, after"}
{"chunks_id": "chunk_354", "text": "should be able to design PBN instrument flight procedures by applying the PANS-OPS criteria, after OJT under supervision of a qualified designer. Duration 03 Weeks Entry Qualification Qualified Flight Procedure Design ( conventional ) course Number of Participants Minimum : 06 Maximum : 08 16. NEW GLOBAL REPORTING FORMAT FOR OFFICERS COURSE Scope: Conventional short Course on ICAO New Global Reporting Format for Runway Surface Condition Assessment and Reporting Objective The participants will"}
{"chunks_id": "chunk_355", "text": "Format for Runway Surface Condition Assessment and Reporting Objective The participants will demonstrate knowledge and skills on procedures, methods and techniques used to assess and report Runway Surface Conditions in compliance to the ICAO Global Reporting Format (GRF) Duration 03 Days Entry Qualification Fluent in English Number of Participants Minimum : 06 Maximum : 24 17. AERODROME SAFEGUARDING & OBSTACLE LIMITATION SURFACES (OLS) COURSE Scope: This course is designed for capacity building"}
{"chunks_id": "chunk_356", "text": "& OBSTACLE LIMITATION SURFACES (OLS) COURSE Scope: This course is designed for capacity building of the participants from Pakistan Civil Aviation Authority (PCAA) and different organizations like Building Control Authorities (BCA) Frequency Allocation Board (FAB) Pakistan Telecommunication Authority (PTA) Pakistan Air Force (PAF) and other relevant Departments. Objective Upon completion of course participants will be able to: • Understand and identify Obstacle Limitation Surfaces for an"}
{"chunks_id": "chunk_357", "text": "course participants will be able to: • Understand and identify Obstacle Limitation Surfaces for an Aerodrome • Protect the Aerodrome surroundings. • Regulate local zoning laws and ordinances effectively to ensure safety to the Aircraft Operation, its occupants and property. Duration 1 Week (5 days) Entry Qualification • Participant should be officer of grade 17 and above or equivalent grade from Public and Private Sector Organizations • Officer nominated by (PAF) Air Headquarter • Official with"}
{"chunks_id": "chunk_358", "text": "and Private Sector Organizations • Officer nominated by (PAF) Air Headquarter • Official with relevant experience nominated by (PCAA) Headquarter Number of Participants Minimum : 06 Maximum : 16 18. MANAGING AERONAUTICAL INFORMATION COURSE Scope: The course is developed to impart the knowledge and let the trainees (from various aviation concerned fields/trades) understand the importance of standardized quality assured aeronautical data and information in latest and upcoming avionics and"}
{"chunks_id": "chunk_359", "text": "standardized quality assured aeronautical data and information in latest and upcoming avionics and aviation. Objective a. To understand different type of Aeronautical Information, their scope and usage; b. To choose appropriate products for dissemination of Quality assured Aeronautical Information; and c. To understand the importance Aeronautical Data Quality requirements. d. To understand role of data originators in dissemination of quality assured Aeronautical Information for safe and"}
{"chunks_id": "chunk_360", "text": "role of data originators in dissemination of quality assured Aeronautical Information for safe and efficient aircraft operation. e. To understand importance of AIRAC system adherence for promulgation of Aeronautical Information Duration 01 Week Entry Qualification • Basic ATC • Area / Aerodrome control Course • Graduation with aviation back ground Number of Participants Minimum : 06 Maximum : 16 19. GLOBAL REPORTING FORMAT (GRF) COURSE Scope: Conventional short duration Job Center Training"}
{"chunks_id": "chunk_361", "text": "16 19. GLOBAL REPORTING FORMAT (GRF) COURSE Scope: Conventional short duration Job Center Training (JCT) Course on ICAO New Global Reporting Format for Runway Surface Condition Assessment and reporting. Objective Trainee on completion of course will demonstrate knowledge and skills on procedures, methods and techniques used to assess and report Runway surface conditions in compliance to the ICAO Global Reporting Format applicable as of 4th November, 2021. Duration 05 Days Entry Qualification ▪"}
{"chunks_id": "chunk_362", "text": "Global Reporting Format applicable as of 4th November, 2021. Duration 05 Days Entry Qualification ▪ Fair understanding of ATC Phraseology and fluent in English. Number of Participants ▪ Maximum : 16 ▪ Minimum : 06 20. AN INTRODUCTION TO PAKISTAN AIRSPACE AND AIR TRANSPORT SYSTEM Scope: This Course has been developed to provide basic knowledge about Pakistan’s airspace, its air route structure as well as various restricted, prohibited and danger areas, airports of Pakistan including joint-users"}
{"chunks_id": "chunk_363", "text": "well as various restricted, prohibited and danger areas, airports of Pakistan including joint-users airfields, Civil-Military coordination, issuance of clearances to Schedule / Non-schedule flights including coordination among ATC units and other agencies. The course also covers basic knowledge of aeronautical charges. Hence the course is applicable to the officers of Regulatory, ANS, APS, Billing and other trades. The officers of other relevant agencies may also participate. Objectives At the"}
{"chunks_id": "chunk_364", "text": "and other trades. The officers of other relevant agencies may also participate. Objectives At the end of this Course, participants will be able to understand the basics of: • Pakistan Airspace, Air Routes Structure, Prohibited, Restricted and Dangers areas as well as ATS Operations. • Flight approval procedures for schedule and non schedule flight operations. • Different types of Aeronautical charges and procedures. • Requirement and Importance of coordination among the Stake holders (Airline"}
{"chunks_id": "chunk_365", "text": "and procedures. • Requirement and Importance of coordination among the Stake holders (Airline operators, Airport operators, ANS providers, SOC and Other Military Authorities, Govt. Agencies, Embassies, AFPAs, Etc.,) Duration 01 Week Entry Qualification • Officers of Air Transport, ANS, APS, Billing and other trades • Officers of other relevant agencies / stakeholders Number of Participants Minimum : 06 Maximum : 16 21. AIRCRAFT OPERATION AT UNCONTROLLED AERODROME Scope: Aircraft Operation at"}
{"chunks_id": "chunk_366", "text": ": 06 Maximum : 16 21. AIRCRAFT OPERATION AT UNCONTROLLED AERODROME Scope: Aircraft Operation at uncontrolled Aerodrome Course is designed for those Private Organizations maintaining the Aerodromes with very limited Aircraft Operation. To provide awareness and information useful for the safe conduct of Flight. The participants would be able to learn basics of safety and precautionary measures related to Aircraft Operation. Objectives Provide information for the safe conduct of Aircraft Operation"}
{"chunks_id": "chunk_367", "text": "to Aircraft Operation. Objectives Provide information for the safe conduct of Aircraft Operation at the uncontrolled Aerodrome. Duration 01 Week (05 Days) Entry Qualification Intermediate or as specified by HQCAA Number of Participants Minimum - 06 Maximum - 16 ATS STAFF Courses 01. ATC ASSISTANT COURSE Scope: This Course has been developed to provide trainees with required theoretical knowledge & practical skills to perform duties as ATC / Flight Data Assistants. Objectives Upon successful"}
{"chunks_id": "chunk_368", "text": "& practical skills to perform duties as ATC / Flight Data Assistants. Objectives Upon successful completion of this course, the trainee will qualify for the deployment on duty in ATS units. Duration 08 Weeks Entry Qualification Intermediate or as specified by HQCAA Number of Participants Minimum : 08 Maximum : 18 02. ATC REFRESHER (ABRIDGED) FOR STAFF COURSE Scope: This course is designed to enhance and reinforce the already acquired knowledge of ATC / Flight Data Assistant during their"}
{"chunks_id": "chunk_369", "text": "to enhance and reinforce the already acquired knowledge of ATC / Flight Data Assistant during their elementary level courses and actual job knowledge and skills obtained. If focuses the training on the competencies needed to perform their duties safely and efficiently. Objective This course is designed to ensure that already competent Flight Data Assistants not only maintain their competence, but also enhance their performance in a wide variety of situations. Furthermore, as the ATM world"}
{"chunks_id": "chunk_370", "text": "but also enhance their performance in a wide variety of situations. Furthermore, as the ATM world enters an era of rapidly changing technology, procedures, New ATM Systems and New Aircraft with new functionalities, refresher training can be one of the important ways in which Flight Data Assistants are given the opportunity to review their performance in light of such changes. Duration 01 Week (5 Days) Entry Qualification ATC Assistant / Flight Data Assistant or Official with relevant experience"}
{"chunks_id": "chunk_371", "text": "Entry Qualification ATC Assistant / Flight Data Assistant or Official with relevant experience nominated by HQs PCAA. Number of Participants • Minimum : 06 • Maximum : 12 03. ATC ASSISTANT (REFRESHER) COURSE Scope: This course will review, reinforce, refresh and enhance the existing knowledge and skills of ATC Assistants to provide a safe, orderly and expeditious flow of air traffic. Objectives This course is designed to ensure that already competent Air Traffic Controller’s Assistant not only"}
{"chunks_id": "chunk_372", "text": "course is designed to ensure that already competent Air Traffic Controller’s Assistant not only maintain their competence, but also enhance their performance in a wide variety of situations. Furthermore, as the ATM world enters an era of rapidly changing technology, procedures, New ATM Systems and new Aircraft with new functionalities, refresher training can be one of the important ways in which Air traffic controller’s are given the opportunity to review their performance in light of such"}
{"chunks_id": "chunk_373", "text": "Air traffic controller’s are given the opportunity to review their performance in light of such changes. Duration 02 Weeks Entry Qualification As specified by HQCAA. Number of Participants • Minimum : 12 • Maximum : 16 04. GLOBAL REPORTING FORMAT (GRF) STAFF COURSE Scope: Conventional short duration Job Center Training (JCT) Course on ICAO New Global Reporting Format for Runway Surface Condition Assessment and reporting. Objective Trainee on completion of course will demonstrate knowledge and"}
{"chunks_id": "chunk_374", "text": "Assessment and reporting. Objective Trainee on completion of course will demonstrate knowledge and skills on procedures, methods and techniques used to assess and report runway surface conditions in compliance to the ICAO Global Reporting Format applicable as of 4th November, 2021. Duration 02 Days Entry Qualification • Fluent in English. Number of Participants Minimum : 06 Maximum : 16 1"}
{"chunks_id": "chunk_375", "text": "2\nOBJECTIVE • The main objective of Hostel / Mess is to provide clean, peaceful and comfortable stay to the trainees during course.\n• During the stay, provision of a balance and hygienic food is also the prime responsibility of Mess.\nFollowing premises are under take care of Hostel management.\no\nHOSTEL NO. 01\no\nHOSTEL NO. 02\no\nLADIES HOSTEL (C-2)\no\nEXPECTORATE BLOCK\no\nGUEST HOUSE\no\nCATI HOUSE\nACCOMMODATION FACILITY"}
{"chunks_id": "chunk_376", "text": "o\nLADIES HOSTEL (C-2)\no\nEXPECTORATE BLOCK\no\nGUEST HOUSE\no\nCATI HOUSE\nACCOMMODATION FACILITY\nHOSTEL NO.1 (Under Renovation) Reserved for CAA Staff (or equivalent for other organization) having rooms of different capacities with attached and non attached bath as follows:\no Total room with attached bath (Double Occupancy) - 14\no Total room without attached bath (Quad Occupancy) - 20 o Total accommodation - 108\no Kitchen / Dining Hall\nACCOMMODATION FACILITY"}
{"chunks_id": "chunk_377", "text": "o Kitchen / Dining Hall\nACCOMMODATION FACILITY\nHOSTEL NO.2 Reserved for CAA officers (or equivalent for other organization) having rooms of double occupancy with attached and non attached bath as follows:\no Room with attached bath - 14X2 = 28\no Room without attached bath - 28X2 = 56\no Total accommodation = 84\no Dining Hall for 100 persons.\nACCOMMODATION FACILITY LADIES HOSTEL (C-2) Reserved for female trainees, having 04 apartment with following facilities."}
{"chunks_id": "chunk_378", "text": "• Each apartment has 02 rooms (Double occupancy) with attached bath.\n• kitchen, Dining & Drawing room. • Total occupancy = 08\nACCOMMODATION FACILITY\nEXPECTORATE BLOCK: (Under Renovation) Reserved for visiting guests, foreign & Corporate sector trainees. Consisting on 04 Apartment (02 rooms in each portion) with following facilities:-\n• Drawing & Dining room\n• Kitchen\n• Servant room\nACCOMMODATION FACILITY\nGUEST HOUSE: Reserved for VIP Guest.\n•\n04 rooms with attached bath (double occupancy)\n•"}
{"chunks_id": "chunk_379", "text": "GUEST HOUSE: Reserved for VIP Guest.\n•\n04 rooms with attached bath (double occupancy)\n•\nDrawing & Dinning room with seating capacity for 10 persons. • Servant room / garage\nACCOMMODATION FACILITY\nCATI HOUSE: Reserved for Director CATI & Senior CAA officers with following facilities.\n•\n04 rooms with attached bath (double occupancy)\n•\nDrawing & Dinning room with seating capacity for 10 persons. • Servant room / garage ACCOMMODATION FACILITY\nTHANK YOU"}
{"chunks_id": "chunk_380", "text": "School of ANS(ATSEP Block) School of ANS (ATSEP Block), an integral part of the Air Navigation Services (ANS) School, conducts specialized trainings on CNS (Communication, Navigation, and Surveillance) system which are essential for safe and secure operation of Air Traffic Control in Airspace of Pakistan. These training programs empower CNS Engineering professionals to operate and maintain equipment in accordance with ICAO and Pakistan CAA regulations. In addition, the School of ANS (ATSEP"}
{"chunks_id": "chunk_381", "text": "in accordance with ICAO and Pakistan CAA regulations. In addition, the School of ANS (ATSEP Block) is also responsible for operation and maintenance of 3D Radar Aerodrome Simulator and various electronics facilities installed across CATI. Roles & Function 1. Course Development: a. Development of New Courses as per requirement of CNS Directorate. b. Coordination with CNS Directorate, Training Branch and Subject Matter Experts(SME). 2. Course Revision: a. Revision of existing courses as per"}
{"chunks_id": "chunk_382", "text": "Branch and Subject Matter Experts(SME). 2. Course Revision: a. Revision of existing courses as per schedule in Training Procedure Manual. b. Revision of existing courses as per requirement of CNS Directorate. 3. Training Plan: a. Devise annual Training Plan as per requirement of CNS Directorate in coordination with Training Branch. 4. Conduct of Training: a. Conduct scheduled trainings as per approved ATP b. Conduct unscheduled trainings as per requirement of CNS Directorate. 5. Upkeep and"}
{"chunks_id": "chunk_383", "text": "approved ATP b. Conduct unscheduled trainings as per requirement of CNS Directorate. 5. Upkeep and Maintenance of labs in School of ANS (ATSEP Block). a. Maintain Training Facilities required at School. 6. Installation and maintenance of Following Electronics Facilities: a. Telephone Exchange b. CCTV System c. UPS(s) and Fax Machines d. Audio/Video Systems 7. Operation and Maintenance of ATC Simulators at School of ANS(ATS Block) a. Procedure Lab b. Area/Approach Radar Simulator c. 3D Radar"}
{"chunks_id": "chunk_384", "text": "at School of ANS(ATS Block) a. Procedure Lab b. Area/Approach Radar Simulator c. 3D Radar Aerodrome Simulator d. AMHS Simulator Lab e. Digital Language Lab Organogram: Contact Detail: Designation: Chief ANS School CATI Hyderabad Contact No: 0302-8221309 Email: cas@caapakistan.com.pk Chief ANS School Sr. Instructor/Dy. Chief/ OIC 3D Radar Simulator Sr. Instructor Instructor/OIC Electronics Instructor Sr. Supdt Sr. Supdt Supervisor-II Sr. Supdt Sr. Supdt Supervisor-II Assistant SCHOOL OF"}
{"chunks_id": "chunk_385", "text": "Instructor Sr. Supdt Sr. Supdt Supervisor-II Sr. Supdt Sr. Supdt Supervisor-II Assistant SCHOOL OF REGULATORY SERVICES / FUNCTIONS Introduction The Civil Aviation Training Institute (CATI) of Pakistan was established in 1982 for improvement of technical expertise to contribute to the safety and development of the civil aviation industry. The institute was developed under the auspices of International Civil Aviation Organization (ICAO). CATI offers specialized training courses for domestic and"}
{"chunks_id": "chunk_386", "text": "Civil Aviation Organization (ICAO). CATI offers specialized training courses for domestic and international trainees in an effort to foster global-minded human resources experts in the regulatory system, air navigation system, airport management, operation, air traffic control and other fields in the aviation industry. Furthermore, CATI has been certificated as a TRAINAIR PLUS Regional Training Centre. CATI offers a comprehensive range of internationally-recognised training programmes in"}
{"chunks_id": "chunk_387", "text": "Centre. CATI offers a comprehensive range of internationally-recognised training programmes in various disciplines. The programmes are aligned to ICAO SARPs and best practices, to meet the training needs of the global aviation community. CATI provides the aviation industry and authorities with regulatory education and training consultancy. School of Regulatory Services / Functions is developing and delivering aviation regulatory training courses to the aviation sector. Mission & Vision To"}
{"chunks_id": "chunk_388", "text": "and delivering aviation regulatory training courses to the aviation sector. Mission & Vision To provide world class Regulatory Courses / Trainings for the capacity building of Aviation Leaders. Objective The main objective of School of Regulatory is capacity building of trainees in improving their professional competencies w.r.t. ICAO SARPs and resolving aviation related problems successfully. The objective of the opening the School of Regulatory Services / Functions is to encourage and provide"}
{"chunks_id": "chunk_389", "text": "objective of the opening the School of Regulatory Services / Functions is to encourage and provide assistance to students (inland & international) which reflects our commitment for the development of the next generation leaders in aviation industry. The courses made for individuals to meet the aviation industry, including aviation managers, regulators, and professionals seeking to gain a foundational understanding of the regulatory framework governing aviation operations. These courses provides"}
{"chunks_id": "chunk_390", "text": "understanding of the regulatory framework governing aviation operations. These courses provides participants with insights into the principles, guidelines, and key components of aviation regulations (SARPs) to ensure compliance and promote safety and efficiency within the industry. COURSES OFFERED Aerodrome Certification Aerodrome certification refers to the process by which an aerodrome (commonly known as an airport) is evaluated, approved, and certified by the relevant aviation authority or"}
{"chunks_id": "chunk_391", "text": "known as an airport) is evaluated, approved, and certified by the relevant aviation authority or regulatory body. The certification ensures that the aerodrome meets specific standards and regulatory requirements to ensure the safety and efficiency of aircraft operations, as well as the protection of passengers, crew, and the surrounding environment. Audit Technique These techniques employ a range of methods, including document reviews, interviews, observations, and data analysis. Audits can"}
{"chunks_id": "chunk_392", "text": "of methods, including document reviews, interviews, observations, and data analysis. Audits can cover different areas such as safety management systems, operational procedures, regulatory compliance, maintenance practices, and quality management. The purpose of audit techniques in aviation is to identify any discrepancies, non-compliance, or potential risks, and to provide recommendations for improvement. International Air Law International Air Law covers the rules that apply to both domestic"}
{"chunks_id": "chunk_393", "text": "International Air Law International Air Law covers the rules that apply to both domestic and international aviation. These rules govern the complex relationship between States, Service Providers and Passengers. The rules also govern the impact of aviation on the environment and on individuals affected by aircraft operations. Safety Management Evaluating a safety management system (SMS) in aviation is crucial for several reasons. Firstly, it allows for the identification of potential weaknesses"}
{"chunks_id": "chunk_394", "text": "is crucial for several reasons. Firstly, it allows for the identification of potential weaknesses or gaps in the system, enabling organisations to take proactive measures to address them before they lead to incidents or accidents. By conducting regular evaluations, aviation entities can assess the effectiveness of safety policies, procedures, and risk mitigation strategies, ensuring they are aligned with industry best practices and regulatory requirements. Additionally, regulatory authorities"}
{"chunks_id": "chunk_395", "text": "with industry best practices and regulatory requirements. Additionally, regulatory authorities often require SMS evaluations to ensure compliance and adherence to safety standards. Human Factors in Aviation Evaluating a safety management system (SMS) in aviation is crucial for several reasons. Firstly, it allows for the identification of potential weaknesses or gaps in the system, enabling organisations to take proactive measures to address them before they lead to incidents or accidents."}
{"chunks_id": "chunk_396", "text": "to take proactive measures to address them before they lead to incidents or accidents. Regulatory authorities often require SMS evaluations to ensure compliance and adherence to safety standards. Safety Assessment of Foreign Aircraft (SAFA) SAFA allows for the identification of potential weaknesses or gaps in the system, enabling organisations to take proactive measures to address them before they lead to incidents or accidents. Economic Policy and Strategy Economic and statistical analysis and"}
{"chunks_id": "chunk_397", "text": "lead to incidents or accidents. Economic Policy and Strategy Economic and statistical analysis and advice on airports, airlines and air traffic services to develop and support policies, including aviation liberalisation, slot allocation, price control, etc. Evaluation of the economic consequences of policy options. Aviation Data Driven Economic and statistical analysis and advice on airports, airlines and air traffic services to develop and support policies, including aviation liberalisation,"}
{"chunks_id": "chunk_398", "text": "and air traffic services to develop and support policies, including aviation liberalisation, slot allocation, price control, etc. Evaluation of the economic consequences of policy options. Calculation of the existing airport developments, forecasting the impact of changes to Air Traffic Operations. Hazard Management in Aviation Commonly referred to as bird strikes. These efforts aim to enhance aviation safety by reducing the probability of bird strikes and other wildlife-related incidents,"}
{"chunks_id": "chunk_399", "text": "aviation safety by reducing the probability of bird strikes and other wildlife-related incidents, which can lead to damage to aircraft, pose risks to passengers and crew, and incur significant economic and operational costs for the aviation industry. Aerodrome Operation Aerodrome operations encompass all activities and functions related to the management, maintenance, and utilization of an airport or aerodrome. This includes a wide range of responsibilities, such as air traffic control,"}
{"chunks_id": "chunk_400", "text": "airport or aerodrome. This includes a wide range of responsibilities, such as air traffic control, aircraft handling and parking, runway and taxiway management, passenger services, cargo handling, ground transportation coordination, airport security, fire fighting and emergency response, and overall infrastructure maintenance. Aerodrome operations are crucial for ensuring the safe and efficient movement of aircraft, passengers, and cargo within the airport environment. ORGANOGRAM Contact:"}
{"chunks_id": "chunk_401", "text": "movement of aircraft, passengers, and cargo within the airport environment. ORGANOGRAM Contact: Designation : Chief School of Regulatory Services/Functions Contact : 92 22 9260310 Email : chief.regulatory@caapakistan.com.pk Chief School of Regulatory Services/Functions"}
{"chunks_id": "chunk_402", "text": "Senior Instructor Airworthiness\nInstructor Airworthiness\nSenior Instructor Flight Standards\nInstructor Flight Standards\nSenior Instructor AT&ER\nInstructor AT&ER\nSenior Instructor AAR\nInstructor AAR\nSenior Instructor Security\nInstructor Security\nHR, Fac & Support Staff"}
{"chunks_id": "chunk_403", "text": "Deputy Chief Regulatory ROLE DMR/ QM AT CATI- 1) The responsibilities of DMR SQMS CATI Hyderabad- All CAA Airports / locations in the province of Sindh including NDB stations etc except HQCAA and JIAP Karachi”, However, Role of the Quality Manager as under:- 2) The Quality Manager of CATI is Deputy Management Representative who in CATI reports directly to Director CATI and in SQMS Directorate HQCAA as shown in the organogram of CATI. 3) Director CATI is ultimately responsible for establishing"}
{"chunks_id": "chunk_404", "text": "as shown in the organogram of CATI. 3) Director CATI is ultimately responsible for establishing and maintaining an effective quality system. At the same time, the Quality Manager is the day-to-day custodian of the quality assurance system and the Institute’s risk management program. Common objective of quality assurance at each level and during the delivery of quality services is also the responsibility of all teaching faculty and other staff of the institute within their respective area. 4)"}
{"chunks_id": "chunk_405", "text": "of all teaching faculty and other staff of the institute within their respective area. 4) The primary role of the Quality Manager is to verify, by monitoring activities in the field of training, that the standards required by the Regulatory (PCAA) and any additional requirements as established by CATI are being carried out properly under the supervision of Director CATI. The QM will have unencumbered access to all schools, training facilities and support sections of the Institute. He / She is"}
{"chunks_id": "chunk_406", "text": "access to all schools, training facilities and support sections of the Institute. He / She is responsible for ensuring that audits are conducted in accordance with the audit programme. The QM will be responsible for, but not limited to the following. o The quality manager is to ensure that the quality system is properly documented, implemented, maintained and continuously reviewed and improved. o To plan and ensure that routine / periodic and sudden inspections are carried out to detect and"}
{"chunks_id": "chunk_407", "text": "o To plan and ensure that routine / periodic and sudden inspections are carried out to detect and identify any nonconforming product or services. o To Plan, schedule and conduct Internal Audit as per Internal Audit procedure. o To ensure that proper follow up is being made for the improvement actions in accordance with the procedures in vogue for the control of nonconforming product/ service corrective and preventive actions. o The quality manager is to ensure that personnel training related to"}
{"chunks_id": "chunk_408", "text": "and preventive actions. o The quality manager is to ensure that personnel training related to the quality system is conducted. o To ensure that documentation and records are being kept and maintained in accordance to relevant PCAA / IMS document and control procedures 1. CATI was established in 1982 under the aegis of International Civil Aviation Organization (ICAO) with the grant in aid of UNDP. CATI is a highly advanced & comprehensive institute. The complex is spread over an area of 100"}
{"chunks_id": "chunk_409", "text": "CATI is a highly advanced & comprehensive institute. The complex is spread over an area of 100 acres on the eastern bank of River Indus. The institute consists of following four schools - School of Airport Services - School of Air Navigation Services - School of Aviation Management - School of Regulatory Services / Functions 2. In 1990, ICAO has established a programme TRAINAIR with the objective of improving safety & efficiency of Air Transport Navigation through developing high standards of"}
{"chunks_id": "chunk_410", "text": "of improving safety & efficiency of Air Transport Navigation through developing high standards of training for aviation on global basis. Member countries of this programme develope training packages to an international methodological and standard. Pakistan became the pioneer member of this programme and a Curriculum Development & Evaluation Unit established at CATI in 1992. Under this programme number of courses are developed and exported to many countries. In addition number of courses and"}
{"chunks_id": "chunk_411", "text": "number of courses are developed and exported to many countries. In addition number of courses and workshops have also been held at CATI to facilitate Pakistan Civil Aviation Authority, Govt. / non Government Organizations, Airlines & Corporate Sectors. LIST OF COUNTRIES TRAINEES PARTICIPANTS 1982 TO 2023 S.No. Name of Country 1 Botswana 2 Cooks Island 3 Nepal 4 Thailand 5 Maldives 6 Malaysia 7 Vietnam 8 Sri Lanka 9 Iran 10 Bangladesh 11 Lebanon 12 Kenya 13 Ghana 14 Jordon TRAINEES DATA W.E.F"}
{"chunks_id": "chunk_412", "text": "Vietnam 8 Sri Lanka 9 Iran 10 Bangladesh 11 Lebanon 12 Kenya 13 Ghana 14 Jordon TRAINEES DATA W.E.F 1982 to 2023 Grand Total Courses No. courses and Trainees from 1982 to 2023 CAA Govt./ Corporate Army PAF Navy Foreign G.Total 2474 19935 2126 48 517 99 588 23313 15 UAE 16 S.Korea 17 Korea DPRK 18 Yemen 19 Niger 20 Mauritania 21 Tanzania 22 Afghanistan 23 Egypt 24 Zimbabwe 25 Uganda 26 Sierra leone 27 Senegal 28 Comoros 29 Ethopia 30 Iraq 31 China 32 Brunei daruslam 33 Gambia 34 Philippines 35"}
{"chunks_id": "chunk_413", "text": "27 Senegal 28 Comoros 29 Ethopia 30 Iraq 31 China 32 Brunei daruslam 33 Gambia 34 Philippines 35 Mauritius 36 Sudan 37 Soloman Island 38 Zambia 39 Nigeria 40 Laos 41 State of Micronesia 42 Papua New Guinea 43 Tonga 44 Malawi 45 De coated Loire 46 Indonesia 47 Fiji Island 48 Lycee 49 Maynmar CATI has also signed MOU with Airport and Aviation Services (Sri Lanka) Limited for provision of trainings to aviation personnel of Sri Lanka. CORPORATE SECTOR / GOVERNMENT SECTOR REGULAR CLIENTS OF CATI"}
{"chunks_id": "chunk_414", "text": "to aviation personnel of Sri Lanka. CORPORATE SECTOR / GOVERNMENT SECTOR REGULAR CLIENTS OF CATI Notable Clients of CATI includes :- Pakistan Air force, Pakistan Army, Pakistan Navy, Sialkot International Airport, BHP Petroleum Ltd., AES Lal Pir (Pvt.) Ltd., Fatima Energy Ltd. OMV Pakistan, ENI Pakistan Ltd, Engro Fertilizers Ltd., Mari Petroleum Ltd., Pakistan Petroleum Ltd. (PPL), Reko Diq (Mining Company) etc. AIM & OBJECTIVE OF AIR NAVIGATION SERVICES&COM.OPS SCHOOL THE OBJECTIVE OF THE"}
{"chunks_id": "chunk_415", "text": "Company) etc. AIM & OBJECTIVE OF AIR NAVIGATION SERVICES&COM.OPS SCHOOL THE OBJECTIVE OF THE SCHOOL IS TO IMPART TRAINING IN THE DISCIPLINES OF AIR TRAFFIC SERVICES INCLUDING RADAR AND COMMUNICATION OPERATIONS OUR AIM IS TO MEET THE TRAINING NEEDS OF FUTURE AIR NAVIGATION IN THE FIELD OF AIR TRAFFIC SERVICES & COMMUNICATION OPERATION AIR TRAFFIC SERVICES COURSES Sr. No. DOCUMENT / RECORD TITLE DURATION NO. OF TRAINEES 1 Aerodrome/Area Control (Procedure) Course 28 Weeks 06-16 2 Basic ATC Course"}
{"chunks_id": "chunk_416", "text": "NO. OF TRAINEES 1 Aerodrome/Area Control (Procedure) Course 28 Weeks 06-16 2 Basic ATC Course 40 Weeks 06-16 3 Aerodrome Control Course 14 Weeks 06-16 4 Approach Control (Procedure) Course 08 Weeks 06-10 5 Area Control (Procedure) Course 08 Weeks 06-10 6 Area / Approach Control Surveillance Course 12 Weeks 06-12 7 Approach Control Surveillance Course 05 Weeks 06-12 8 Area Control Surveillance Course 08 Weeks 06-12 9 ATC Assistant Course 08 Weeks 08-18 10 ATC Assistant (Refresher) Course 02"}
{"chunks_id": "chunk_417", "text": "Course 08 Weeks 06-12 9 ATC Assistant Course 08 Weeks 08-18 10 ATC Assistant (Refresher) Course 02 Weeks 12-16 11 Basic Search & Rescue Course 02 Weeks 10-30 12 ELP for ATCO's Course 02 Weeks 08-16 13 Flight Procedure Design (Conventional) Course 02 Weeks 06-08 14 Flight Procedure Design (PBN) Course 03 Weeks 06-08 15 ATC Refresher (Abridged) for Officer Course 01 Week 06-16 16 Global Reporting Format (GRF) Course 01 Week 06-16 17 Aircraft Operation at Un-control Aerodrome Course 01 Week 06-16"}
{"chunks_id": "chunk_418", "text": "(GRF) Course 01 Week 06-16 17 Aircraft Operation at Un-control Aerodrome Course 01 Week 06-16 18 Global Reporting Format (GRF) for Staff Course 02 Days 06-16 19 New GRF for Officer Course 03 Days 06-24 20 ATC Assistant Refresher (Abridged) Course 01 Week 06-12 21 ELP Course (Extended Level) for ATCO'S 04 Weeks 08-16 22 Aerodrome Safeguarding & OLS Course 01 Week 06-16 23 SAR Coordinator Course 02 weeks 10-30 24 Managing Aeronautical Information Course 01 Week 10-30 COMMUNICATION OPERATIONS"}
{"chunks_id": "chunk_419", "text": "02 weeks 10-30 24 Managing Aeronautical Information Course 01 Week 10-30 COMMUNICATION OPERATIONS COURSES SR. NO. DOCUMENT / RECORD TITLE DURATION NO. OF TRAINEE 1. Communication Operation Officer (COO) Course 14 weeks 06-08 2. Aeronautical Fixed Service Operator (AFSO) Course 10 weeks 06-08 3. Aeronautical Communication Service Supervisor Course 06 weeks 06-08 4. COO (Refresher) Course 02 weeks 06-08 5. ACSS (Refresher) Course 01 week 06-08 6. IDS UBIMEX AMHS (Officer) Course 02 weeks 06-08 7."}
{"chunks_id": "chunk_420", "text": "5. ACSS (Refresher) Course 01 week 06-08 6. IDS UBIMEX AMHS (Officer) Course 02 weeks 06-08 7. IDS UBIMEX AMHS (Staff) Course 01 week 06-08 8. IDS Air Nav AMHS (CRONOS) Database (Officer) Course 03 weeks 06-08 9. IDS Air Nav AMHS (CRONOS) Database (Staff) Course 02 weeks 06-08 10. Aeronautical Mobile Service Operators Course 06 weeks 06-08 11. IDS AMHS Advance Officer Course 02 weeks 06-08 12. IDS AMHS Orientation Course 01 week 06-08 13. Telephone Operation & Courtesy Course 02 weeks 06-08 14."}
{"chunks_id": "chunk_421", "text": "AMHS Orientation Course 01 week 06-08 13. Telephone Operation & Courtesy Course 02 weeks 06-08 14. AFSO Elementary Course 04 weeks 06-08 15. SDCPS Software (IOU) Course 01 Week 06-08 16. ARFSM (for Officer) Course 01 Week 06-08 17. Common Aeronautical Virtual Private Network (CRV) Officers Course 01 Week 06-08 HR, Fac & Support Staff LAB Asst. Elects/ NAV Aids/Comm/Surveil LAB Supdt. Elects/ NAV Aids/Comm/Surveil OI/C RADAR Simulator Instructors Electronics/NAV Aids/Comm/Surveillance Sr."}
{"chunks_id": "chunk_422", "text": "NAV Aids/Comm/Surveil OI/C RADAR Simulator Instructors Electronics/NAV Aids/Comm/Surveillance Sr. Instructors Electronics/NAV Aids/Comm/Surveillance Dy. Chief CNS Engineering Block HR Facilitation & Support Staff Pseudo Pilot Demonstrator ATS Language Instructor Instructor ATS Dy. Chief ATS & Com. Ops Block Sr. Instructor ATS OI/C Com. Ops Sr. Instructor Com. Centre & EPABX Instructor Com. Ops. Demonstrator Com. Ops. Supervisor Com. Ops. Chief of ANS School / Chief Instructor Empowering"}
{"chunks_id": "chunk_423", "text": "Ops. Demonstrator Com. Ops. Supervisor Com. Ops. Chief of ANS School / Chief Instructor Empowering Tomorrow's Aviation Leaders Welcome to the School of Airport Services, a launch pad for aspiring aviation professionals. With a fusion of theoretical knowledge and hands-on experiences in state-of-the-art labs, we prepare individuals to thrive in the dynamic, demanding, and ever-evolving aviation industry. At our institute, innovation, expertise, and a profound passion for aviation converge to"}
{"chunks_id": "chunk_424", "text": "industry. At our institute, innovation, expertise, and a profound passion for aviation converge to shape the aviation leaders of tomorrow. Training Offerings At the School of Airport Services, we pride ourselves on offering comprehensive trainings for airport professionals in a spectrum of essential areas that form the backbone of airport operations such as the following: Airport Services: • Aerodrome Operations • Airside Safety • Basic Aviation Security • Airside & Aviation Security"}
{"chunks_id": "chunk_425", "text": "• Aerodrome Operations • Airside Safety • Basic Aviation Security • Airside & Aviation Security Inspections • Cargo Procedures • Commercial & Estate Operations • Facilitation and Hospitality Management • Motor Transport Drivers Engineering Services: • Airport Ground Lighting • Aerodrome Power Supply • Aerodrome Friction Testing • E&M Technicians Training • Civil Works Procedures • Cable Faults and Repairs • Fire Fighting Vehicle Operations • HVAC Systems • Passenger Boarding Bridges Operations"}
{"chunks_id": "chunk_426", "text": "Repairs • Fire Fighting Vehicle Operations • HVAC Systems • Passenger Boarding Bridges Operations • Understanding Public Procurement Rules Rescue and Fire Fighting Services: • Aerodrome Rescue & Fire Fighting • Breathing Apparatus Usage • Fire Officer Programs • Refresher Courses for Fire Officials at Different Levels • Special Vehicle Operation Training Training Facilities Our cutting-edge infrastructure includes labs designed for practical, hands-on training: • Aircraft Mockup Firefighting"}
{"chunks_id": "chunk_427", "text": "includes labs designed for practical, hands-on training: • Aircraft Mockup Firefighting Simulator • Breathing Apparatus Compressor • Fire Screen & Prevention Labs • Basic Electrical & Vocational Training Labs • Airfield Lighting & HVAC Labs Experienced Faculty Driving Excellence Our faculty, recognized across Pakistan's aviation landscape, serves as mentors and guides. With rich industry experience, they infuse the curriculum with real-life scenarios and case studies, ensuring practical"}
{"chunks_id": "chunk_428", "text": "they infuse the curriculum with real-life scenarios and case studies, ensuring practical implications are thoroughly understood. Their dedication goes beyond the classroom, nurturing professionals poised to excel in the dynamic aviation industry. Nurturing Aviation Leadership The School of Airport Services stands as a testament to our faculty's commitment to grooming the next generation of aviation leaders. Their practical wisdom ensures graduates are well-prepared to tackle the challenges and"}
{"chunks_id": "chunk_429", "text": "leaders. Their practical wisdom ensures graduates are well-prepared to tackle the challenges and opportunities in the aviation sphere, marking their journey toward impactful careers."}
